_صوابدیدی
"%s" پر واپس جائیں
کلید نیویگیشن فعال کرین
ایل ایکس لاؤنچر کو چلانے کے لیے صارفین کو اوپر/نیچے/بائیں/دائیں/ٹیب/انٹر کلیدوں کو استعمال کرنے کی اجازت دیں
کالم خلاء
دو متواتر کالموں کے درمیان خلاء کی کمیت
سطر خلاء
دو متواتر سطروں کے درمیان خلاء کی کمیت
ہوموجینئس
ذیلی کو کب ایک حجم کا ہونا چاہیے
کمانڈ نہیں پائی گئی
ایک دریچے میں ایک سے زیادہ ٹرمنل
Terminator
موجودہ لوکیل
مغربی
مرکزی یورپی
جنوبی یورپ
بالٹک
سرلک
عربی
یونان
عبرانی گيا
ہیبرو
تركی
نارڈک
کیلٹک
رومینیائی
یونیکوڈ
آرمینیائی
چینی روایتی
سرلک/روسی
جاپانی
کوریائی
چين
جارجئین
سرلک/يوکرينی
کرو شين
ہندی
فارسی
ٹیب
ٹیب بند کریں
رسمی آئکن برائے xmms2 از آرناؤڈ ڈیڈری
موسیقی پلیئر برائے ایل ایکس ڈی ای
سادہ مواجہ XMMS2 کلائنٹ
ایل ایکس موسیقی
بِٹ قیمت:
صوتی فائلیں
تمام فائلیں
ربط لکھیں
چل رہا ہے:
فنکار
ایلبم
عنوان
طول
طے شدہ
موقوف
چلائیں
نئی پلے لسٹ بنائیں
غلطی
اعلی لینکس صوتی آرکٹیکچر
ڈیوائس:
مکسر:
صوتی نظام کھولیں
کراس-پلیٹ فارم صوتی ماحاصل لائبریری
پلس آڈیو:
نام:
سرور:
سنک:
ائیر ٹونز
جیک JACK آڈیو کنکشن کِٹ
ڈسک رائٹر:
سمت ڈائریکٹری:
فائلیں یا فولڈر شامل کریں
پلے لسٹ میں شامل کریں
ربط شامل کریں
پلے لسٹ میں فائلیں شامل کریں
تمام
_نئی پلے لسٹ بنائیں
حالیہ پلے لسٹ
کلیدی لفظ یہاں لکھیں
پسندیدہ
فائل خصوصیات
فلٹر:
حالیہ چلائے گئے ٹریک تلاش کریں
میڈیا لائبریری
اگلا
مت دہرائیں
چلائیں/موقوف کریں
سابقہ
تمام عناصر حذف کریں
پلے لسٹ سے حذف کریں
منتخب کردہ عناصر حذف کریں
پلے لسٹ سے عناصر حذف کریں
سب دہرائیں
حالیہ دہرائیں
پلے لسٹ دکھائیں
روکیں
ٹریک کا نام
حالیہ پلے لسٹ _حذف کریں
_فائل
_ہدایات
حالیہ چلائی گئی پلے لسٹ _تلاش کریں
_پلے لسٹ
پلے لسٹ پر _منتقل ہوں
_اوزار
_منظر
مین ونڈو _دکھائیں
<b>صوتی سی ڈی</b>
<b>ماحاصل</b>
صوتی
بفر حجم:
سی ڈی روم ڈیوائس:
ایل ایکس موسیقی کو بند کرنے پر پس منظر میں چلاتے رہیں
طے شدہ ID3 V1 انکوڈنگ:
عام
ک.ب
بند کرنے پر نظام ٹرے میں لے جائیں
متفرق
موسیقی کی فائلیں صارف مواجہ کے بغیر بھی چلائی جاسکتی ہیں تاکہ نظام کے ذرائع بچائے جاسکیں
پلگ ان:
ترجیحات
نظام ٹرے آئکن دکھائیں
<b>ایلبم: </b>
<b>فنکار: </b>
<b>تبصرہ: </b>
<b>فائل نوعیت: </b>
<b>فائل: </b>
<b>حجم: </b>
<b>عنوان: </b>
وقت نماز : %s
%d %s تک %s نماز


۔%d %s اور %d %s اور %s نماز
،
منٹ۔ %d تک %s نماز
کا وقت هے۔ %s یه نماز
ترجیحات میں طریقهء حساب غلط هے، طریقه ۵ زیر استعمال: مسلم عالمی لیگ 

%s :غلطی

تمام امسال (فاءلیں)۔
قابل استعمال امسال (فاءلیں)۔
منبر اوقات نماز
نظر انداز
محرم
صفر
ربیع الاول
ربیع الثانی
جمادی الاول
جمادی الثانی
رجب
شعبان
رمضان
شوال
ذی قعد
ذی الحج
صبح
طلوع
ظهر
عصر
مغرب
عشاء
ابتدا میں مین وِنڈو نگاه سے اوجهل رهے۔
مکه میں!۔
سمتِ قبله
مشرق
مغرب
منبر ویب ساءٹ
جگهوں کی ڈیٹابیس لادنے میں ناکامی۔ براءے مهربانی اس مسءلے کو رپورٹ کیجیءے۔
<b>طریقهء حساب</b>
<b>تنبيهات</b>
<b>اختیارات</b>
<b>اوقات</b>
بارے
تقدیم
اذان
حساب کی غلطی ۔۔۔
کیلنڈر
شهر
تفصیلات شهر
نام شهر:
2006, 2007 Djihed Afifi <djihed@gmail.com> (c) حقوق نقل
موجوده تاریخ دکهانے میں مسءله
تفصیلات شهر تبدیل کیجیءے
مصری عام سروے اتهارٹی
جامعه اسلامی ساءنس، کراچی (شافعی)۔
جامعه اسلامی ساءنس، کراچی (حنفی)۔
شمال امریکه کی اسلامی سوساءٹی
۔(MWL) مسلم عالمی لیگ
امﹼ القراء، سعودی عرب
عشاء تک مقرره وقفه (همیشه ٩٠ منٹ)
شهر تلاش کیجءے
اگر آپ اپنا مقام تلاش نهےں کر سکے تو براءے مهربانی www.islamicfinder.org پر جاکر تلاش کریں۔
عرض بلد:
مقام:
طول بلد:
منبر نماز کیلنڈر
عام اذان:
تنبيهات
اذان چلاءیے
نمازوں کا کیلنڈر
اوقات نماز
آپکے ڈیسکٹاپ پر اوقات نماز
ترجیحات
چھوڑیں
اذان فاءل چُنیں
دکهاءیں / چُهپاءیں
ٹرے میں چهوٹا کر کے چلاءیں۔
اذان روکیے
اذان صبح:
علاقاءی وقت:
جدول اوقات:
آج
مقام چُنیے:
اگلی تلاش
تلاش:
منبربناتے وقت اس میں تنبیھات شامل نھیں کی گءیں۔
منٹ
مترجم
طریقهء حساب
شهر کی اونچاءی
شهر کا عرض بلد
شهر کا طول بلد
شهر کا نام
وقفهء تنبيهات
اذانِ صبح کی فاءل کارسته۔
اذان کی فاءل کارسته۔
بند بٹن کلک کرنے پر ونڈو کو چھپانے کی بجاءے بند کریں۔
ٹاءم زون، جی۔ایم۔ٹی سے فرق
توجه دلاءی جاءے یا نهیں
اسلامی اوقات نماز
کلاوارو - لائحہ اول
اساسیات سیکھنے میں شرماؤ مت!
آپ کی انگلیوں کے لیے آغازی تربیت۔
آغازی تربیت کے پہلے اقدام
تصادفی کلید مشق سے کلیدی‌تختہ کی یاداشت۔
تصادفی کلیدوں سے مشق
مشقِ تصادفی الفاظ سے اسراعِ لمس۔
تصادفی الفاظ سے مشق
مکمل شذرہ (پیراگراف)  مشق سے استعداد بڑھاؤ۔
مکمل عبارتیں سے مشق
مطبقیہ 1 اور 2 کے لیے کلیدی تختہ خاکے۔ نیز سیال پن مقابلہ میں اطلاعاتی استعمال ہوتے ہیں۔
_کلیدی تختہ:
مطبقیہ 3 اور 4 کے لے زبان۔
_زبان:
متغیرا
کلاوارو
ملک / رواج
یہاں تمہاری زبان۔
اس پروگرام بارے چھوٹا سا ٹوٹکا۔
_مدد
اس پروگرام بارے جامع اطلاع۔
_بارے-
اطلاقیہ سے فوراً خروج کرو۔
_بند
دوسرے مشقیں/اسباق اثقال کرو
_دوسری عبارتیں
_سبق:
اس سبق میں استعمال ہونے والے مجموعہ حروف کی تدوین کرو۔
اسباق  44 سے 50 میں استعمال ہونے والے مجموعہ حروف کی تدوین کرو۔
یہ مخصوص مشق ہے، تمہاری شرحِ اغلاط نمایہ کے موافق۔
عبارت کی مشق کے لیے عبارت کو یہاں کھینچ اور گِراؤ ۔
مشق کی شروعِ نو کے لیے یہاں دباؤ۔ گرم کلید: [Ctrl R]
مجازی کلیدی‌تختہ دکھاؤ، اور اُنگلیوں اور کلیدوں کے درمیان نسب۔
_کلیدی تختہ
مشق کھڑکی میں استعمال ہونے والا فونٹ منتخب کرو۔
_فونٹ
اس کو نشان زدہ رکھو، اگر آپ وہ اچھی ٹوں ٹوں سننا چاہتے ہو۔
_ٹوں ٹوں
نصابی اطلاع
مشقوں کے ساتھ سیکھنے کی پیش رفت دکھاتے ہوئے چارٹ۔
_پیش رفت
مقامی اور بیرونی دوسرے صارفین کے اسکور دکھاؤ۔
_بالا 10
لائحۂ اول کی طرف واپسی۔
لائحہ کو واپسی
یہ کھڑکی بند کرو۔
فونٹ تعریف
بالا 10
مقامی اسکور 
بیرونی اسکور
اضافی اطلاعات دکھاؤ
اضافی اطلاعات چھپاؤ
اپنے مقامی اسکور ویب پر طبع کرو۔
_شمولیت
ویب سے تابہ امروز ترین رتبہ زیر اثقال کرو
_تجدید
بارے 'کلاوارو'
ایک اور لمسی ٹائپنگ اتالیق
ہمیشہ یاد رکھو: کوئی تمہیں چاہتا ہے!
منتخب شدہ من پسند خاکہ ہٹاؤ۔
_ہٹاؤ
کلیدوں پر شِفٹ (shift) کے اثر کی تدویم کرتا ہے۔ اونچے اور نچلے حروف کی کلیدوں کے درمیان ادلی بدلی کرتا ہے۔
نوارِ فضا (اسپیس بار)
انگوٹھے
Ctrl
Caps
_محفوظ بطور :
پچھلا تظاہرہ دکھاؤ۔
_پچھلا قدم
اگلا تظاہرہ دکھاؤ۔
_اگلا قدم
بغیر کسی تبدیلی کے واپسی۔
_منسوخ
موجودہ کلیدی تختہ خاکہ کو اُوپر مخصوص کردہ نام سے محفوظ کرو۔
_محفوظ اور استعمال
اگر آپ کو یہ خوبصورت ہاتھ یہاں پسند ہیں، تو کھڑکی بند کرنے سے پہلے یہاں کلک کرو۔
_ہاتھ رکھو
زبان تبدیل
توجہ!
کیا آپ توثیق کرتے ہو؟
_ناں
_ہاں
باز_نام کرو:
منتخب شدہ مفردہ کو باز نام کرو۔
ٹیکسٹ ملف (فائل) پڑھو اور یہاں اس کی نقل جمع کرو۔ ملف کی تشفیر UTF-8 میں ہونا چاہیے۔
_متن مِلف (فائل) کھولو
جو عبارت تختہ تراشہ پر نقل کی گئ تھی، وہ چسپاں کرو۔
_تختہ تراشہ سے چسپاں کرو
منتخب شدہ مفردہ کو ہٹاؤ۔
_نقل شدہ مِلف (فائل) ہٹاؤ
مشق  کی تخلیق کے لیے منتخب مفردہ کا اطلاق کرو۔
_اطلاق
کلاوارو - پیش‌رفت
قدر
تاریخ اور وقت
ہر مِطبقیہ کا تمام پیشرفت معطیات صاف کرو۔
_طاقمِ‌نو!
کھڑکی بند کرو، اور مشق کی طرف واپسی۔
کلاوارو - مِلف (فائل) منتخب
_کھولو
مدد؟
اس اطلاقیہ کا لائحۂ اول بالکل سیدھا ہے۔ بس جس طرح کی مشق لینا چاہو، اس کا انتخاب کرو۔ تظاہرہ پرکسی زریہ کو کلک کرنے سے نہ ہچکچاؤ ۔ زریہ کبھی تمہیں نقصان نہیں پہنچائے گا!
نیز تظابیط (کنٹرول) کے ٹوٹکے ہیں جو فارہ (ماؤس) کو ان پر منڈالنے سے ظاہر ہوتے ہیں۔ یہ ٹوتکے بہت کام آ سکتے ہیں۔ یہ جاننے کے لیے کہ یہ ٹوٹکے کس طرح کام کرتے ہیں، فارہ کو نیچے زریہ پر قائم کرو اور بغیر کلک کیے ٹوٹکے کے ظاہر ہونے کا انتظار کرو_
یہ ٹوٹکا ہے۔ اب یہ زِرَیہ (بٹن) دبا کر آپ لائحہ اول کی طرف واپس ہو جاؤ۔
(من پسند)
(من پسند کی تدوین)
(معین)
تعارف
اساسی نصاب
ملائمیت
رفتار
اسیال پن
کلیدیں: 
واصلت_
صارفی خاکہ  (کو مٹا کر اس کے) اُوپر-لکھو
یہ موجود کلیدی تختہ مٹا کر اوپر-لکھ دے گا۔
صارفی خاکہ ہٹاؤ
یہ موجود کلیدی تختہ خاکہ کو ہٹا دے گا۔
پیش رفت معطیات کی طاقمِ نو
یہ چارٹ میں دکھایا تمام پیش رفت معطیات حذف کر دے گا۔
درستی
(WPM)
غلطیاں
اسکور
یہ اساسی نصاب تمہارے تظاہرہ پر  پیش کردہ حروف کو پڑھنے اور ارتباطی کلیدیں ٹائپ کرنے پر مرکوز ہے۔ اپنے ہاتھ تمام وقت صحیح سمت میں کلیدی تختہ کی گھر قطار پر رکھنا یاد رہے (لائحہ اول پر تعارف دیکھو)۔
ہر سلسلہ میں استعمال ہونے والا مجموعۂ کلید اوپر پیغام میں دکھایا جائے گا۔ ہو سکتا ہے کہ [فضاء (اسپیس)]، [شفٹ]، اور [داخل (اینٹر)] کلیدیں نظر نہ آئیں مگر اکثر اسعمال ہوتی ہیں۔
نیچے دیا پیغام تمہاری دبائی گئی کلید کی تقلید اور بازگشت کرتا ہے۔ بضرورت، یہ تبدیل ہو گا اور تمہارے سے طلب افعال بارے ہدایات دکھائے گا۔
یہاں تم اپنی کلیدوں کی  یاداشت کی مشق اور  بہتری کر سکتے ہو۔ لغو الفاظ پر مشتمل فقرے پیش کیے جائینگے جن میں کچھ عدد اور علامتوں کی آمیزش ہو گی۔
اسباق کے متن، زبان، اور کلیدی تختہ کو باہمی آزاد رکھنے کی خاطر، اعراب والے حروفی تولیف غالباً ظاہر نہیں ہونگے۔ حقیقی دنیا کے فقروں کے لیے براہ کرم لائحہ اول پر چوتھا اختیار استعمال کرو (بارے سیال پن)
ہر مشق کے بعد ایک مختصر لوحِ احصاء جس میں تمہاری کارکردگی پر نظر ثانی اور ساتھ کچھ متعلقہ تبصرہ ہو گا۔
یہ مشق دوسری سے بہت مشابہ ہے، ملائمیت والی۔ فرق یہ ہے کہ یہاں تم حقیقی الفاظ ٹائپ کرو گے۔
معین زبان وہی ہے جو سطح البین کی حقیقی۔ مگر تم کسی بھی عبارت کا انتخاب کر سکتے ہو جس کے الفاظ تم استعمال کرنا چاہو ۔ اوپر 'دوسرا' اختیار دباؤ اور اُن عبارتوں والی مِلفوں (فائل) کو جمع کرو۔
اس مشق میں زور رفتار پر ہے، اسلئے، تم کو حقیقاً تیز ٹائپ کرنا چاہیے اور میں اسی وقت مدح کرونگی جب تم اس کے مستحق ہو گے!
اب ہم مکمل جملے اور پیرے استعمال کریں گے جو منطقاً معقول ہونگے۔ ممکن ہے کہ یہ  ٹائپ کرتے وقت تمہاری توجہ ہٹائے اگر تم ادخال کے معنی سمجھنے کی کوشش میں پڑ جاؤ۔ پچھلی مشق کا مقصد تمہیں بغیر متن کی تفسیر اور تحلیل کے ٹائپ کروانا تھا۔
ہمارے کہنے سے یہ متقض نہیں کہ خط نویس کو  بغیر سمجھے کہ وہ کیا ٹائپ کر رہا ہے، روبالہ کی ماند اسلوک ہونا چاہیے۔ ہماری آرزو یہ ہے کہ ٹائپنگ کا ہنُر خودکار منعکس کی طرح ترقی پائے، بعینہ چلنے، بولنے، وغیرہ کے عملوں کی طرح۔ یہ منزل پا لینے کے بعد ٹائپنگ کا عمل خودکار ہو جائے گا جس کے لیے بہت کم ارتکاز کی ضرورت ہو گی۔ اس کے بعد تم متن کے حقیقی معنی کی طرف توجہ دے سکو گے۔
یہ مشقیں لمبی ہیں۔ ہر مشق تین پیرہ پر مستمل ہے اور زور درستی اور آہنگ پر ہے، کم از کم رفتار کی طلب کے ساتھ۔ یہاں تم کو پشتی فضاء (بیک اسپیس) کلید کے استعمال سے کوئی غلطی کو درست کرنا ہو گا۔ دوسرے الفاظ میں صرف غلطی کے بغیر ادخال قبول کیا جائے گا۔
ہاتھوں اور اُنگلیوں کا صحیح مقام پر ہونا کارگر ٹائپنگ کے لیے بہت اہم ہے۔ تم تیز سیکھو اور بہتر ٹائپ کرو گے اگر اگلی سفارشات کی پیروی کرو۔
کلیدی تختہ کے وسط میں جن دوکلیدوں پر چھوٹا سا اُبھرا ہوا نشان ہے، اِن پر سَرِ انگشتِ شہادت (اُنگلیوں) کو رکھا جاتا ہے۔
یہ نشان تمہاری انگلیوں کو صحیح مقام پر رکھنے کے لیے لمسی کُنڈوں کا کام کرتے ہیں۔ اسطرح  یہ جاننے کے لیے کہ تمہاری انگلیاں صحیح مقام پر ہیں، تھوڑا تجربہ کے بعد کلیدی تختہ پر نظر ڈالنے کی ضرورت نہیں رہے گی۔
دوسری اُنگلیوں کی انگشتیں قدرتاً انگشتِ شہادت کے پہلو میں کلیدی تختہ کی اُسی قطار میں رکھی ہوتی ہیں۔
تمہارے انگوٹھوں کے باہریلے کنارے نوارِ فضا (اسپیس بار) پر ٹھیرتے ہیں۔
ہاتھوں کے کلائی سے قریبی حصہ (اساس) کو کلیدی تختہ کے باہر میز پر ٹکایا جاتا ہے۔ اس سہارا کے بغیر بازو جلد تھک جائیں گے۔
اسے ہاتھوں کا گھر مقام کہا جاتا ہے۔ یہاں سے اُنگلیاں پورے کلیدی تختہ پر چلتی ہیں، تمام کلیدوں تک ممکنہ حد تک قدرتاً اور تیزرفتاری سے پہنچتی ہیں۔ اس منزل تک پہنچنے کے لیے ہر انگلی اور کلید کے درمیان خاص نسب کا استعمال کیا جاتا ہے۔ جیسے تم یہ اساسی نصاب مکمل کرو گے یہ نسب بتدریج سیکھو گے۔
انگلیوں اور کلیدوں کے درمیان نسب سیکھتے ہوئے یہ بہت اہم ہے کہ تم صرف اس انگلی کو چلاؤ جس نے کلید دبانا ہو اور باقی انگلیاں کو گھر مقام پر رہنے دو۔
اوپر والے نسب کو یاداشت میں ڈالنے کے بعد، تم اس پچھلے قاعدہ کو  کچھ ڈھیل دے سکتے ہو تاکہ تم  ٹائپنگ کرتے ہوئے زیادہ رفتار حاصل کر سکو۔
تمہیں اساسی نصاب پر تربیت کے لیے تیار ہونا چاہیے۔ کامیاب ٹائپسٹ بننے کے لیے کوشش اور صبر کی ضرورت ہو گی۔ ہمیں بھروسا ہے کہ تم میں یہ ہیں اور تمہاری کامیابی کو دیکھنے کے منتظر ہیں!
قدم %i
ہاتھوں کو مقام پر رکھنے کے لیے
آگے بڑھو!
اوپر والی کسی کلید پر کلک کرو یہ دیکھنے کے لیے کہ کونسی اُنگلی استعمال کرنی ہے:
کلیدی تختہ
من پسند کلیدی تختہ خاکہ کو تخلیق یا تبدیل کرو
چھوٹی اُنگلی
انگوٹھی والی اُنگلی
وسطی اُنگلی
شہادتی اُنگلی
کوئ کلید دباؤ اور میری تدوین کرو
سبق:
شذرے:
کلاوارو - اساسی نصاب
کلاوارو - ملائمیت
ملائمیت مشقیں: اُنگلیوں کے ردعمل کی خودکار ی، تمام کلیدی تختہ پر ٹائپنگ۔
کلاوارو - سمتار (رفتار)
رفتار مشقیں: حقیقی الفاظ ٹائپنگ کرتے اسراع
کلاوارو ۔ سیال‌پن
سیال پن مشقیں: صحیح فہم شذرہ کی درست ٹائپنگ۔
مشق کا اختتام۔ دوسری کے آغاز کے لیے [Enter] دباؤ۔
کلیدوں کے مقام سیکھنا۔
مشق کے آغاز کے لیے کوئ کلید دباؤ۔ 
جب تم تیار ہو، ٹائپنگ کا آغاز کر دو۔ 
پیغام: اس اجلاس کی نوشتہ گیری نہیں انجام دی گئ: ٹائپ کیے گئے حروف کی تعداد  (%i) زیادہ ہونا چاہیے (%i) سے۔
معین
پیغام: آپ بالا 10 فہرست میں داخل ہو گئے ہو، زبردست!
پیغام: جو عبارت آپ نے ٹائپ کی وہ  منتخب شدہ زبان کی عام عبارتوں سے مماثلت نہیں رکھتی: ہم اس کا بلا 10 مقابلہ میں شمار نہیں کر سکتے۔
احصاء
گزرا وقت:


شرحِ اغلاط:
درستگی:
منزل:
حروف فی ثانیہ:
(CPS)
الفاظ فی دقیقہ:
سیال‌پن:
تبصرے:
لگتا ہے کہ کلیدوں کے مقام سیکھ لیے ہیں!
 مبارکباد!
 آپ نے پورا اساسی نصاب مکمل کر لیا ہے۔
 اگلی قِسم کی مشق پر جاؤ: ملائمیت۔
 وہاں آپ اولین درستگی کی مشق کرو گے۔

 سب اچھا، اب آپ کو پتہ چل گیا!
 اگلے سبق پر جاؤ۔

آپ کی شرحِ درستگی 90% سے کم ہے...
کیا براہِ کرم آپ دوبارہ کوشش کر کے اسے بہتر بنا سکتے ہو؟

 آپ بہتر کر رہے ہو۔ مگر...
 کیا آپ درستگی کو 95% تک پہنچا سکتے ہو؟

آ پ تقریباً اُدھر پہنچ گئے ہو، مگر درستگی کی شرح اب بھی %.0f%% سے کم ہے۔
کچھ بار مزید کوشش کرو، یا  ممکن ہے کہ آپ پریشان ہو رہے ہو، اسلئے دوسری قسم کی مشق پر چلے جاؤ۔

 بہت اچھا!
 آپ %.0f%% شرحِ درستگی سے کامیاب ہو گئے ہو۔
 اب اپنی رفتار بڑھانے کا وقت ہے۔
 لائحۂ اول پر 3ویں مشق پر جاو۔

چسپاں_یا_گِرایا
آپ ابھی شروع کر رہے ہو۔
صبر کرو، ہر روز دوبارہ کوشش کرو، آرام کرو اور اتنی فکر مت کرو:
استقامت اور مشق سے آپ کی رفتار بہتر ہوتی جائے گی۔

 شاہراہ سے اب بھی دور۔ آپ بہتر کر سکتے ہو...
 کم از کم 20 الفاظ فی دقیقہ (WPS) کی کوشش کرو۔

 آپ بہتر کر رہے ہو، مگر تیز جانے کی ضرورت ہے۔
 اور درستگی کو مت بھولنا۔ 30 الفاظ فی دقیقہ (WPS) کی کوشش کرو۔

 اچھا۔ اب آپ کو دوڑنے کی ضرورت ہے۔
 کیا آپ 40 الفاظ فی دقیقہ (WPS) تک پہنچ سکتے ہو؟

 بہت خوب۔ آپ تقریباً وہاں پہنچ گئے۔
 کیا آپ بالآخر %.0f الفاظ فی دقیقہ (WPS) تک پہنچ سکتے ہو؟

 شاندار۔ اس نصاب کے لیے، یہ کافی ہے۔
 اب سیال پن کی مشقیں کرو، ٹھیک؟

 تیز! کیا آپ مقابلہ کے لیے تربیت کر رہے ہو؟
 تو، 70 الفاظ فی دقیقہ (WPS) تک جانے کی کوشش کرو۔

 بالا "qwerty" کا۔ اب وقت ہے ڈوارک اسلوب کا۔
 کیا آپ کو 80 WPM پہنچنے سے ڈر لگتا ہے۔

 ڈوارک اسلوب پر غلبہ!
 کیا آپ 90 WPM پر اُڑ سکتے ہو؟

 ڈوارک آقا!
 میرے پاس تحسین کے اظہار کے لیے الفاظ نہیں!

 آپ درست ٹائپ کرتے ہو، مگر تیز نہیں۔
 کیا آپ %.0f الفاظ فی دقیقہ (WPS) تک پہنچ سکتے ہو؟

 آپ کی تال کچھ اتنی دائم نہیں ہے۔ قَرار پاؤ۔
 اب کے لیے، سیال‌پن کو %i%%.سے اوپر لے جانے کی کوشش کرو۔

آپ وہاں پہنچ رہے ہو۔ زیادہ روانی سے ٹائپ کرو۔
مجھے %.0f%%. سے زیادہ سیال پین چاہیے 

 مبارکباد! 
 مجھے لگتا ہے کہ تم پیشہ ور ہو۔
تم کو اس پروگرام (میری) مزید ضرورت نہیں۔
امید ہے کہ تم لطف اندوز ہوئے۔ شکریہ اور خوش رہو!

 آپ اتنا تیز کیسے ٹائپ کر لیتے ہو؟
 آپ میری تمام توقعات سے زائد ہو۔
 کیا آپ آلہ ہو؟ کیا آپ مجھے پڑھا سکتے ہو؟
 میں آپ کی مزید مدد نہیں کر سکتی۔ کسی ماہر کے پاس جاؤ!

نام
حروف
کب
خالی رتبہ۔ براہ کرم سیال پن کی مشق کرو۔
مِلفات (فائل) زِیر اثقال نہیں کر سکی
مِلا نہیں
کیا آپ کو یقین ہے کہ آپ نے اسے اپنے نظام میں نصب کیا ہؤا ہے؟
میزبان معیل سے مِلف  (فائل) زِیر اثقال نہیں ہو سکی۔
ملفات (فائلیں) زَبر اثقال نہیں کی جا سکیں۔
سکور زِیر/زَبر اثقال نہیں کر سکی۔
پرنٹر
برخاست
xfprint4-manager کو برخاست کریں
بابت
xfprint4-manager کی بابت
xfprint4-manager کے بارے میں معلومات ظاہر کریں
پرنٹر منیجر
عرفی نام
حالت
Xfprint پرنٹر منیجر
پہلا منتظم
منتظم
نا معلوم
انتظار میں
عمل کاری
رکا ہوا
بند کریں
انتظار ونڈو بند کریں
کام
کام حذف کریں
انتظار میں سے منتخب کام حذف کریں
پھرتازہ
انتظار میں پھر تازہ کریں
انتظار منیجر
نام
آئی ڈی
صارف
حجم
اہمیت
بناوٹ کا وقت
عمل کاری کا وقت
کام آپ واقعی کام حذف کرنا چاہتے ہیں ؟
کام حذف مت کریں
کام حذف کرتے وقت غلطی !
انتظار میں
طباعت
ک.ب
نظامِ طباعت کا انتخاب
معلومات
تفصیل
ورژن
مالک
ہوم پیج
کچھ نہیں
اس پس منظر کو استعمال کریں اگر آپ صرف فائل طبع کرنا چاہتے ہیں.
BSD-LPR طباعت نظام معاونت برائے Xfprint
CUPS طباعت نظام معاونت برائے Xfprint
بطور طے شدہ پرنٹر متعین کریں
بطور طے شدہ CUPS پرنٹر متعین کریں
خصوصیات
پرنٹر کی خصوصیات ظاہر کریں
پاس ورڈ
صارف:
پاس ورڈ:
صارف کا نام فراہم کرنا لازمی ہے !
راسیہ طبع کریں
راسیہ:
Underlay:
وسطی عنوان:
بایاں عنوان:
دایاں عنوان:
وسطی پاساز:
بایاں پاساز:
دایاں پاساز:
انکوڈنگ:
تمام صفحات طبع کریں
صفحات اس رینج سے طبع کریں
طویل لائنیں کاٹیں
TAB, BS اور FF رموز کا ترجمہ کریں
بائنری طباعت پر زور دیں
طباعت کے لیے فائل منتخب کریں
معین کردہ فائل موجود نہیں ہے
زبان:
نشان زدہ لیول:
پٹی لیول:
ترتیبات محفوظ کریں
Xfprint
طباعت تا:
طباعت تا فائل:
شیٹیں
تخیلاتی صفحات
خوبصورت-طباعت
ماداخل
عنوانات
کاپیاں:
فلٹرکااطلاق کریں
طباعت نظام کا پس منظر نہیں یا a2ps آپ کے نظام میں نہیں پایا گیا، اس طرح آپ xfprint سے کوئی فائل طبع کرنے کے قابل نہیں ہیں !
فائل کی طباعت کرتے وقت غلطی
فائل منتخب کریں جہاں طبع کرنی ہے
کاغذحجم:
پورٹریٹ
لینڈسکیپ
کالم:
کالم پہلے بھریں
رو پہلے بھریں
رو:
کالموں کے گرد بارڈر طبع کریں
صفحات عکسی ترتیب میں طبع کریں
لائن نمبر:
لائنیں فی صفحہ:
رموز فی صفحہ:
ٹیبولیشن حجم:
ناقابلِ طبع فارمیٹ:
آپ کو طباعت نظام کے پس منظر کے انتخاب کی اجازت دیتا ہے جسے xfprint استعمال کرے گا
طباعت نظام ترتیبات
ایکسفس 4 طباعت نظام ترتیبات
پرنٹ منیجر
پرنٹر کی فہرست ظاہر کرکے آپ کو ان کے کام کی ادارت کی صلاحیت دیتی ہے
ایکسفس 4 طباعت منیجر
طباعت ڈائیلاگ
فائل کی طباعت اور اس کے خاکہ کی ترتیب کی اجازت دیتی ہے
ایکسفس 4 طباعت ڈائیلاگ
ترتیبات ڈائریکٹری "%s" نہیں بنائی جاسکتی
چینل "%s" پر "%s" کی خصوصیات تبدیل کرنے کے دوران اجازہ رکاوٹ
چینل "%s" پر خاصیت "%s" نہیں پائی گئی
چینل حذف کرنے میں ناکامی "%s": %s
نا موزوں نوعیت برائے <خاصیت>: "%s"
"%s" سے نوعیت "%s" کی قدر بیان نہیں کی جاسکتی
نوعیت صفت برائے<value> صف میں نہیں
نا موزوں نوعیت برائے <value>: "%s"
چینل "%s" نہیں پایا گیا
چینل نہیں لکھا جاسکتا "%s": %s
نوعیت "%s" کا Xfconf بیک اینڈ تلاش کرنے میں ناکامی
لازم ہے کہ خصوصیت کے نام'/' سے شروع ہوں
روٹ عنصر ('/') موزوں خصوصیت نام نہیں ہے
خصوصیت کے نام میں صرف ASCII حروف ہی ہونے چاہئیں A-Z, a-z, 0-9, '_', '-', '<' اور '>' ساتھ میں '/' بطور جداگار
خصوصیت کے نام میں دو یا اس سے زیادہ متواتر '/' نہیں ہونا چاہیے
خصوصیت کا نام '/' پر ختم نہیں ہونا چاہیے
چینل کا نام خالی نہیں ہونا چاہیے
چینل کا نام صرف ASCII حروف پر مشتمل ہونا چاہیے A-Z, a-z, 0-9, '_' اور '-'
خصوصیت کا نام صرف خالی ہوسکتا ہے یا "/" اگر تکراری ریزٹ متعین کیا گیا ہو
xfconfd ورژن کی طباعت کریں.
استعمال کے لیے ترتیبات بیک اینڈ. پہلا معینہ بیک ایند پڑھنے/لکھنے کے لیے کھلا ہوا ہے، دوسرا صرف پڑھنے کے لیے.
ایکسفس ترتیبات ڈیمن
ایکسفس ترتیبات ڈیمن
بگ رپورٹ کریں تا http://bugs.xfce.org/

اختیارات بیان کرنے میں غلطی: %s

دوسرا Xfconf ڈیمن پہلے ہی چل رہا ہے
کوئی بیک اینڈ نہیں چلایا گیا
خصوصیت '%s' تبدیل: %s

خصوصیت '%s' تبدیل

خصوصیت '%s' حذف شدہ

برآمد میتھڈ ابھی تک لاگو نہیں کیا گیا
برآمد ابھی تک لاگو نہیں کی گئی
ورژن کی معلومات
چینل برائے استفسار/تبدیلی
خصوصیت برائے استفسار/تبدیلی
خصوصیت پر مرتب کرنے کے لیے نئی قدر
فہرست خصوصیات (یا چینل اگر -c متعین نہیں ہے)
پریشان کن ماحاصل
اگر پہلے سے موجود نہیں تو نئی خصوصیت بنائیں
خصوصیت کی قدر نوعیت متعین کریں
خصوصیت صاف کریں
تکراری (-r کے ساتھ استعمال)
صف پر زور دیں چاہے ایک ہی عنصر ہو
خصوصیت کی تبدیلی کے لیے چینل مانیٹر کریں
چینل '%s' کی مانیٹرنگ شروع کریں:
خصوصیت "%s" چینل "%s" پر موجود نہیں.

(نامعلوم)
قدر %d عناصر کے ساتھ ترتیب میں ہے:


چینل "%s" پر خصوصیت "%s" موجود نہیں. اگر نئی
خصوصیت بنانا لازمی ہو تو --create اختیار استعمال کریں.

نئی خصوصیت بناتے ہوئے قدر کی نوعیت متعین کرنا لازمی ہے.

قدر کی سابقہ نوعیت حاصل کرنے میں ناکامی.

قدر کی نوعیت کا فیصلہ کرنے میں ناکامی.

قدر کی نوعیت متعین کرنا لازمی ہے تاکہ کسی صف کو ایک مفرد قدر میں بدلا جاسکے.

"%s" کو نوعیت "%s" میں بدلنے میں ناکامی

خصوصیت سیٹ کرنے میں غلطی.

یہاں %d نئی قدریں ہیں، مگر صرف %d نوعیت بیان ہوسکتی ہے.

فہرست %d پر قدر کی نوعیت کا فیصلہ کرنے میں ناکامی.

چینل '%s' میں کوئی خصوصیات نہیں

برآمد فائل نہیں بنائی جاسکتی "%s": %s

درآمد فائل نہیں کھولی جاسکتی "%s": %s

درآمد فائل بیان نہیں کی جاسکتی "%s": %s

بابت
بند کریں
Ctrl+PageUp
سابقہ ٹیب پر منتقل ہوں
Ctrl+PageDn
اگلے ٹیب پر منتقل ہوں
منتخب کردہ صفحہ پر منتقل ہوں
اختیارات کا دریچہ دکھائیں
بابت کا دریچہ دکھائیں
PageUp/PageDn
اختیارات اور بابت ٹیب میں صفحہ کو بدلیں
برخاست
خلاء
حالیہ تاریخ منتخب کریں
Ctrl+Space
ذاتی ڈیٹا روئیت معکوس کریں
تیر
دن تبدیل کریں
Ctrl+Up/Down
دن کے معلوماتی پینل کے مواد کو سکرول کریں
ماہ تبدیل کریں
گھر/آخر
سال تبدیل کریں
گزشتہ اور آئندہ ماہ کی تقویم کو ظاہر یا غائب کریں
دن نوٹس براؤزر
دن نوٹ کو پس منظر رنگ دیں
تاریخ شمار کنندہ
پورے سال کی تقویم دکھائیں
تاریخ پر جائیں
حذف
دن کا نوٹ حذف کریں
Alt+Arrows
Esc
مدون بند کریں
چوڑائی معکوس کریں
ٹیڑھا معکوس کریں
خط کشیدہ معکوس کریں
خط مقطوع منعکس کریں
نشان زدگی معکوس کریں
تیر اوپر/نیچے
متبادل منظر معکوس کریں
سال کی معلومات
حالیہ سال مرتب کریں
پورے سال کی تقویم بند کریں
Alt+a, Insert
مہم شامل کریں
Alt+e, Ctrl+Enter
مہم مدون کریں
Alt+r, Delete
مہم حذف کریں
پوشیدہ مہمیں معکوس کریں
تلاش کے حلقے فعال کریں
بائیں، دائیں
زمرہ فلٹر تبدیل کریں
مہم کا معلوماتی پینل بند کریں
داخل کریں
رابطہ شامل کریں
Ctrl+Enter
رابطہ مدون کریں
رابطہ حذف کریں
تلاش کا انداز تبدیل کریں
رابطے کی تفصیلات کا پینل بند کریں
انٹر
نوٹ کھولیں
نوٹ شامل کریں
نوٹ حذف کریں
نوٹ کا نام اور زمرہ مدون کریں
نوٹ مدون بند کریں
نوٹ محفوظ کریں
متن تلاش کریں
انتخاب کے خواص صاف کریں
اوسمو صارف کی سہولت کو مدِ نظر رکھ کر تیار کیا گیا ہے، چنانچہ اس کے بہت سارے کلیدی اختصارات (شارٹ کٹ) ہیں. ذیل میں ان اختصارات کی پوری فہرست ہے:
عام
تقویم
نوٹ مدون
پورے سال کی تقویم
مہم
رابطے
نوٹس
منتخب کار
مدون
آسان ذاتی منظم
تالیف کیا گیا
پروگرامنگ
ترسیمیات
معاونین
مترجمین
میلنگ لسٹ
بگ ٹریکر
خوبیوں کی درخواستیں
دستیاب ماڈیول
تالیفی خوبیاں
آئی کیلینڈر معاونت
رمز شدہ نوٹس معاونت
SyncML فعال کردہ آلہ معاونت
بیک اپ معاونت
طباعت کی معاونت
املاء کی پڑتال کی معاونت
نسخہ
SVN نظرِ ثانی
کلید اختصار
اجازہ
بیک اپ محفوظ کریں
پاس ورڈ تحفظ
پاس ورڈ داخل کریں
پاس ورڈ دوبارہ داخل کریں
براہ مہربانی پاس ورڈ داخل کریں
پاس ورڈ مطابقت نہیں رکھتا!
بیک اپ نہیں بنایا جاسکتا!
بیک اپ کی فائل کامیابی سے محفوظ کردی گئی!
بیک اپ فائل کھولیں
اوسمو بیک اپ فائلیں (*.bck)
یہ اوسمو بیک اپ فائل نہیں ہے
غلط پاس ورڈ!
آپ کا تمام ڈیٹا بیک اپ فائل کے مواد سے بدل دیا جائے گا.
کیا آپ پُریقین ہیں؟
اوسمو کو پھر سے چلانے کی ضرورت ہے...
تاریخ پیدائش

حالیہ وقت
دن کا عدد
آج کا فاصلہ
ہفتے کا عدد
نشان زد دن
آخر ہفتہ کے دن
دن کا زمرہ
چاند کا دورانیہ
علاقہ بروج کی علامت

سال کا آخری دن
دن کے نوٹس
دن کی مہم
سالگرہ
منتخب کردہ دن کا نوٹ حذف کردیا جائے گا.
جاری رہیں؟
سابقہ سال
سابقہ ماہ
سابقہ دن
آج
اگلا دن
اگلا ماہ
اگلا سال
تاریخ پر جائیں
تقویم طبع کریں
تاریخ شُمار کُنندہ
ترجیحات
برخاست
دن نوٹ پینل معکوس کریں
مہم شامل کریں
دن کا رنگ منتخب کریں
نوٹس دیکھیں
iCal واقعات دیکھیں
iCal فائل میں برآمد کریں
سابقہ اور اگلا ماہ
نوٹ پینل بند کریں
نشان زدہ
خط مقطوع
خد کشیدہ
ٹیڑھا
چوڑا
ٹائم لائن شامل کریں
متن صاف کریں
معلومات
رنگ منتخب کریں
کچھ نہیں






یا
راؤنڈ کردیے گئے


وقت نظر انداز کردیا گیا

یہ شُمار کُنندہ صرف 1 سال بعد کی تاریخوں کی معاونت رکھتا ہے.

سال
مہینہ
دن
حالیہ تاریخ
حالیہ تاریخ مرتب کریں
گھنٹہ
منٹ
سیکنڈ
حالیہ وقت مرتب کریں
وقت صاف کریں
پہلی تاریخ اور وقت
دوسری تاریخ اور وقت
متبادل وقت کی اکائیاں
نتیجہ
دو تاریخوں کے درمیان مدت
عمل
شامل کریں
تفریق
تاریخ اور وقت کی شمولیت یا اس سے حصول
سال
مہینے
دن
ہفتے
گھنٹے
منٹ
سیکنڈ
آخرِ ہفتہ کے دنوں کو نظر انداز کریں
حلقے صاف کریں
وقت برائے اضافہ یا حصول
منتقلی تا
تاریخ میں شامل یا حاصل کریں
لیپ کا سال
ہاں
نہیں
چینی سال جانور
دنوں کی تعداد
ہفتوں کی تعداد
آخرِ ہفتہ کے دنوں کی تعداد
سال کی تفصیلات
حالیہ سال
متبادل منظر

کوئی موزوں تقویم متعین نہیں ہے
آئی کیلینڈر واقعات
تاریخ
وقت
خلاصہ
ماحاصل فائل منتخب کریں
فہرست صاف کردی جائے گی اور تمام اندراجات ضائع ہوجائیں گے.
ہوگیا!

آئی کلینڈر برآمد
دن منتخب کار
تاریخ کی مدت استعمال کریں
شامل کریں
صاف
حذف
ماحاصل فائل نام
انتخاب
ملتوی
برآمد
کوئی اندارجات نہیں

تقویم نوٹس
تلاش
فلٹر
حالیہ ماہ
منتخب کردہ ماہ
منتخب کردہ سال
ماہ اور سال منتخب کریں
تمام نوٹس
حساس
گزشتہ دن اور نوٹس خط مقطوع کریں
نوٹ
نحو
مختصر ہفتے کے دن کا نام
مکمل ہفتے کے دن کا نام
مختصر ماہ کا نام
ماہ کا پورا نام
ماہ کا دن
MM/DD/YY
مہینے کا دن ابتدائی صفروں کے بغیر
سال بغیر صدی
سال بمع صدی
تاریخ سرساز ہیئت
طے شدہ ہیئت مرتب کریں
تاریخ ہیئت ساخت
دن نوٹ مارکر
واقعہ مارکر
دائری
بیضوی
لہر
حالیہ دن مارکر
تیر
آزاد-دستی حلقہ
رنگ
سرساز کا رنگ
آخرِ ہفتہ کے دنوں کا رنگ
کرسر کا رنگ
واقعات مارکر رنگ
حالیہ دن مارکر رنگ
سالگرہ مارکر رنگ
تاریخ فونٹ
تقویم فونٹ
نوٹ کا فونٹ
بلاک کرسر فعال کریں
کرسر کی کثافت
پتلا
گھنا
زمرہ مدون کریں
رنگ
نام
ٹھیک ہے
ICS فائل منتخب کریں
تمام فائلیں
تقویم فائلیں (*.ics)
ICAL پیرامیٹر تبدیل کریں
فائل کا نام
اختیارات
معطل
موزوں
تفصیل
پوری تاریخ
نشان
ہفتہ پیر کو شروع ہو
دنوں کے نام دکھائیں
کوئی ماہ کی تبدیلی نہیں
ہفتے کے اعداد ظاہر کریں
مکمل-سال تقویم میں سادہ منظر
اضافی تقویمیں فعال کریں
دن نوٹس براؤزر میں صعودی ترتیب
دن کے نوٹس میں املاء کی پڑتال فعال کریں
مواجہ
دن زمرہ جات
آئی کلینڈر فائلیں
دن کے معلوماتی پینل میں دکھائیں
دن نام
طباعت کی غلطی
طباعت خصوصیات
ماہ نام
دن کا نام
واقعات
فونٹ
سالگرہیں
دنوں کے نام
مرئی واقعات
پیڈنگ
واقعہ کا زیادہ سے زادہ طول
صفحہ کی رُخ بندی
پورٹریٹ
لینڈسکیپ
خطِ وقت
از (گھنٹہ)
مرحلہ (منٹ)
تا (گھنٹہ)
بلا تاریخ
چوہا
بیل
شیر
خرگوش
اژدہا
سانپ
گھوڑا
بھیڑ
بندر
پرندہ
کُتا
خنزیر
نامعلوم
برج دلو
برج حوت
برج حمل
برج ثور
برج جوزا
برج سرطان
برج اسد
برج عذراء
برج میزان
برج عقرب
برج قوس
برج جدی
منتخب کردہ عمل ادا نہیں کیا جاسکتا.
مہم تبدیل یا حذف کردی گئی.
بعد میں یاد دلائیں
تکمیل شدہ
مؤخر کردہ
مہم دکھائیں
الارم انتباہ!
دن نوٹ
نوعیت
واقعہ
مہم
اوسمو کو ظاہر کریں
کوئی سالگرہ متعین نہیں
سالگرہیں فہرست
سالگرہ میں دن
عمر
سالگرہ تاریخ
آج
براہ مہربانی پتہ منتخب کریں
معلومات
کام
گھر
گروپ
پہلا نام
آخری نام
دوسرا نام
عرفیت
ٹیگ
نام دن تاریخ
گھر کا پتہ
گھر کا پوسٹ کوڈ
شہر
صوبہ
ملک
ادارہ
محکمہ
کام کا پتہ
کام کا پوسٹ کوڈ
کام کا شہر
کام کا صوبہ
کام کا ملک
فیکس
گھر کا فون
گھر کا فون 2
گھر کا فون 3
گھر کا فون 4
کام کا فون
کام کا فون 2
کام کا فون 3
کام کا فون 4
سیل فون
سیل فون 2
سیل فون 3
سیل فون 4
برقی پتہ
برقی پتہ 2
برقی پتہ 3
برقی پتہ 4
ویب سائٹ
ویب سائٹ 2
ویب سائٹ 3
ویب سائٹ 4
گاڈو-گادو پیغام رساں
یاہو پیغام رساں
ایم ایس این پیغام رساں
آئی سی کیو پیغام رساں
اے او ایل پیغام رساں
جبر پیغام رساں
سکائپی پیغام رساں
ٹلن پیغام رساں
بلاگ
تصویر
اضافی معلومات
نیا رابطہ
رابطہ حذف کریں
رابطہ مدون کریں
سالگرہیں دکھائیں
نقشے پر رابطہ کا مقام ظاہر کریں
رابطے درآمد کریں
رابطے برآمد کریں
پہلا نام
آخری نام
تمام حلقے
رابطے کی تفصیلات
رابطے کا پینل بند کریں

فائل نہیں بنائی جاسکتی.
ماحاصل ہیئت
سرساز شامل کریں
حلقے برائے برآمد
تمام
پلٹیں
حلقے منتخب کریں
CSV فائل منتخب کریں
CSV (کوما-مقسم قدر) فائلیں (*.csv)
براہ مہربانی پہلے فائل منتخب کریں.
درآمد نوعیت
فائل
ماداخل فائل نام
پتہ
چینل
مواجہ
بائنری XML (WBXML) استعمال کریں
درآمد
درآمد کرنے کے لیے کچھ نہیں ہے.

برائے
ریکارڈ
فی اندراج حلقوں کی تعداد
ہیڈر کے طور پر پہلا ریکارڈ استعمال کریں
حلقہ نوعیت
قدر
منتخب کردہ فائل میں کوئی ریکارڈ نہیں پایا گیا.
فائل نہیں پڑھی جاسکتی.
فائل نہیں کھولی جاسکتی.
منتخب کردہ رابطہ حذف کردیا جائے گا.
تصویر منتخب کریں
پوسٹ کوڈ
شہر
حالت
مُلک
رابطہ شامل کریں
ذاتی
فون
انٹرنیٹ
رابطے کے ٹیگ کا رنگ
روابط کے رنگ
فونٹ حجم
فونٹ حجم نام
عنصر کا فونٹ حجم
تصویر کا حجم
چھوٹا
درمیانہ
بڑا
تلاش کے بعد پہلا عنصر منتخب کریں اور دکھائیں
گروپ کالم چھپائیں
ترتیب
انداز
صعودی
نزولی
متفرق
گروپ
ترتیب
سالگرہ براؤزر میں مرئی کالم
تقویم دکھائیں
مہم دکھائیں
رابطے دکھائیں
نوٹس دکھائیں
اختیارات دکھائیں
چوٹی تقویم دریچہ دکھائیں
آخری بار چلانے سے واقعات چیک کریں
آئندہ واقعات کو چیک کرنے کے لیے دنوں کی تعداد (طے شدہ: 0)
ترتیبات اور ڈیٹا فائلوں کے لیے مطلق پاتھ مرتب کریں
اوسمو کا مواجہ کم ریزلوشن پر استعمال کے لیے تبدیل کریں
آسان ذاتی منظم
غلطی: کانفگ (config) فائل نہیں بنائی جاسکتی
اوسمو کا دوسرا نسخہ پہلے ہی چل رہا ہے.
ایک ہی وقت میں اوسمو کے دو نسخوں کے استعمال سے ڈیٹا کا نقصان ہوسکتا ہے.
کیا آپ واقعی آگے بڑھنا چاہتے ہیں؟
انتباہ
نوٹ تبدیل کردیا گیا.
کیا آپ اسے محفوظ کرنا چاہتے ہیں؟
الفاظ
لکیریں
کیریکٹرز
سفید کیریکٹرز
بائٹس
دستاویز
انتخاب
بنایا گیا
تبدیل شدہ
نیا نوٹ
نوٹ شامل کریں
نوٹ مدون کریں
نوٹ حذف کریں
نوٹ صاف کریں
تلاش
اوصاف صاف کریں
نوٹ محفوظ کریں
حالیہ تاریخ اور وقت شامل کریں
جداگار شامل کریں
شُماریات
مدون بند کریں
املاء کی پڑتال معکوس کریں
زمرہ
نوٹ کا نام
آخری تبدیلیاں
فقط-برائے-پڑھائی
لکیر
کالم
حساس
اندراج تلاش بند کریں
اندراج مدون کریں
کرسر کی جگہ یاد رکھیں
منتخب کردہ نوٹ حذف کردیا جائے گا.
مزید ڈیٹا کی بازیافتگی ممکن نہیں ہوگی.
سادہ
رمز شدہ
نوٹ کی نوعیت
نوٹ نہیں کھولا جاسکتا.
رمز نگاری کی معاونت معطل ہے
منظوری
الگورتھم
ہیشنگ
دباؤ
قدر
تیز
اچھا
بہترین
آخری منتخب کردہ زمرے کو یاد رکھیں
تاریخ اور وقت کے لیے نظام کی ہیئت استعمال کریں
رمز نگاری
مرئی کالم
زمرے
نوٹس اختیارات
تبدیلیوں کی اثر پذیری کے لیے اوسمو کو دوبارہ چلانا ہوگا.
خاکہ
عمودی
افقی
ٹیبز کا مقام
بائیں
دائیں
اوپر
نیچے
روابط میں خط کشیدگی معطل کریں
قطاریں متبادل رنگوں میں بنائیں
کم سے کم ایک ماڈیول ظاہر ہونا چاہیے.
لوکل ترتیاب پر فائق ہوں
تاریخ ہیئت
DD-MM-YYYY
MM-DD-YYYY
YYYY-MM-DD
YYYY-DD-MM
وقت کی ہیئت
گھنٹے
املاء پڑتال زبان
ٹول ٹِپ فعال کریں
آخری منتخب کردہ صفحہ یاد رکھیں
ہر تبدیلی پر تاریخ محفوظ کریں
ویب براؤزر
ای میل موکل
موسیقی سازندہ
%s نمونہ ویب پتہ سے بدل دیا جائے گا
%s نمونہ ای میل پتہ سے بدل دیا جائے گا
%s نمونہ صوتی فائل نام سے بدل دیا جائے گا
بنائیں
بحال کریں
نظام ٹرے فعال کریں
منمائز شروع کریں
واقعات پر بلنک کریں
دن نوٹ واقعات نظر انداز کریں
چھپائیں
معاون
بیک اپ
نظام ٹرے
تدوین
نیچے جائیں
تاریخ منتخب کریں
فونٹ منتخب کریں
شُمار کُنندہ
دن کا نوٹ مدون کریں
رابطے کا نقشہ پر مقام
محفوظ کریں
مکمل-سال تقویم ظاہر کریں
ہدایات
غیر موزوں عنصر
موزوں عنصر
مہم مدون کریں
مہم حذف کریں
مہم درآمد کریں
مہم برآمد کریں
سابقہ تاریخ پر بدل دیں
اگلی تاریخ پر بدل دیں
طباعت
سادہ
باز گرد
شروع کردہ
تکمیل یافتہ
تمام عناصر
نئی مہم
باقی تاریخ کو سابقہ تاریخ پر تبدیل کریں
باقی تاریخ کو اگلی تاریخ پر تبدیل کریں
مرئی مہم کی فہرست طبع کریں
باقی تاریخ
اہمیت
مہم تفصیلات
تفصیلات پینل بند کریں
متعین کردہ تاریخ میں کوئی مہمیں نہیں پائی گئیں.
مہم محفوظ کریں
مہمیں برآمد کردی گئیں
براہ مہربانی کم سے کم ایک دن منتخب کریں جب ری کرنسی فعال ہو.
وقت متعین کریں
کل
منتخب کردہ مہم حذف کردی جائے گی.
بنیادی
تاریخ اور وقت منتخب کریں
پست
بالا
صوتی اطلاع فعال کریں
اعلی
الارم انتباہ
موخر کرنے کا وقت
الارم کمانڈ
باز گرد مہم
فعال کریں
ابتداء
آخر
وقفہ
وقت مدت
تاریخ مدت
دہرائیں
مندرجہ ذیل دنوں میں دہرائیں
جب مہم آف لائن اختتام پذیر ہو الارم نظر انداز کریں
فونٹ منتخب کریں...
ان عناصر کا رنگ جو آج کے لیے باقی ہیں
ان عناصر کا رنگ جو اگلے 7 دنوں تک باقی ہیں
ان عناصر کا رنگ جن کا وقت گزر گیا
مہم معلومات فونٹ
چوڑی مہموں میں زیادہ اہمیت کے ساتھ دکھائیں
تکمیل شدہ مہم چھپائیں
تکمیل شدہ مہمیں بغیر تصدیق کے حذف کردیں
مہم فہرست میں دہرے کلک پر نئی مہم شامل کریں
منٹ
0 برائے معطلی
الارم کی آواز دہرائیں
اوقات
عالمگیر اطلاعی کمانڈ
مہم کے اختیارات
یاد دہانی اختیارات
مہم فہرست
نہیں.
نیا چاند
بڑھتا ہلال چاند
چوتھائی چاند
بڑھتا ابھرا چاند
مکمل چاند
ماند ابھرا چاند
آخری چوتھائی چاند
ماند ہلال چاند
سوال
غلطی
منتخب کردہ فائل پہلے ہی موجود ہے! کیا اس کے اوپر لکھ دیا جائے؟
فولڈر کا مواد پڑھنے میں ناکامی
نا معلوم غلطی
کوئی Exec فیلڈ متعین نہیں کی گئی
کوئی URL فیلڈ متعین نہیں کی گئی
ناموزوں ڈیسک ٹاپ فائل
فائل کے حرفی تجزیہ میں ناکامی
فائل کا نام غلط ہے
شاید صرف لوکل فائلوں کا نام بدلا جاسکتا ہے
تیاری...
"%s" کا پرمیشن بدلنے میں ناکامی
"%s" کا فائل مالک بدلنے میں ناکامی
"%s" کا فائل گروپ بدلنے میں ناکامی
فائل "%s" پہلے سے موجود ہے
خالی فائل "%s" بنانے میں ناکامی
پڑھنے کے لیے "%s" کو کھولنے میں ناکامی
لکھنے کے لیے "%s" کو کھولنے میں ناکامی
"%s" میں مواد لکھنے میں ناکامی
"%s" کو حذف کرنے میں ناکامی
"%s" سے مواد پڑھنے میں ناکامی
کاپی برائے %s
ربط تا %s
دوسری کاپی برائے %s
دوسرا ربط برائے %s
تیسری کاپی برائے %s
تیسرا ربط برائے %s


"%s" کے لیے فائل کی معلومات حاصل کرنے میں ناکامی
ڈائریکٹری "%s" بنانے میں ناکامی
fifo مسمی بنانے میں ناکامی "%s"
رمزی ربط بنانے میں ناکامی "%s"
منتخب کردہ فائلیں کاپی نہیں ہوسکتیں
رمزی روابط کی معاونت نہیں ہے
فائل سسٹم
"%s" کو "%s" کاپی کرنے میں ناکامی
"%s" کو "%s" سے مربوط کرنے میں ناکامی
"%s" کو "%s" تک منتقل کرنے میں ناکامی
لگتا نہیں ہے کہ URI "%s" ردی میں کار آمد مصدر ہے
ردی
ردی کے اندر فائلیں منتقل یا کاپی نہیں کی جاسکتیں
فائل "%s" پہلے ہی موجود ہے، کیا آپ اسے بدلنا چاہتے ہیں؟

اگر آپ اسے بدلیں گے تو پہلی فائل کا مواد نئی فائل سے بدل دیاجائے گا.
کیا آپ اس کے اوپر لکھنا چاہتے ہیں؟
کیا آپ اسے نظر انداز کرنا چاہتے ہیں؟
اطلاقیے کو فائل %s سے لوڈ کرنے میں ناکامی
حذف کرنے میں ناکامی "%s": %s
کمانڈ
mime handler کو چلانے کے لیے کمانڈ
جھنڈیاں
جھنڈیاں برائے mime handler
آئکن
mime handler کی آئکن
نام
mime handler کا نام
%s دستاویز
URI برائے "%s" غلط ہے
پاتھ بہت طویل ہے کہ بفر میں فٹ ہوسکے
ربط بہت طویل ہے کہ بفر میں فٹ ہوسکے
عمل کی معاونت نہیں ہے
غلط escaped رموز
حجم
مطلوبہ تھمبنیل حجم
فائلیں جمع کی جارہی ہیں...
ناموزوں پاتھ
نا معلوم صارف "%s"
%s کا ماؤنٹ پوائنٹ حاصل کرنے میں ناکامی
رابطہ HAL daemon سے نہیں ہوسکا: %s
بلک ری نیم ڈائیلاگ کھولیں
daemon انداز میں چلائیں
daemon انداز میں چلانا (معاونت نہیں ہے)
چلتے ہوئے تھنر کو بند کریں
چلتے ہوئے تھنر کو بند کریں (معاونت نہیں ہے)
ورژن کی معلومات طبع کرکے بند کردیں
تھنر
[FILES...]
تھنر: ڈسپلے کھولنے میں ناکامی: %s

تھنر: %s

تھنر ترقیاتی ٹیم. تمام حقوق محفوظ ہیں.
Benedikt Meurer نے لکھا <benny@xfce.org>.
برائے مہربانی بگ رپورٹ کریں تا <%s>.
عناصر کو ترتیب دیں
_نام سے ترتیب دیں
عناصر کو نام کے لحاظ سے ترتیب دیں
_حجم سے ترتیب دیں
عناصر کو ان کے حجم کے لحاظ سے ترتیب دیں
_قسم سے ترتیب دیں
عناصر کو ان کی قسم کے لحاظ سے ترتیب دیں
_تبدیلی کی تاریخ سے ترتیب دیں
عناصر کو تاریخِ تبدیلی کے لحاظ سے ترتیب دیں
ترتیبِ صعودی
عناصر کو صعودی ترتیب دیں
ترتیبِ نزولی
عناصر کو نزولی ترتیب دیں
عمل چلانے میں ناکامی
"%s" کو چلانے میں ناکامی
کھولنے میں ناکامی "%s"
"%s": %s کو کھولنے میں ناکامی
فائلیں کاپی کی جارہی ہیں...
رمزی روابط بنائیں...
فائلوں کو ردی میں منتقل کیا جارہا ہے...
فائلیں منتقل کی جارہی ہیں...
کیا آپ واقعی "%s" کو ہمیشہ
کے لیے حذف کرنا چاہتے ہیں؟

اگر آپ نے فائل حذف کی تو یہ ہمیشہ کے لیے ختم ہوجائے گی.
فائلیں حذف کی جارہی ہیں...
فائلیں بنائی جارہی ہیں...
ڈائریکٹریاں بنائی جارہی ہیں...
ردی سے تمام فائلیں اور فولڈر حذف کریں؟
_ردی خالی کریں
ردی خالی کرنے پر اس میں موجود تمام عناصر ہمیشہ کے لیے ضائع ہوجائیں گے. یاد رہے کہ آپ انہیں ایک ایک کرکے بھی حذف کرسکتے ہیں.
ردی خالی کی جارہی ہے...
"%s" کے اصل پاتھ کے تعین میں ناکامی
کیا آپ "%s" فولڈر بنانا چاہتے ہیں؟
_فولڈر بنائیں
فولڈر "%s" موجود نہیں ہے، مگر فائل "%s" کو ردی سے ری سٹور کرنے کی ضرورت ہے. کیا آپ دوبارہ فولڈر بنانا چاہتے ہیں؟
"%s" کو ری سٹور کرنے میں ناکامی
فائلیں بحال کی جارہی ہیں...
"%s" کے لیے طے شدہ اطلاقیہ سیٹ کرنے میں ناکامی
کوئی اطلاقیہ منتخب نہیں
منتخب اطلاقیہ یہ اور "%s" قسم کی دوسری فائلوں کو کھولنے کے کام آتا ہے.
_دیگر اطلاقیے
کھولیں بذریعہ
م_خصوص کمانڈ استعمال کریں:
اوپر کی فہرست میں غیر دستیاب اطلاقیوں کے لیے کمانڈ مختص کریں.
_انتخاب
اس قسم ک_ی فائلوں کے لیے طے شدہ
نیا اطلاقیہ شامل کرنے میں ناکامی "%s"
_لاؤنچر حذف کریں
<i>%s</i> کو اور "%s" قسم کی دوسری فائلوں کو کھولیں بذریعہ:
"%s" قسم کی فائلوں کو کھولنے کے لیے فائل سسٹم میں اطلاقیہ تلاش کریں.
"%s" قسم کی فائلوں کا طے شدہ اطلاقیہ منتخب کردہ اطلاقیہ سے تبدیل کریں.
کیا آپ واقعی "%s" کو حذف کرنا چاہتے ہیں؟
یہ فائل کے کونٹیکسٹ مینیو میں ظاہر ہونے والے اطلاقیہ لاؤنچر کو حذف کرے گا، مگر اطلاقیہ کو ان انسٹال نہیں کرے گا

آپ صرف اطلاقیہ لاؤنچر کو جو صوابدیدی کمانڈ بکس کے ذریعے بنائے گئے تھے فائل منیجر کے "کھولیں بذریعہ" ڈائیلاگ سے حذف کرسکتے ہیں.
اطلاقیہ منتخب کریں
تمام فائلیں
اطلاقی فائلیں
پرل سکرپٹ
پائتھن سکرپٹ
روبی سکرپٹ
شیل سکرپٹ
دستیاب نہیں
مجوزہ اطلاقیے
دوسرے اطلاقیے
پیسٹ کرنے کے لیے کلپ بورڈ میں کچھ نہیں ہے
تفصیلی فہرست منظر میں کالم مرتب کریں
مخفی کالم
تفصیلی فہرست منظر میں معلومات کی ترتیبِ
ظہور کو مرتب کریں.
_اوپر کریں
__نیچے کریں
_ظاہر کریں
چھ_پائیں
طے شدہ استعمال کریں
کالم سائزنگ
بہ ضرورت طے شدہ طور پر متن کے بہتر منظر کے لیے کالم
خود کار طور پر پھیلا دیے جاتے ہیں اگر آپ ذیل میں اس عمل
کو معطل کردیں گے تو فائل منیجر ہمیشہ آپ کی متعین کردہ
کالم کی چوڑائی استعمال کرے گا.
کالم خود کار پ_ھیلائیں
نا معلوم
مختصر ڈائریکٹری فہرست کاری
مختصر منظر
_بنائیں
نیا نام لکھیں:
فائل کے نام "%s" کو لوکل انکوڈنگ سے نہیں بدلا جاسکتا
غلط فائل نام "%s"
کام کی ڈائریکٹری کو براہ راست پاتھ پر ہونا چاہیے
کم سے کم ایک فائل کا نام متعین ہونا چاہیے
کال_م مرتب کریں...
تفصیلی فہرست منظر میں کالم مرتب کریں
تفصیلی ڈائریکٹری فہرست کاری
تفصیلی منظر
تبدیلیء نام "%s"
نام _بدلیں
"%s" کا نام بدلنے میں ناکامی
محمد علی مکی
makki.ma@gmail.com
اردو کوڈر لینکس فورم
http://www.urducoder.com
مکی کا بلاگ
http://makki.urducoder.com
دستاویزات براؤزر کھولنے میں ناکامی
_ہاں
_سب ہاں
_نہیں
س_ب نہیں
_پھر کوشش
_مسترد
فائلوں کی تبدیلی کی تصدیق
ن_ظر انداز
_سب تبدیل
_تبدیل
فولڈر میں پہلے ہی "%s" فائل ہے.
کیا آپ موجود فائل کو
حجم:
تبدیل شدہ:
مندرجہ ذیل فائل سے بدلنا چاہتے ہیں؟
یہی_ں کاپی کریں
یہ_یں منتقل کریں
-یہاں ربط بنائیں
فائل "%s" کو چلانے میں ناکامی
صرف نام
صرف سفیکس
نام اور سفیکس
تاریخ رسائی
تاریخ تبدیلی
گروپ
MIME قسم
مالک
اجازتیں
نوعیت
فائل
فائل کا نام
روٹ فولڈر کا کوئی ذیل نہیں ہے
پیچھے
سابقہ دیکھے گئے فولڈ میں جائیں
آگے
اگلے دیکھے گئے فولڈر میں جائیں
فال بیک آئکن کو "%s" (%s) سے لوڈ کرنے میں ناکامی. اپنی تنصیب چیک کریں!
آئکن بیسڈ ڈائریکٹری فہرست کاری
آئکن منظر
ک_ھولیں
نئی ونڈو میں کھولیں
منتخب ڈائریکٹری کو نئی ونڈو میں کھولیں
دو_سرے اطلاقیے سے کھولیں...
منتخب فائل کو کھولنے کے لیے دوسرا اطلاقیہ منتخب کریں
فائل "%s" کھولنے میں ناکامی

کیا آپ واقعی تمام فولڈر کھولنا چاہتے ہیں؟




_نئی ونڈو میں کھولیں

ا_طلاق

ک_ھولیں بذریعہ "%s"

دو_سرے اطلاقیے سے کھولیں...
_طے شدہ اطلاقیہ سے کھولیں

کھولیں بذریعہ "%s"
"%s" کو ماؤنٹ کرنے میں ناکامی



ٹوٹا ربط



"%s" ٹوٹا ربط
"%s" (%s) ربط تا %s
"%s" (%s) %s
اصل پاتھ:
تصویر کا حجم:


_فولڈر بنائیں...
ردی میں موجود تمام فائلیں اور فولڈر حذف کریں
فولڈر کے اندر پیسٹ کریں
_خصوصیات
خلا
پاتھ بٹنوں کے درمیان خلا کی مقدار
"%s" کو اسی ونڈو میں کھولیں
"%s" کو نئی ونڈو میں کھولیں
"%s" میں نیا فولڈر بنائیں
سابقہ کٹ یا کاپی کمانڈ سے منتخب کردہ فائلوں کو "%s" میں کاپی یا منتقل کریں
فولڈر "%s" کی خصوصیات دیکھیں
نیا فولڈر
نیا فولڈر بنائیں
مقام کھولیں
م_قام:
"%s" کو چلانے میں ناکامی
آئکن کا حجم
پاتھ انٹری کے لیے آکن کا حجم
کچھ نہیں
صرف لکھنے کے لیے
صرف پڑھنے کے لیے
پڑھنے اور لکھنے کے لیے
مالک:
رسائی:
گروپ:
دوسرے:
پروگرام:
اس فائل کو بطور پروگرام _چلائیں
غیر مصدقہ پروگراموں کو چلانے کی اجازت دیتا ہے
مگر آپ کے کمپیوٹر کی حفاظت کے لیے خطرہ ہے
فولڈر کے اجازوں میں تضاد ہے، آپ شاید اس فولڈر
میں فائلوں کے ساتھ کام نہیں کرسکیں گے.
فولڈر اجازے کی تصحیح
فولڈر کے اجازے خود کار فکس کرنے کے لیے یہاں کلک کریں.
انتظار فرمائیں...
تکراری اجازوں کا اطلاق روکیں.
سوال
تکراری اطلاق؟
کیا آپ ذیل میں منتخب کردہ فولڈر کی تمام فائلوں اور ذیلی
فولڈروں میں اپنی تبدیلیوں کا تکراری اطلاق کرنا چاہتے ہیں؟
_دوبارہ مت پوچھیں
اگر آپ نے یہ آپشن منتخب کیا تو آپ کا یہ انتخاب یاد رکھا جائے گا اور آپ سے دوبارہ نہیں پوچھا جائے گا، آپ بعد میں اسے ترجیحات کے ڈائیلاگ سے بدل سکتے ہیں.
گروپ بدلنے میں ناکامی
نئے اجازے کے اطلاق میں ناکامی
نا معلوم فائل مالک
فوڈر اجازوں کی خود کار تصحیح کریں؟
درست فولڈر اجازہ
فولڈر کے اجازے اپنی ثابت حالت میں واپس کردیے جائیں گے، صرف وہ صارفیں جنہیں اس فولڈر کا مواد پڑھنے کی اجازت ہوگی وہی اس فولڈر میں داخل ہوسکیں گے.
فائل منیجر کی ترجیحات
منظر
طے شدہ منظر
ن_یا فولڈر دکھائیں بذریعہ:
آئکن منظر
تفصیلی فہرست منظر
مختصر فہرست منظر
آخری فعال منظر
فولڈروں کی فائلوں سے پہلے ترتیب
فولڈر مرتب کرنے پر فولڈروں کو فائلوں سے پہلے ترتیب دینے کے لیے یہ آپشن منتخب کریں
ت_ھمبنیل دکھائیں
فولڈروں کے اندر فائلوں کے فوری معائنے کے لیے یہ آپشن منتخب کریں
مت_ن آئکن کے ساتھ
فائلوں کے نام ان کی آئکن کے نیچے کی بجائے ایک طرف دکھانے کے لیے یہ آپشن منتخب کریں.
تاریخ
ف_ارمیٹ:
بغلی پٹی
شارٹ کٹ پٹی
_آئکن حجم:
انتہائی چھوٹا
بہت چھوٹا
چھوٹا
سادہ
بڑا
بہت بڑا
انتہائی بڑا
آئکن کی ع_لامتیں دکھائیں
فولڈروں کی آئکن پر علامتیں ظاہر کرنے کے لیے یہ آپشن منتخب کریں، یہ علامتیں کسی بھی فولڈر کے خصوصیات ڈائیلاگ میں متعین کی جاسکتی ہیں.
شجری لوح
_آئکن حجم:
آئکن کی علامتیں دکھائیں
فولڈروں کی آئکن پر علامتیں ظاہر کرنے کے لیے یہ آپشن منتخب کریں، یہ علامتیں کسی بھی فولڈر کے خصوصیات ڈائیلاگ میں متعین کی جاسکتی ہیں.
سلوک
نیویگیشن
ایک_ کلک پر عناصر کی فعالیت
عناصر پر ماؤس پؤائنٹر آنے پر عناصر کے
انتخاب کا تاخیری وقت:
جب ایک کلک سلوک فعال ہو تو ماؤس کے پوائنٹر کو کسی عنصر پر ٹھہرانے سے معینہ وقت کے بعد وہ عنصر منتخب ہوجاتا ہے آپ اسے سلائیڈر کو بائیں طرف کے آخری نقطہ پر لے جاکر معطل کرسکتے ہیں، یہ سلوک اس وقت زیادہ مفید ہوتا ہے جب ایک کلک عنصر کو فعال کردے اور آپ اسے بغیر فعال کیے منتخب کرنا چاہتے ہوں.
معطل کردہ
متوسط
طویل
عناصر کو فعال کرنے کے لیے _ڈبل کلک کریں
اعلی
فولڈر کا اجازہ
فولڈر کے اجازے بدلتے وقت آپ فولڈر میں موجود
مواد میں بھی اس تبدیلی کا اطلاق کرسکتے ہیں
ذیل میں طے شدہ سلوک منتخب کریں:
ہر دفعہ پوچھیں
صرف فولڈر پر اطلاق کریں
فولڈر اور اس کے مواد پر اطلاق کریں
والیم ادارت
تھنر میں والیم ادارت کی معاونت کے استعمال
کے لیے "thunar-volman" پیکج نصب کریں.
تھنر میں والیم ادارت کی معاونت کے استعمال
کے لیے تھنر vfs بمع HAL معاونت کے بنائیں.
_والیم ادارت فعال کریں
قابلِ فصل ڈرائیوز اور میڈیا کو <a href="volman-config:">مرتب</a> کریں
(مثال کے طور پر کیمروں کو کس طرح ہینڈل کیا جائے)
والیم ادارت کی ترتیبات دکھانے میں ناکامی



عام
نام:
نوعیت:
کھولیں بذریعہ:
ربط ہدف:
حذف شدہ:
رسائی:
والیم:
خالی جگہ:
علامتیں
آئکن منتخب کریں برائے "%s"
"%s" کے لیے آئکن بدلنے میں ناکامی
%s - خصوصیات
_فائل
ار_سال تا
فائل کونٹیکسٹ مینیو
_فائلیں شامل کریں...
نام بدلنے کے لیے اس فہرست میں مزید فائلیں شامل کریں
صاف
ذیل کی فائل لسٹ صاف کریں
_بابت
تھنر بلک رینیم کی بابت معلومات ظاہر کریں
منتخب فائل کی خصوصیات دیکھیں
متعدد فائلوں کا نام بدلیں
فائ_لوں کا نام بدلیں
اوپر دی گئی فائلوں کا نام ان کے نئے نام سے بدلنے کے لیے یہاں کلک کریں.
نیا نام
نام بدلنے کے منتخب عمل کی دستاویزات دیکھنے کے لیے یہاں کلک کریں.
نام بدلنے کے کوئی ماڈیول آپ کے سسٹم میں نہیں پایا گیا، اپنی تنصیب
چیک کریں یا مدیرِ نظام سے رابطہ کریں، اگر آپ نے تھنر کو مصدر سے نصب
کیا ہے تو یقین کر لیں کہ "Simple Builtin Renamers" پلگ ان فعال ہے.
نام بدلنے کے لیے فائلیں منتخب کریں
آڈیو فائلیں
تصویر فائلیں
ویڈیو فائلیں
بلک رینیم
متعدد فائلوں کا نام بدلنے کے لیے تھنر
بلک ری نیم ایک بہترین اوزار ہے.


بلک رینیم - اجتماعی مبدل نام
"%s" کا نام "%s" سے بدلنے میں ناکامی.
آپ یا تو اس فائل کو نظر انداز کرسکتے ہیں اور باقی فائلوں کا نام بدلنے کے عمل کو جاری رکھ سکتے ہیں، یا پچھلی تبدیل شدہ فائلوں کا نام سابقہ نام پر واپس کرسکتے ہیں، یا سابقہ تبدیلیوں کو واپس کیے بغیر یہ عمل ملتوی کرسکتے ہیں.
ت_بدیلیاں واپس لیں
ا_س فائل کو چھوڑیں
کیا آپ اس فائل کو نظر انداز کر کے باقی فائلوں کا نام بدلنے کے عمل کو جاری رکھنا چاہتے ہیں؟
تھنر فائل منیجر مرتب کریں
فائل منیجر
ڈیسک ٹاپ


_ماؤنٹ والیم
_والیم نکالیں
والیم _کو ان ماؤنٹ کریں
_شارٹ کٹ حذف کریں
شار_ٹ کٹ کا نام بدلیں
پاتھ "%s" ڈائریکٹری نہیں ہے
نیا شارٹ کٹ شامل کرنے میں ناکامی
"%s" کو نکالنے میں ناکامی
"%s" کو ان ماؤنٹ کرنے میں ناکامی
فولڈر کے کل حجم کے حساب کو روکنے کے لیے یہاں کلک کریں
حساب روک دیا گیا
حساب لگایا جارہا ہے...
%s بائٹ

فولڈر کونٹیکسٹ مینیو
حالیہ فولڈر کے اندر خالی فولڈر بنائیں
_کٹ
ک_اپی
_پیسٹ
سابقہ کٹ یا کاپی کمانڈ سے منتخب کردہ فائلوں کو منتقل یا کاپی کریں
_حذف
سابقہ کٹ یا کاپی کمانڈ سے منتخب کردہ فائلوں کو منتخب کردہ فولڈر میں منتقل یا کاپی کریں
_سب فائلیں منتخب کریں
اس ونڈو میں موجود تمام فائلیں منتخب کریں
ن_قش سے منتخب کریں
مخصوص پیٹرن کی حامل تمام فائلیں منتخب کریں
ن_قل

_نام بدلیں...
ری _سٹور
_دستاویز بنائیں
فولڈر کا مواد لوڈ کیا جارہا ہے...
نئی خالی فائل
نئی خالی فائل...
ٹیمپلیٹ سے دستاویز بنائیں "%s"
پیٹرن سے منتخب کریں
م_نتخب کریں
ن_قش:
غلط فائل نام فراہم کردہ از  XDS ڈریگ سائٹ
یو آر ایل "%s" کے لیے ربط بنانے میں ناکامی
ڈائریکٹری "%s" کھولنے میں ناکامی







کوئی ٹیمپلیٹ نصب نہیں
_خالی فائل
_ردی
ردی کا مواد دکھائیں
لوڈنگ جاری ہے...
فولڈر کے اندر _پیسٹ کریں
_خصوصیات
آج
آج بوقت %X
گزرا کل
گزرا کل بوقت %X
%A بوقت %X
%x بوقت %X
_نئی ونڈو کھولیں
تھنر کی نئی ونڈو کھولیں
ت_مام ونڈوز بند کریں
تھنر کی کھلی ہوئی تمام ونڈوز بند کریں
_بند کریں
اس ونڈو کو بند کریں
_تدوین
تر_جیحات
تھنر کی ترجیحات متعین کریں
_منظر
_پھر تازہ
حالیہ فولڈر تازہ کریں
م_قام منتخب کار
_بغلی پٹی
ن_زدیک
فولڈر کا مواد مزید تفصیل سے دیکھیں
د_ور
فولڈر کا مواد کم تفصیل میں دیکھیں
_سادہ حجم
فولڈر کا مواد سادہ حجم میں دیکھیں
منتق_ل
_آبائی کھولیں
آبائی فولڈر کھولیں
_گھر
مرکزی فولڈر میں جائیں
ڈیسک ٹاپ فولڈر میں جائیں
دستاویزات کے فولڈر میں جائیں
ڈاؤنلوڈز کے فولڈر میں جائیں
موسیقی کے فولڈر میں جائیں
تصاویر کے فولڈر میں جائیں
ویڈیوز کے فولڈر میں جائیں
پبلک فولڈر میں جائیں
_ٹیمپلیٹس
ٹیمپلیٹس کے فولڈر میں جائیں
م_قام کھولیں...
کھولنے کے لیے مقام متعین کریں
_ہدایات
م_واد
تھنر صارف مینول کھولیں
تھنر کے بارے میں معلومات
_پوشیدہ فائلیں ظاہر کریں
مخفی فائلوں کے منظر کو اس فولڈر میں منعکس کریں
_پاتھ پٹی انداز
فولڈروں سے متصل بٹنوں کی ماڈرن اپروج
او_زار پٹی انداز
مقام پٹی اور نیویگیشن بٹنوں کے ساتھ روایتی اپروج
شار_ٹ کٹس
شارٹ کٹس پینل کا منظر منعکس کریں
_شجری
شجری پینل کا منظر منعکس کریں
حال_ت پٹی
اس ونڈو کی حالت پٹی کے منظر کو تبدیل کریں
دکھائ_یں بطور آئکن
فولڈر کا مواد آئکن منظر میں دکھائیں
دکھائیں ب_طور تفصیلی فہرست
فولڈر کا مواد تفصیلی فہرست میں دکھائیں
دکھائیں بط_ور مختصر فہرست
فولڈر کا مواد مختصر فہرست میں دکھائیں
انتباہ، آپ روٹ کا کھاتہ استعمال کر رہے ہیں، نظام کو نقصان پہنچ سکتا ہے.
آبائی فولڈر کھولنے میں ناکامی
ہوم فولڈر کھولنے میں ناکامی
فولڈر "%s" کھولنے میں ناکامی
ٹیمپلیٹس کی بابت
اس فولڈر کی تمام فائلیں "دستاویز بنائیں" کے مینیو میں ظاہر ہوں گی.
اگر آپ مستقل طور پر کسی قسم کی دستاویزات بناتے ہیں تو اس کی ایک کاپی اس فولڈر میں ڈال دیں. تھنر اس دستاویز کی انٹری "دستاویز بنائیں" کے مینیو میں شامل کردے گا.

پھر آپ یہ انٹری "دستاویز بنائیں" کے مینیو سے منتخب کرسکتے ہیں جس پر فوری طور پر یہ دستاویز آپ کے لیے وہیں بنا دی جائے گی.
یہ پیغام _دوبارہ ظاہر مت کریں
ردی کا مواد دکھانے میں ناکامی
تھنر Xfce ڈیسک ٹاپ ماحول کے استعمال کے لیے
آسان اور تیز رفتار فائل منیجر ہے.
سرنامہ
صفحہ کے سرنامہ کا متن
سرنامہ widget
عام صفحہ لیبل میں دکھانے کے لیے widget
مسکن
یاداشت سے بلگ ان انلوڈ مت کریں
ہدایات ربط
نام مبدل کی دستاویزات کا ربط
صارف کا ظاہری نام برائے مبدلِ نام
تفصیل:
انٹری کا عمومی نام جیسے فائر فاکس کی صورت میں "Web Browser".
کمانڈ:
آرگومینٹ سے ممکنہ، چلانے کے لیے پروگرام.
ربط:
ربط برائے رسائی.
تبصرہ:
انٹری کی ٹول ٹِپ مثال کے طور پر فائر فاکس کی صورت میں "انٹرنیٹ پر سائٹ دیکھیں". نام یا تفصیل سے مشابہ نہیں ہونی چاہیے.
اختیارات:
ابتد_ائیہ انتباہ استعمال کریں
ابتدائیہ انتباہ (سٹارٹ اپ نوٹیفیکیشن) فعال کرنے کے لیے یہ آپشن منتخب کریں، اس کی ضرورت تب پڑتی ہے جب فائل منیر یا مینیو سے کوئی کمانڈ چلائی جاتی ہے، ہر اطلاقیہ ابتدائیہ انتباہ کی معاونت نہیں رکھتا.
_ٹرمنل میں چلائیں
کمانڈ ٹرمنل ونڈو میں چلانے کے لیے یہ آپشن منتخب کریں.
لاؤنچر
ربط
"%s" کو محفوظ کرنے میں ناکامی.
اتارنے کا وقت:
کیمرے کا برانڈ:
کیمرے کا ماڈل:
اکسپوزر وقت:
اکسپوزر پروگرام:
Aperture ویلیو:
میٹرنگ موڈ:
فلیش فائرڈ:
فوکل طول:
شٹر رفتار:
ISO رفتار ریٹنگ:
سافٹ ویئر:
تصویر
تصویر کی قسم:

بدل_یں تا:
بڑے / چھوٹے حروف
_وقت مندرج کریں:
فائل کے نام میں شامل کرنے کے لیے فارمیٹ تاریخ اور وقت کے حصوں کو بیان کرتا ہے. مثال کے طور پر %Y کو سال میں بدل دیا جاتا ہے، %m کو مہینہ سے اور %d کو دن سے. مزید معلومات کے لیے تاریخ کے اطلاقیے کی دستاویزات دیکھیں.
ب_مقام:
تاریخ / وقت مندرج کریں
چھوٹے حروف
بڑے حروف
کیمل کیس
مندرج
اوپر لکھیں
1, 2, 3, ...
01, 02, 03, ...
001, 002, 003, ...
0001, 0002, 0003, ...
a, b, c, d, ...
آگے سے (بائیں)
پیچھے سے (دائیں)
پرانا نام - متن - عدد
عدد - متن - پرانا نام
متن - عدد
عدد - متن
حالیہ
تصویر اتارنے کی تاریخ
_متن:
مندرج / اوپر لکھیں
نم_بر فارمیٹ:
_شروع بمع:
متن _فارمیٹ:
نمبرنگ
مقام سے حذف کری_ں:
تا م_قام:
حروف ختم کریں
_تلاش برائے:
فائل کے ناموں میں تلاش کے لیے متن لکھیں.
_عام تاثر
اگر آپ نے اس آپشن کو فعال کردیا تو پیٹرن کو بطور عام تاثر لیا جائے گا اور Perl-compatible عام تاثر (PCRE) میچ کیا جائے گا. عام تاثر (ریگولر ایکسپریشن) سینٹیکس کے بارے میں مزید تفصیلات کے لیے دستاویزات کا مطالعہ کریں.
_بدلیں بمع:
متن لکھیں جو اوپر کے پیٹرن کے لیے بطور مبدل استعمال ہوگا.
_حساس تلاش
اگر آپ نے یہ آپشن فعال کردیا تو پیٹرن حساس معنوں میں تلاش کیا جائے گا. طے شدہ غیر حساس تلاش ہے.
کیریکٹر پوزیشن %ld: %s پر غلط عام تاثر
تلاش اور تبدیلی
"%s" کو ارسال کریں بطور دبی ہوئی محفوظہ
ب_راہ راست بھیجیں
دبی ہوئ_ی بھیجیں
بذریعہ ای میل فائل بھیجتے وقت آپ فائل کو ای میل سے منسلک کرنے سے پہلے بالکل اسی طرح یا دباکر بھیج سکتے ہیں، تجویز یہی کیا جاتا ہے کہ بڑی فائلوں کو بذریعہ ای میل ارسال کرنے سے پہلے انہیں دبا دیا جائے.

بھ_یجیں بطور محفوظہ
متعدد فائلیں بذریعہ ای میل بھیجتے وقت آپ متعدد فائلوں کو براہ راست ای میل سے منسلک کرسکتے ہیں، یا تمام فائلوں کو ایک دبی ہوئی محفوظہ میں دباکر ای میل سے منسلک کرسکتے ہیں، تجویز کیا جاتا ہے کہ متعدد فائلوں ایک دبی ہوئی محفوظہ میں دباکر بھجیا جائے.
فائلیں دبائی جارہی ہیں...
زپ کمانڈ %d غلطی کے ساتھ معطل کردی گئی
وقتی ڈائریکٹری بنانے میں ناکامی
رمزی ربط برائے "%s" بنانے میں ناکامی

نئی ای میل لکھنے میں ناکامی
ڈاک وصول کار
ردی سے رابطہ میں ناکامی
ردی میں فائلیں موجود ہیں
ردی خالی ہے
ردی ظاہر کریں
ردی ایپلیٹ
صوابدیدی حرکات
آپ مختلف قسم کی فائلوں کے لیے مختلف قسم کی حرکات متعین
کرسکتے ہیں جو فائل منیجر کے کونٹیکسٹ مینیو میں ظاہر ہوں گی.
نئی صوابدیدی حرکت شامل کریں.
منتخب کردہ حرکت مدون کریں.
حالیہ منتخب حرکت حذف کریں.
حالیہ منتخب حرکت ایک صف اوپر منتقل کریں.
حالیہ منتخب حرکت ایک صف نیچے منتقل کریں.
حرکت مدون کریں
حرکت بنائیں
حرکات ڈسک پر محفوظ کرنے میں ناکامی.
کیا آپ واقعی حذف کرنا چاہتے ہیں
حرکت "%s"؟
اگر آپ نے صوابدیدی حرکت حذف کی تو یہ ہمیشہ کے لیے ضائع ہوجائے گی.
بنیادی
_نام:
حرکت کا نام جو کانٹیکسٹ مینیو میں نظر آئے گا.
_تفصیل:
تفصیل جو حرکت کو منتخب کرنے پر معلومات کی پٹی میں ظاہر ہوگی.
_کمانڈ:
حرکت کی ادائیگی کے لیے کمانڈ (بشمول ضروری پیرامیٹر). ذیل میں کمانڈ پیرامیٹر لیجنڈ دیکھیے برائے معاونت پیرامیٹر ویریئبل فہرست، جنہیں کمانڈ چلانے پر تبدیل کیا جائے گا. جب بڑے حروف (مثال. %F, %D, %N) استعمال کیے جائیں گے حرکت قابلِ اطلاق ہوگی چاہے ایک سے زائد عناصر منتخب کیے گئے ہوں، ورنہ حرکت تب ہی قابلِ اطلاق ہوگی جب صرف ایک عنصر منتخب کیا جائے گا.
اس حرکت کے لیے اطلاقیہ منتخب کرنے کے لیے فائل سسٹم کو براؤز کریں.
_آئکن:
بغیر آئکن
آئکن منتخب کرنے کے لیے اس بٹن پر کلک کریں یہ آئکن کانٹیکسٹ مینیو میں حرکت کے نام کے ساتھ ظاہر ہوگی.
مندرجہ کمانڈ پیرامیٹر حرکت چلانے پر
تبدیل کردیے جائیں گے:
پہلی منتخب فائل کا پاتھ
تمام منتخب فائلوں کا پاتھ
ڈائریکٹری جس میں %f سے پاس فائل ہے
ڈائریکٹری جس میں %F سے پاس فائلیں ہیں
پہلی منتخب فائل کا نام (بغیر پاتھ کے)
منتخب فائلوں کا نام (بغیر پاتھ کے)
مظہر کے شرائط
_فائل کا پیٹرن:
پیٹرن کی فہرست شامل کریں جسے منتخب فائل پر حرکت کے تعین کے لیے استعمال کیا جائے گا. اگر آپ یہاں ایک سے زائد پیٹرن متعین کرتے ہیں تو ہر ایک کو سیمیکولن سے فاصلہ دیں (مثال. *.txt;*.doc)
ظاہر ہو جب انتخاب میں شامل ہو:
_ڈائریکٹریاں
_صوتی فائلیں
_تصاویر فائلیں
_متن فائلیں
_ویڈیو فائلیں
_دوسری فائلیں
یہ صفحہ وضاحت کرتا ہے کہ حرکت فائل مینجر کے
کونٹیکسٹ مینیوز کے کس حصہ میں ظاہر ہوگی.
فائل پیٹرن سیمیکولن سے الگ کیے گیے لاحقوں
کی ایک فہرست ہے (مثال. *.txt;*.doc)
کونٹیکسٹ مینیو میں حرکت کو ظاہر کرنے کے
لیے ان میں سے کم سے کم ایک پیٹرن فائل یا
فولڈر کے نام سے میچ کرتا ہو. اضافی طور پر آپ
صرف مخصوص قسم کی فائلوں کے لیے حرکت
کے ظاہر ہونے کو مرتب کرسکتے ہیں.
نا معلوم عنصر <%s>
روٹ کونٹیکسٹ کے دوران انتہائی عنصر ہینڈلر بلایا گیا
نا معلوم بند کردہ عنصر <%s>
uca.xml کے مقامِ حفظ کا تعین کرنے میں ناکامی
کمانڈ مرتب نہیں ہے
صوابدیدی حرکات مرتب کریں...
صوابدیدی حرکات کا تعین جو فائل منیجر کے کونٹیکسٹ مینیو میں ظاہر ہوں گے
حرکت "%s" چلانے میں ناکامی.
مخصوص حرکت کی مثال
ٹرمنل یہیں کھولیں
بطور وال پیپر مرتب کریں
فائل سسٹم کو فائل منیجر سے دیکھیں
تھنر فائل منیجر
فولڈر کھولیں
فولڈر تھنر سے کھولیں
متعین فولڈر تھنر میں کھولیں
[فائل]
ورژن کی معلومات طبع کر کے برخاست کریں
تصاویر منظرکار
سابقہ
اگلا
دور کریں
نزدیک کریں
تصویر کو ونڈو کے حجم پر لائیں
اصل حجم
پوری سکرین
گھڑی کے عکس گھمائیں
گھڑی کی سمت گھمائیں
افقی گھمائیں
عمودی گھمائیں
فائل کھولیں
فائل محفوظ کریں
فائل محفوظ کریں بنام
فائل حذف کریں
ترجیحات
برخاست
فائل کا نام جو آپ نے منتخب کیا ہے وہ پہلے ہی موجود ہے.
کیا آپ سابقہ فائل پر لکھنا چاہتے ہیں؟
(انتباہ: اصل تصویر کی کوالٹی خراب ہوسکتی ہے)
تصویر کے اس فارمیٹ کو لکھنے کی معاونت نہیں ہے.
کیا آپ واقعی حالیہ فائل کو حذف کرنا چاہتے ہیں؟

انتباہ: حذف ہونے کے بعد فائل دوبارہ حاصل نہیں کی جاسکے گی.
محفوظ بنام
 * ای او جی EOG اور GThumb تصاویر منظر کاروں کا مصدر کوڈ دیکھیے
محمد علی مکی
makki.ma@gmail.com
اردو کوڈر لینکس فورم
http://www.urducoder.com
مکی کا بلاگ
http://makki.urducoder.com
جی پیک ویو
کاپی رائٹ (C) 2007 - 2009
ہلکا پھلکا تصاویر منظر کار برائے ایل ایکس ڈی ای پراجیکٹ
جی پیک ویو آپ کے نظام میں معاونت رکھنے والی تمام تصاویر فائلوں کا طے شدہ تصاویر منظرکار بننے جارہا ہے.
(یہ 'xdg-mime' پروگرام کے ذریعے انجام دیا جائے گا)

<b>کیا آپ واقعی ایسا کرنا چاہتے ہیں؟</b>
تمام معاون تصاویر
تمام فائلیں
JPEG کوالٹی:
کم کوالٹی قدروں سے کم حجم کی فائلیں حاصل ہوتی ہیں،
مگر تصویر کی کوالٹی کم ہوجاتی ہے.
PNG دباؤ درجہ:
زیادہ دباؤ سے کم حجم کی فائلیں حاصل ہوتی ہیں،
مگر دبانے میں زیادہ وقت صرف ہوتا ہے.
<b>پس منظر رنگ</b>
تصاویر کو حذف کرنے سے پہلے سے پوچھیں
تصاویر محفوظ کرنے سے پہلے پوچھیں
گھمائی گئی تصاویر کو خودکار طور پر محفوظ کریں
پوری سکرین:
جی پیک ویو کو تصاویر کے لیے طے شدہ تصاویر منظرکار بنائیں
سادہ:
JPEG کو EXIF جہتیابی قدر تبدیل کر کے کھمائیں
(صرف اگر EXIF جہتیابی ٹیک موجود ہوا)
ٹاسک منیجر
سگنل %d بمع آئی ڈی %d ٹاسک کو ارسال نہیں کیا جاسکتا

%s
اہمیت %d بمع آئی ڈی %d ٹاسک پر مرتب نہیں کی جاسکتی
کیا واقعی اس پروگرام کو قتل کردیں؟
کیا واقعی اس پروگرام کو بند کردیں؟
یاداشت: %d م.ب برائے %d م.ب استعمال کردہ
سی پی یو استعمال: %0.0f %%
_فائل
_منظر
_ہدایات
سی پی یو استعمال
یاداشت استعمال
مزید تفصیلات
کمانڈ
صارف
CPU%
RSS
VM-حجم
PID
حالت
اہمیت
PPID
روکیں
جاری
بند کریں
قتل کریں
اہمیت
  -10
  -5
    0
   5
   10
صارف کی ٹاسک دکھائیں
روٹ کی ٹاسک دکھائیں
دیگر ٹاسک دکھائیں
کیشے کی استعمال کردہ یاداشت کو بطور خالی دکھائیں
ایل ایکس ٹاسک ایکسفس4 ٹاسک منیجر سے منتقل کیا گیا ہے از:
  * جوہانز زیلنر <webmaster@nebulon.de>
محمد علی مکی
makki.ma@gmail.com
اردو کوڈر لینکس فورم
http://www.urducoder.com
مکی کا بلاگ
http://makki.urducoder.com
ایل ایکس ٹاسک
کاپی رائٹ (C) 2008 ایل ایکس ڈی ای ٹیم
ہلکا پھلکا ٹاسک منیجر برائے ایل ایکس ڈی ای پراجیکٹ
غلطی
تصدیق
دہرائیں
رینڈم
ایم پی ڈی MPD کلائنٹ جو ایکسفس کے لیے GTK+ میں لکھا گیا ہے
محمد علی مکی
makki.ma@gmail.com
اردو کوڈر لینکس فورم
http://www.urducoder.com
مکی کا بلاگ
http://makki.urducoder.com
پلے لسٹ صاف کریں
ڈیٹا بیس تازہ کریں
کونٹیکسٹ مینیو
حالیہ پلے لسٹ
ڈیٹا بیس براؤز کریں
"%s" کی طرف سے از "%s" (%s)
رکا ہوا
غیر متصل ہے
%d گانے، %d گھنٹے اور %d منٹ
%d گانے، %d منٹ
غ/م
ایم پی ڈی
کنکشن
نظام کی _طے شدہ ترتیبات استعمال کریں
اگر منتخب کیا گیا تو Xfmpc ماحول متغیر MPD_HOST اور MPD_PORT پڑھنے کی کوشش کرے گا، دوسری صورت میں یہ localhost استعمال کرے گا
ہوسٹ نیم:
پورٹ:
پاس ورڈ:
مظہر
حالت پٹی
گانے کا فارمیٹ
عنوان
ایلبم - عنوان
فنکار - عنوان
فنکار - عنوان (تاریخ)
فنکار - ایلبم - عنوان
فنکار - ایلبم - ٹریک. عنوان
صوابدیدی...
صوابدیدی فارمیٹ:
دستیاب پیرامیٹر:
%a: فنکار
%A: ایلبم
%d: تاریخ
%D: ڈسک
%f: فائل
%g: نوعیت
%t: عنوان
%T: ٹریک
فائل
فنکار
ایلبم
تاریخ
ٹریک
نوعیت
ایم پی ڈی کلائنٹ
Xfmpc
(تبدیل شدہ)
%i سطور برائے فائل '%s' ٹھیک طرح لادی نہیں جاسکیں۔
&ک بابت
& ٹی ایم استعمال کرکے خودبخود ترجمہ کریں
&نشان زدگیاں
بند کریں
&عبارتیں۔۔۔
&تدوین
&فائل
&ڈھونڈیں۔۔۔
&پوری سکرین منظر
&مدد
&نئی فرد
&ترجیحات۔۔۔
&ختم شدہ تراجم صاف کریں
&محفوظ
&تراتیب۔۔۔
& شیڈ شدہ ترجمہ فہرست
&حوالہ جات دکھائیں
& ذرائع سے تازہ کریں
&منظر
'%s' جائز پی او ٹی فائل نہیں۔
(%f فائل نام سے بدل دی جائے گی, %l سطر نمبر کے ساتھ)
(%i نیا, %i متروک)
(0 نیا, 0 متروک)
(طےشدہ زبان استعمال کریں)
(ان میں سے کوئی بھی نہیں)
< پچھلا
<بے نام>
شامل کریں
فہرست میں ڈائریکٹری شامل کریں
فائلیں شامل کریں
ڈائرکٹری کی فہرست کی راہ شامل کریں جہاں فرد واقع ہے۔
ہمیشہ عبارتی مداخَل قطعے کی طرف مرکز نگاہ بدلیں
مداخلی فائلوں کی فہرست میں ایک آئیٹم:
کلیدی الفاظ کی فہرست میں ایک آئیٹم:
خودکار املاءپڑتال
خودکار ترجمہ
خودکار تراجم:
محفوظ کرتے وقت خودکار طور پر ۔ایم او فائلیں تالیف کریں
فرد کو تازہ کرتے وقت خودکارانہ ترجمہ کریں
خودکارانہ ترجمہ کیے گئے %u ڈورے
خودکارانہ ترجمہ زیر عمل۔۔۔
خراب شدہ
بنیادی راہ:
رویہ
شکستہ فرد فائل، بغیر msgid_ کی جمع کے، msgstr سے جمع کا استعمال
شکستہ فرد فائل، msgid_plural کے ساتھ msgstr کے واحد کا استعمال۔
کھنگالیں
فر&د
سی آر/ایل ایف تبدیلی
مسترد
کوائفیہ ڈائریکٹری نہیں بناسکتے!
پروگرام چلا نہیں سکتے: 
آر پی ایم فائل سے فردیں نہیں نکال سکتے۔
معاملاتی حساس
فرد
فرد بدلی گئی۔ کیا آپ تبدیلیاں محفوظ کرنا چاہتے ہیں؟
فردی &ناظم
صارفی مواجے کی زبان بدلیں
کیریکٹر سیٹ:
چنیں
صاف
تبصرہ صاف کریں
تبصرہ جاتی دریچہ قابل تدوین ہے
تبصرہ:
وضع قطع
تصدیق
اصلی کو ترجمہ قطعے میں نقل کریں
 %s فائل کو لادا نہیں جاسکتا، غالبًا یہ نقص زدہ ہے۔
ملک:
نیا ترجمہ جاتی منصوبہ تخلیق کریں
کوائفیہ
کوائفیہ غلطی: %s
ختم کریں
آئیٹم ختم کریں
منصوبہ ختم کریں
ڈائریکٹریاں:
&سطر نمبر نمایاں کریں
&واوین نمایاں کریں
کیا آپ واقعی ساری تازہ کاری چاہتے ہیں
منصوبے میں تمام فردوں کی؟
کیا آپ واقعی فرد میں سے وہ تمام تراجم ختم کردینا چاہتے ہیں جو استعمال میں نہیں؟
اگر آپ صفائی جاری رکھنا چاہتے ہیں، آپ کو مستقبل میں ان کی دوبارہ شمولیت کی صورت میں انھیں پھر سے ترجمہ کرنا ہوگا۔
کیا آپ منصوبے کو ختم کرنا چاہتے ہیں؟
موجودہ فردوں کی بناوٹ نہ بدلیں
بر&آمد
تدوین
تدوین &تبصرہ
تدوین تبصرہ
تدوین آئیٹم
تدوین منصوبہ
عبارتی مدوِن میں فائل کی تدوین
منصوبے کی تدوین کریں
مدوِن
مدوِن میں قابل تعمیل
اٹکل سے پڑتال املاء کو فعال کرتا ہے
فرد میں اندراجات غالبًا غیر درست ہیں۔
پڑتال املاء کا آغاز کرنے میں غلطی: %s
فائل %s کھولنے میں غلطی!
فرد محفوظ کرنے میں غلطی
برآمد بطور۔۔۔
بیرونی مدوِن
'%s' فائل وجود نہیں رکھتی
'%s' فائل کوئی پیغاماتی فرد نہیں۔
'%s' فائل صرف قابل مطالعہ ہے اس لیے محفوظ نہیں کی جاسکتی۔
براہ کرم اسے کسی دوسرے نام کے تحت محفوظ کریں۔
فہرست فائل
خودکار تبصروں میں ڈھونڈیں
تبصروں میں ڈھونڈیں
اصلی ڈوروں میں ڈھونڈیں
ترجموں میں ڈھونڈیں
ڈھونڈیں۔۔۔
خط(فونٹ)
پوری سکرین منظر
غیر واضح
غیر واضح ترجمہ
جی این یو عبارتی فردیں(*.po)|*.po|تمام فائلیں (*.*)|*.*
جی این یو گیٹ ٹیکسٹ سانچے (*.pot)|*.pot|تمام فائلیں (*.*)|*.*
جی این یو  گیٹ ٹیکسٹ دستاویزیت
ٹی ایم کوائفیہ پیدا کریں
کوائفیہ پیدا کریں
گیٹ ٹیکسٹ نحوی غلطی
روانگی بر نشان زدگی %i	Ctrl-%i
ایچ ٹی ایم ایل فائل (*.html)|*.html
شناخت
اگر نشان زد کردیا جائے، تبصرہ جاتی دریچہ قابل تدوین ہوگا
فریاد:
کلیدی حروف
انتخابِ زبان
زبان:
پچھلی بار بدلا گیا
سطر
سطر %u برائے فائل '%s' ناقص ہے (جائز %s کوائف نہیں)
سطر کی اختتامی بناوٹ:
متوسط وقف سے الگ کی گئیں اضافتوں کی فہرست (جیسے *.cpp;*.h):
میکنٹوش
ناقص ساختہ سرورق:  '%s'
زیادہ سے زیادہ . # کے گمشدہ الفاظ:
فقرے کی لمبائی میں زیادہ سے زیادہ فرق:
انجذاب کے فرق۔۔۔
نیچے جائیں
اوپر جائیں
میری زبانیں
میرا منصوبہ
ڈوروں کی لسٹ کو کبھی نمایاں نہ ہونے دیں۔ اگر فعال ہے تو آپ کو  کلیدی تختے سے کنٹرول ایرو دبا کر  نوردی کرنا پڑے گی لیکن آپ ٹیب دبا کر مرکز نگاہ بدلنے سے فورًا عبارت لکھ بھی سکتے ہیں۔
نیا
پوٹ فائل سے نئی فرد۔۔۔
نئی آئیٹم
نئے ڈورے
اگلا>
کوئی مدوِن بیان نہیں کیا گیا، براہ کرم ترجیحات کے مکالمہ میں ترتیب فراہم کریں۔
ذیل میں کوئی فائلیں نہیں ملیں:
اس ڈورے کے کوئی حوالہ جات نہیں ملے۔
نوٹس
ٹھیک ہے
متروک ڈورے
فرد کھولیں
فردی سانچہ کھولیں
فردی ناظم پو ایڈٹ کے آغاز پر کھولیں
ماخذی فائلیں مدوِن میں کھولیں، فائل ناظر میں نہیں
اصلی ڈورا
تجزیہ کار کمانڈ:
تجزیہ کار سیٹ اپ:
تجزیہ کاران
کوائفیے کی راہ:
راہیں
متشکل کریں
معلوم زبانوں کی فہرست سے زبان چنیں
براہ کریم اپنے کمپیوٹر سے ڈائریکٹریاں داخل کریں جہاں مقامیاتی فائلیں رکھی گئی ہیں:
براہ کرم حوالہ منتخب کریں جو آپ دکھانا چاہتے ہیں:
براہ کرم زبان کا عالمی معیاراتی ( آئی ایس او) کوڈ چنیں:
براہ کرم زبان کا کوڈ چنیں:
جمعی حالتیں:
جمع:
پوایڈٹ
پو ایڈٹ فردی ناظم
پو ایڈٹ کھنگالی گئی ڈائریکٹریوں سے کوئی فائل نہیں ڈھونڈ سکا۔
ترجیحات
مزید
منصوبہ جاتی معلومات
منصوبے کا نام اور  نسخہ(ورژن):
نام منصوبہ
حوالہ جات
حوالہ جات:
اوپر دی گئی راہوں کی فہرست سے ترجمہ جاتی یادداشت دوبارہ پیدا کریں۔
طےشدہ پر دوبارہ سیٹ کریں
محفوظ &بطور
محفوظ بطور۔۔۔
فرد محفوظ کریں
تبدیلیاں محفوظ کریں
فائل تقطیع کی جارہی ہے:
فائلیں تقطیع جارہی ہیں۔۔۔
راہیں تلاش کریں
فرد کی زبان کا انتخاب کریں۔
ڈائریکٹری منتخب کریں
زبان منتخب کریں
اپنی ترجیحی زبان کا انتخاب کریں۔
نشان زدگی کو ترتیب دیں  %i	Alt-%i
تراتیب(سیٹنگ)
سیٹ اپ
 &تبصرہ جاتی دریچہ دکھائیں
خودکار &تبصرہ جاتی دریچہ دکھائیں
فرد کی تازہ کاری کے بعد خلاصہ دکھائیں
واحد:
ماخذ کوڈ کا کیریکڑ سیٹ:
ماخذ کوڈ کے تجزیہ کار:
ماخذی فائل
پہلی آئیٹم سے آغاز کریں
ڈورا جو ڈھونڈنا ہے:
ٹیم کا برقی پتہ:
ٹیم:
فرد کو '%s' حرفی ترتیب(کیریکٹر سیٹ) میں محفوظ نہیں کیا جاسکا
جیساکہ فردی تراتیب میں بتایا گیا تھا۔ چناچہ اسے یو ٹی ایف 8میں محفوظ کردیا گیا تھا
اور تراتیب کو اس کے مطابق بدل دیا گیا تھا۔
فرد لادنے میں غلطیوں کا سامنا تھا۔جس کے نتیجہ میں کچھ کوائف نقص زدہ یا گم ہوسکتے ہیں۔
یہ تراتیب اب ماخذ میں نہیں رہیں۔
پو ایڈٹ انھیں اب فرد سے بھی ختم کردے گا۔
یہ ڈورے ماخذ میں موجود تھے لیکن فرد میں نہیں ملے۔
پو ایڈٹ اب انھیں فرد میں شامل کردے گا۔
یہ کمانڈ تجزیہ کار کو داغنے کے کام آتی ہے۔
%o ماحصل فائل کے نام تک پھیل جاتی ہے، %K کلیدی الفاظ 
کی لسٹ تک، %F مداخَل فائلوں کی لسٹ تک، 
%C حرفی معیار کے پھریرے تک۔(ذیل میں دیکھیں)
اس کو تحریری مواجے سے جوڑ دیا جائے گا
اگر رمزی ماخذ اور حرفی معیار دئیے گئے ہوں۔ %c حرفی معیار کی قدر تک پھیل جائے گا۔
اس کو ایک بار تحریری مواجے سے جوڑ دیا جائے گا
ہر مداخَل فائل کے لیے۔%f فائل نام تک پھیل جائے گا۔
اسے ایک بار تحریری مواجے سے جوڑ دیا جائے گا
ہر کلیدی لفظ کے لیے. %k کلیدی لفظ تک پھیل جائے گا۔
اگر منتخب ڈورے کا ترجمہ غیر واضح ہے تو الٹ دیا جائے گا۔
کُل
ترجمہ
ترجمہ جاتی یادداشت
ترجمہ جاتی فائلیں (*.po;*.mo)|*.po;*.mo
ترجمہ جاتی فائلیں (*.po;*.mo;*.rpm)|*.po;*.mo;*.rpm
ترجمہ &غیر واضح ہے
ترجمہ جاتی یادداشت نیچے فہرست کی گئی فائلوں سے تعمیر کی جائے گی۔
آپ ذیل کی فہرست میں مزید فائلیں جمع کرسکتے ہیں۔
مقامیت کا نامعلوم کوڈ '%s' رجسٹری میں ہے۔
پچھلا واپس
یونکس
ان ٹرانس
منصوبے میں تمام فردیں تازہ کریں۔
فرد تازہ کریں۔اسے ماخذ کے ساتھ ہم آہنگ کریں۔
&پی او ٹی فائل سے تازہ کریں۔۔۔
تازہ کاری کا خلاصہ
ترجمہ جاتی یادداشت کو تازہ کریں۔
فرد کی تازہ کاری۔۔۔
فرد کی تازہ کاری ناکام۔تفصیلات کے لیے 'مزید>>' پر کلک کریں۔
عبارتی قطعوں کے لیے صوابدیدی خط(فونٹ) استعمال کریں
ترجمہ جاتی فہرست کے لیے صوابدیدی خط(فونٹ) استعمال کریں
قابل ترجمہ ڈوروں کی نشاندہی کے لیے  ماخذی فائلیں یہ کلیدی الفاظ( اسمائے تفاعل) استعمال کریں
طےشدہ کے ساتھ ساتھ۔
صرف پورے الفاظ
دریچے
آپ ایک سے زیادہ فائلیں پو ایڈٹ کے دریچے پر ٹپکا سکتے ہیں۔
اس تبدیلی کو اطلاق پذیر بنانے کے لیے آپ کو پو ایڈٹ دوبارہ چلانا ہوگا۔
آپ کا نام:
[ترجموں کی جانچ : %i باقی]
موجودہ پلیٹ فارم کا طےشدہ
کوئی نہیں
استعمال: %prog [options] filename
ترسیمی نسخے کے لیے gdebi-gtk چلائیں

غیر-مُتعامل چلائیں (خطرناک)
اے پی ٹی تشکیل اختیار وضع کریں
پیش رفت کی معلومات مت دکھائیں
صرف بناوٹ بدلیں اور چھاپیں apt-get install موزوں سطر تا stderr
متبادل روٹ ڈائریکٹری استعمال کریں
جی ڈیبی غلطی، فائل نہیں پائی گئی: %s

پیکجوں کی تنصیب کے لیے روٹ ہونا لازمی ہے
کیا آپ سوفٹ ویئر پیکج نصب کرنا چاہتے ہیں [y/N]:
تنصیب کی تکمیل پر خودکار بند کریں
متبادل کوائف ڈائریکٹری استعمال کریں
سوفٹ ویئر فہرست ٹوٹی ہوئی ہے
یہ آپ کے سوفٹ ویئر ادارت نظام کی بڑی ناکامی ہے. سناپٹک سے ٹوٹے ہوئے پیکجوں کی پڑتال کریں، فائلوں کے اجازے اور فائل '/etc/apt/sources.list' کی درستگی کی پڑتال کریں اور سوفٹ ویئر کی معلومات 'sudo apt-get update' اور 'sudo apt-get install -f' سے دوبارہ لادیں.
  
<b><big>   </big></b>
<b>قائم کار:</b>
<b>اہمیت:</b>
<b>سیکشن:</b>
<b>حجم:</b>
<b>تنصیب کے لیے مندرجہ ذیل تبدیلیاں درکار ہیں:</b>
<b>نسخہ:</b>
تبدیلیوں کے کامیاب اطلاق کے بعد خودکار طور پر بند کریں
تفصیل
تفصیل:
تفصیلات
جی پی ایل, دیکھیں /usr/share/common-licenses/GPL
شامل فائلیں
اردو ترجمہ از محمد علی مکی
پیکج تنصیب کار
پیکج:
حالت:
ٹرمنل
_تفصیلات
_فائل
_ہدایات
پیکج _نصب کریں
_کھولیں...
_تازہ کریں
سوفٹ ویئر پیکج
جی ڈیبی پیکج انسٹالر
%s دستیاب نہیں ہے
لادا جارہا ہے...
پیکج تنصیب کار - %s
پیکج کنٹرول کوائف
اپ سٹریم کوائف
فائل فہرست پڑھنے میں غلطی
غلطی: 
یہی نسخہ پہلے ہی نصب ہے
پیکج _دوبارہ نصب کریں
انتخاب ڈائریکٹری ہے
فائل کا مواد پڑھنے میں غلطی '%s'
فائل کا مواد کشید نہیں کیا جاسکتا
<b>حذف ہونے جارہے ہیں: %s</b>
نصب ہونے جارہے ہیں: %s
سوفٹ ویئر پیکج کھولیں
سوفٹ ویئر پیکج
فائل نہیں پائی گئی
آپ نے ایک ایسی فائل نصب کرنے کی کوشش کی ہے جو (اب) موجود نہیں رہی. 
پیکج فائل نصب کی جارہی ہے...
کیا غیر مصدقہ سوفٹ ویئر نصب کردیا جائے؟
خبیت سوفٹ ویئر آپ کے کوائف کو نقصان اور آپ کے نظام پر تسلط حاصل کر سکتے ہیں.

ذیل کا پیکج غیر مصدقہ ہے اور اپنی اصل میں خبیث ہوسکتا ہے.
سوفٹ ویئر نصب کرنے کے لیے آپ کو انتظامی حقوق فراہم کرنے ہوں گے

دستی طور پر پیکج فائل نصب کرنا ممکنہ طور پر سیکورٹی رسک ہوسکتا ہے.
سوفٹ ویئر ہمیشہ قابلِ اعتبار سوفٹ ویئر تقسیم کار سے نصب کریں.

پیکج فائل نصب کرنے میں ناکامی
تمام درکار فائلیں اتاری نہیں جاسکتیں
براہِ مہربانی تنصیب کے وسیط یا اپنے انٹرنیٹ اتصال کی پڑتال کریں.
تمام انحصاریاں نصب نہیں کی جاسکتیں
بالعموم اس غلطی کا تعلق سوفٹ ویئر تقسیم کار سے ہوتا ہے. مزید تفصیلات کے لیے ٹرمنل کا دریچہ دیکھیں.
نصیب کیا جارہا ہے %s
تنصیب تمام ہوئی
پیکج '%s' نصب کردیا گیا ہے
پیکج '%s' نصب کرنے میں ناکامی
تنصیب مکمل ہوئی
تمام انحصاریاں مکمل طور پر نصب کرنے میں ناکامی
اسے درست کرنے کے لیے ٹرمنل کے دریچے میں 'sudo apt-get install -f' چلائیں.
نصب کیا جارہا ہے '%s'...
انحصاریاں نصب کی جارہی ہیں...
اضافی پیکج فائلیں اتاری جارہی ہیں...
فائل %s برائے %s بر رفتار %sB/s
فائل %s برائے %s
ازراہِ کرم ڈرائیو '%s' میں '%s' داخل کریں
تشکیلی عناصر لازماً =<value> کے ساتھ متعین ہونے چاہئیں

اے پی ٹی APT اختیار %s تا %s متعین نہیں کیا جاسکتا

نامعلوم پیکج نوعیت '%s', برخاست کیا جارہا ہے

سوفٹ ویئر پیکج کھولنے میں غلطی

پیکج خراب ہوگیا ہے یا آپ کو فائل کھولنے کی اجازت نہیں ہے. فائل کے اجازوں کی پڑتال کریں.

پیکج غیر نصب نہیں کیا جاسکتا

کوئی تفصیل دستیاب نہیں
مندرجہ ذیل پیکجز غیر توثیق شُدہ ہیں: 
مندرجہ ذیل پیکجوں کو حذف کرنا درکار ہے: 
مندرجہ ذیل پیکجوں کی تنصیب درکار ہے: 
تنصیب کے دوران غلطی: '%s'
شامل کردہ فائلیں
&پیکج نصب کریں
پیکج کی فائل نہیں پائی گئی
تنصیب کے لیے غیر موجود فائل منتخب کی گئی ہے. ازراہِ کرم موجود .deb پیکج فائل منتخب کریں.
&پیکج دوبارہ نصب کریں
پی&کج دوبارہ نصب کریں
حذف ہونے کو ہے: %s
<b>
ٹوٹی انحصاریاں
آپ کا نظام ٹوٹی انحصاریاں رکھتا ہے. جب تک یہ درست نہیں کیا جائے گا یہ اطلاقیہ آگے نہیں بڑھے گا. اسے درست کرنے کے لیے ٹرمنل میں 'gksudo synaptic' یا 'sudo apt-get install -f' چلائیں.
'%s' ڈبین پیکج نہیں ہے
فائل کی MIME نوعیت '%s' ہے چنانچہ یہ اس نظام پر نصب نہیں کی جاسکتی.
نہیں کھولا جاسکتا '%s'
پیکج خراب ہوچکا ہے یا آپ کو فائل کھولنے کی اجازت حاصل نہیں ہے. فائل کے اجازوں کی پڑتال کریں.
یہی نسخہ سوفٹ ویئر چینل میں دستیاب ہے
آپ کو تجویز دی جاتی ہے کہ آپ سوفٹ ویئر ہمیشہ چینل سے نصب کریں.
پرانا نسخہ سوفٹ ویئر چینل میں دستیاب ہے
عام طور پر آپ کو تجویز دی جاتی ہے کہ آپ نسخہ سوفٹ ویئر چینل سے نصب کریں کیونکہ یہ بہتر طور پر معاونت شُدہ ہوتا ہے.
نیا نسخہ سوفٹ ویئر چینل میں دستیاب ہے
آپ پر زور دیا جاتا ہے کہ آپ نسخہ سوفٹ ویئر چینل سے نصب کریں کیونکہ یہ بہتر طور پر معاونت شُدہ ہوتا ہے.
تمام انحصاریاں تسلی بخش ہیں
اسے نصب کرنے کے لیے %s پیکج <b>حذف</b> کرنا لازمی ہیں

اسے نصب کرنے کے لیے مزید %s پیکج نصب کرنا لازمی ہیں
ایک وقت میں صرف ایک سوفٹ ویئر ادارت اوزار چلانے کی اجازت ہے
ازراہِ کرم پہلے دوسرے اطلاقیے کو بند کریں جیسے 'Update Manager'، 'aptitude' یا 'Synaptic'.
میڈیا کی تبدیلی
مغربی یورپ
مشرقی یورپ
مشرقی ایشیا
SE اور SW ایشین
مشرقِ وسطی
یونیکوڈ
مغربی
وسطی یورپ
جنوبی یورپ
بیلٹک
سیریلک
عربی
گریک
ہبرو وژول
ہبرو
ترکی
نورڈک
سیلٹک
رومانوی
ارمینیا
چینی روایتی
سیرلیک/رشیا
جاپانی
کوریا
چینی سادہ
گرگورین
سیرلیک/اوکرینیا
کرواتیا
ہندی
فارسی
گجراتی
گرمکھی
آئیس لینڈ
ویتنام
تھائی
_فائل
_تدوین
_ٹیب
_ہدایات
ٹیب _بند کریں
_برخاست
_پیسٹ
_بابت
ایل ایکس ٹرمنل
محمد علی مکی
makki.ma@gmail.com
اردو کوڈر لینکس فورم
http://www.urducoder.com
مکی کا بلاگ
http://makki.urducoder.com
ٹرمنل ایمولیٹر برائے ایل ایکس ڈی ای پراجیکٹ
نیچے
بائیں
دائیں
اوپر
عالمی وقت ونڈو کھولی جارہی ہے...
عالمی وقت ونڈو کھولنے میں ناکامی
%s
گھڑی میں تبدیلی کے لیے کلک کریں
وقت ترتیب موڈ ختم کیا جارہا ہے
وقت ترتیب موڈ شروع کیا جارہا ہے
لوکل وقت
ترجیحات کی تبدیلی کے لیے بٹن 1
گھڑیوں کا وقت مرتب کرنے کے لیے بٹن 2
ترتیب برائے تبدیلی گھنٹہ
ترتیب برائے  تبدیلی منٹ
معیار
کچھ نہیں
برابر
مختلف
نیا
نئی کاپی
آخری گھڑی کو حذف کرنا ممکن نہیں.
ٹائم زون منتخب کریں
یہ گھڑی تازہ کریں
نئی خالی گھڑی شامل کریں
اس گھڑی کو نمونہ بناتے ہوئے نئی گھڑی شامل کریں
یہ گھڑی حذف کریں
اس گھڑی کو پہلے پر منتقل کریں
اس گھڑی کو بائیں منتقل کریں
اس گھڑی کو دائیں منتقل کریں
اس گھڑی کو آخر میں منتقل کریں
اس گھڑی کا ٹائم زون لوکل ٹائم زون پر سیٹ کریں
ونڈو بند کرکے برخاست کریں
گھڑی میں تبدیلی کرں
گھڑی کے پیرامیٹرز
گھڑی کا نام:
گھڑی کا نام لکھیں
گھڑی کا ٹائم زون:
گھڑی کا ٹائم زون لکھیں
(=کوئی درست TZ ویلیو)
متن فارمیٹنگ
پس منظر رنگ:
گھڑی کا پس منظر رنگ بدلنے کے لیے کلک کریں
طے شدہ استعمال کریں
اسے نظر انداز کرکے منتخب ویلیو کی بجائے طے شدہ استعمال کریں
پیش منظر (=متن) رنگ:
گھڑی کا پیش منظر رنگ بدلنے کے لیے کلک کریں
گھڑی کے نام کا فونٹ:
گھڑی کے نام کا فونٹ بدلنے کے لیے کلک کریں
گھڑی کے وقت کا فونٹ:
گھڑی کے وقت کا فونٹ بدلنے کے لیے کلک کریں
گھڑی کے نام کے نیچے لائن:
گھڑی کے وقت کے نیچے لائن:
طے شدہ متن فارمیٹنگ
گھڑیوں کا طے شدہ پس منظر رنگ بدلنے کے لیے کلک کریں
اسے نظر انداز کرکے بجائے منتخب رنگ کے نظام کا طے شدہ استعمال کریں
گھڑیوں کا طے شدہ متن رنگ بدلنے کے لیے کلک کریں
گھڑی کے نام کا طے شدہ فونٹ بدلنے کے لیے کلک کریں
اسے نظر انداز کرکے بجائے منتخب فونٹ کے نظام کا طے شدہ استعمال کریں
گھڑی کے وقت کا طے شدہ فونٹ بدلنے کے لیے کلک کریں
نیچے لائن برائے گھڑی کا نام:
نیچے لائن برائے گھڑی کا وقت:
ترجیحات تازہ کریں
ترجیحات تبدیل کریں
عام ترجیحات
ڈیکوریشنز:
سادہ ڈیکوریشن استعمال کریں
ونڈو کی ڈیکوریشن مت دکھائی (بارڈر)
گھڑی کا حجم:
تمام گھڑیوں کا ایک ہی حجم ہو
تفاوت
گھڑی احجام تفاوت
لوکل ٹائم زون:
لوکل ٹائم زون لکھیں. (یہ دیکھنے کے لیے استعمال ہوتا ہے کہ کیا وقت سابقہ (-) یا اگلی تاریخ (+) پر ہے، اس کے لیے وقت کے بعد +/- لکھیں)
مظہر
_فریم دکھائیں
پیش من_ظر رنگ:
پ_س منظر رنگ:
اونچائی:
چوڑائی:
گھڑے کے آپشن
ٹائم زون:
کوئی بھی ٹائم زون ویلیو (=TZ) مرتب کریں یا فہرست میں سے ایک منتخب کریں.
لائن _1 ظاہر کریں:
کوئی بھی موزوں strftime فنگشن پیرامیٹر لکھیں.
لائن _2 ظاہر کریں:
لائن _3 ظاہر کریں:
ٹول ٹپ:
یہ پروگرام وقت کے حصول کے لیے  strftime فنگشن کا استعمال ہے.
اپنے پسندیدہ فارمیٹ میں وقت کے حصول کے لیے کوئی بھی موزوں کوڈ استعمال کریں.
کچھ عام کوڈ یہ ہیں:	%A = weekday			%B = month
	%c = date & time		%R = hour & minute
	%V = week number		%Z = timezone in use
	%H = hours 				%M = minute
	%X = local time			%x = local date
خصوصیات
Orage گھڑی
%A %d %B %Y/%V
Orage - کیلینڈر
اپنے ایکسفس 4 کے وقت کی ادارت کیجیے
منتظم
اصل مصنف، ریٹائر منتظم
حصہ دار
آخر
واجب الادا
کیلینڈر
فائل منتخب کریں...
صوتی فائل
تمام فائلیں
انتباہ
اپائنٹمنٹ معلومات تبدیل ہوگئی ہیں.
کیا آپ آگے بڑھنا چاہتے ہیں؟
اس اپائنٹمنٹ کا اختتام شروع ہونے سے پہلے ہے.
یہ اپائنٹمنٹ ہمیشہ کے لیے حذف کردی جائے گی.
نئی اپائنٹمنٹ - Orage
*** کاپی ***
_فائل
محفو_ظ اور برخاست
ن_قل
محفوظ کریں
محفوظ اور برخاست
منعکس
نقل
حذف
فارغ
مصروف
عام
قسم
واقعہ
واقعات جو کبھی کبھی وقوع پذیر ہوتے ہیں جیس:
میٹنگ یا سالگرہ یا کوئی ٹی وی پروگرام.
برائے ادا
کوئی کام جو آپ نے کبھی کرنا ہو مثال کے طور پر:
اپنی گاڑی دھونی ہو یا آرگ کا نیا ورژن چیک کرنا ہو.
روزنامہ
کسی چیز کے بارے میں نوٹ بنائیں مثلا:
مکی نے ایکسفس 4 کا ترجمہ کیا، یا پہلی بارش کب ہوئی.
عنوان
مقام
تمام دنوں کے واقعات
شروع
مدت
دن
گھنٹے
منٹ
دستیابی
مکمل شدہ
ہوگيا
نوٹ
<D> حالیہ تاریخ لوکل فارمیٹ میں مندرج کریں.
<T> مندرج کریں وقت اور
<DT> وقت اور تاریخ مندرج کریں.
شروعات سے پہلے
انتہا سے پہلے
شروعات کے بعد
انتہا کے بعد
الارم
الارم کا وقت
زیادہ تر آپ الارم کب چاہتے ہیں:
1) واقعہ شروع ہونے سے پہلے
2) برائے ادا ختم ہونے سے پہلے
3) برائے ادا شروع ہونے کے بعد
آواز
استعمال
اگر آپ صوتی الارم چاہتے ہیں تو اسے منتخب کریں
الارم کی آواز دہرائیں
اوقات
سیکنڈوں کا وقفہ
بصری
آرگ ونڈو استعمال کریں
اگر آپ آرگ ونڈو الارم چاہتے ہیں تو اسے منتخب کریں
اطلاع استعمال کریں
اگر آپ تنبیہی الارم چاہتے ہیں تو اسے منتخب کریں
انتہائی وقت مرتب کریں
اگر آپ چاہتے ہیں کہ تنبیہی الارم خودکار طور پر ایکسپائر ہوجائے تو اسے منتخب کریں
0 = نظام کا طے شدہ ایسکپائریشن وقت
سیکنڈ
طرقہ کار
اگر آپ پروسیجر یا سکرپٹ الارم چاہتے ہیں تو اسے منتخب کریں
لازم ہے کہ آپ خود اسکیپ وغیرہ کیریکٹر خود ڈالیں.
یہ سٹرنگ صرف شیل کو عمل کاری کے لیے دی جائے گی
روزانہ
ہفتہ وار
ماہنامہ
سالنامہ
پیر
منگل
بدھ
جمعرات
جمعہ
ہفتہ
اتوار
تکرار
پیچیدگی
بنیادی
اعلی
اگر آپ سادہ تکراری واقعہ چاہتے ہیں تو اسے منتخب کریں
اگر آپ پیچیدہ اوقات چاہتے تو اسے استعمال کریں جیسے:
ہر ہفتہ اور اتوار یا 
مہینے کا پہلا منگل
فریکوینسی
ہر ایک
ہونا
چند وقفوں میں فریکوینسی کو محدود کریں.
مثال کے طور پر: ہر تیسرے دن:
فریکوینسی = روزانہ اور وقفہ = 3
حد
ہمیشہ کے لیے دہرائیں
دہرائیں
دہرائیں جب تک
ہفتہ کے دن
کس دن
ماہانہ اور سالانہ واقعات کے لیے ہفتے کے دن متعین کریں.
مثال کے طور پر:
ہر ماہ کا دوسرا بدھ:
	فریکوینسی = ماہانہ،
	ہفتے کے دن = صرف بدھ کا دن چیک کریں،
	کون سا دن = ذیل کے نمبروں سے 2 منتخب کریں بدھ
_منظر
_جائیں
نیو
پیچھے
آج
آگے
پھر تازہ
بند کریں
ظاہر کریں
تمام دن
وقت
آپ تمام اپائنٹمنٹ ہمیشہ کے لیے
حذف کردیں گے.
تلاش
دکھانے کے لیے اضافی دن
روزنامہ کے انٹریاں شروع ہوں از:
تلاش
تلاش متن
جھنڈیاں
عنوان
تاریخ اٹھائیں
افریقا
افریقا/عابد جان
افریقا/اسرا
افریقا/ادیس_ابابا
افریقا/الگیرس
افریقا/اسمرہ
افریقا/باماکو
افریقا/بانگوی
افریقا/بینجل
افریقا/بساؤ
افریقا/بلینٹئر
افریقا/برازاویل
افریقا/بجومبرا
افریقا/قاہرہ
افریقا/کازابلانکا
افریقا/سیوٹا
افریقا/کوناکری
افریقا/ڈکر
افریقا/دار_السلام
افریقا/جیبوٹی
افریقا/ڈوالا
افریقا/العیون
افریقا/فری_ٹاؤن
افریقا/گابورونی
افریقا/ہرارے
افریقا/جوہانسبرگ
افریقا/کمپالا
افریقا/خرطوم
افریقا/کیجالی
افریقا/کنشاسا
افریقا/لوگوز
افریقا/لبریویل
افریقا/لومی
افریقا/لوانڈا
افریقا/لبمباشی
افریقا/لوساکا
افریقا/ملابو
افریقا/ماپوتو
افریقا/ماسیرو
افریقا/امبابانی
افریقا/مقدیشو
افریقا/مونروویا
افریقا/نیروبی
افریقا/نڈجامینا
افریقا/نیامی
افریقا/نواکچوٹ
افریقا/اواگاڈوگو
افریقا/پروٹونوو
افریقا/ساؤ_ٹومی
افریقا/ٹمبکٹو
افریقا/ٹریپولی
افریقا/تونس
افریقا/ونڈھویک
امریکا
امریکا/ایڈاک
امریکا/اینکوریگ
امریکا/انگولا
امریکا/انٹیگوا
امریکا/اراگوائنا
امریکا/اروبا
امریکا/اسونسیون
امریکا/بارباڈوس
امریکا/بیلیم
امریکا/بلائز
امریکا/بوا_وستا
امریکا/بوگوٹا
امریکا/بوئز
امریکا/بیونز_ایرس
امریکا/کیمبرڈج_بے
امریکا/کینکن
امریکا/کاراکاز
امریکا/کاٹامارکا
امریکا/کینی
امریکا/کائمان
امریکا/چگاگو
امریکا/چیہوواہوا
امریکا/کارڈوبا
امریکا/کوسٹا_ریکا
امریکا/کوابا
امریکا/کوراکاؤ
امریکا/ڈاؤسن
امریکا/ڈاؤسن_کریک
امریکا/ڈینور
امریکا/ڈیٹرائٹ
امریکا/ڈیمینیکا
امریکا/ایڈمنٹن
امریکا/ایروناپی
امریکا/ال_سلواڈور
امریکا/فورٹالیزا
امریکا/گلیس_بے
امریکا/گڈٹھیب
امریکا/گوز_بے
امریکا/گرینڈ_ٹرک
امریکا/گریناڈا
امریکا/گواڈیلوپ
امریکا/گوئٹیمالا
امریکا/گوئیقالی
امریکا/گویانا
امریکا/ہیلیفیکس
امریکا/ہاوانا
امریکا/ہیرموسیلو
امریکا/انڈیانا/انڈیاناپولس
امریکا/انڈیانا/کنوکس
امریکا/انڈیانا/میرنگو
امریکا/انڈیاناویوے
امریکا/انڈیاناپولس
امریکا/اینوک
امریکا/ایکوالوٹ
امریکا/جمائکا
امریکا/جوجوی
امریکا/جونیاؤ
امریکا/کینٹاکی/لوئسویل
امریکا/کینٹاکی/مونٹیسیلو
امریکا/لاپاز
امریکا/لیما
امریکا/لوس_انجلس
امریکا/لوئسویل
امریکا/میسیو
امریکا/ماناگوا
امریکا/ماناؤس
امریکا/مارٹینیک
امریکا/مازاٹلن
امریکا/مینڈوزا
امریکا/مینومائنی
امریکا/میریڈا
امریکا/میکسیکو_سٹی
امریکا/مکولن
امریکا/مونٹیری
امریکا/مونٹی_ویڈیو
امریکا/مونٹیریل
امریکا/مونٹسیرا
امریکا/ناساؤ
امریکا/نیو_یارک
امریکا/نیپیگن
امریکا/نوم
امریکا/نورنہا
امریکا/پنما
امریکا/پینگنیرٹنگ
امریکا/پاراماریبو
امریکا/فینکس
امریکا/پورٹ_اےیو_پرنس
امریکا/پورٹ_آف_سپین
امریکا/پورٹو_ولہو
امریکا/پورٹوریکو
امریکا/رینی_ریور
امریکا/رینکن_انلٹ
امریکا/ریسف
امریکا/ریجینا
امریکا/ریو_برانکو
امریکا/روزاریو
امریکا/سینٹیگو
امریکا/سینٹو_ڈومینگو
امریکا/ساؤ_پاؤلو
امریکا/سکورسبائسنڈ
امریکا/شپراک
امریکا/سینٹ_جان
امریکا/سینٹ_کٹس
امریکا/سینٹ_لوسیا
امریکا/سینٹ_تھومس
امریکا/سینٹ_ونسنٹ
امریکا/سوفٹ_کرنٹ
امریکا/ٹیگوسیگالپا
امریکا/تھول
امریکا/ٹھنڈر_بے
امریکا/ٹیجوانا
امریکا/ٹورٹولا
امریکا/وینکوور
امریکا/وائٹ_ہارس
امریکا/وینیپگ
امریکا/یاکوٹیٹ
امریکا/ییلونیف
اینٹرکٹیکا
اینٹرکٹیکا/کیسی
اینٹرکٹیکا/ڈیوس
اینٹرکٹیکا/ڈومونٹ_ڈرول
اینٹرکٹیکا/ماؤسن
اینٹرکٹیکا/مکمرڈو
اینٹرکٹیکا/پالمر
اینٹرکٹیکا/ساؤتھ_پول
اینٹرکٹیکا/سیووا
اینٹرکٹیکا/ووسٹوک
ایرکٹیک
ایرکٹیک/لونگیاربین
ایشیا
ایشیا/عدن
ایشیا/الماطی
ایشیا/عمان
ایشیا/ایناڈائر
ایشیا/ایکٹاؤ
ایشیا/اکٹوب
ایشیا/اشکاباد
ایشیا/بغداد
ایشیا/بحرین
ایشیا/باکو
ایشیا/بینکاک
ایشیا/بیروت
ایشیا/بشکیک
ایشیا/برونائی
ایشیا/کلکتا
ایشیا/چونگکنگ
ایشیا/کولومبو
ایشیا/دمشق
ایشیا/ڈھاکہ
ایشیا/دلی
ایشیا/دبی
ایشیا/دوشنبے
ایشیا/غزہ
ایشیا/ہاربن
ایشیا/ہانگ_کانگ
ایشیا/ہووڈ
ایشیا/ایرکٹسک
ایشیا/اسطنبول
ایشیا/جاکرتا
ایشیا/جایاپورا
ایشیا/یروشلم
ایشیا/کابل
ایشیا/کمچٹکا
ایشیا/کراچی
ایشیا/کاشغر
ایشیا/کھٹمنڈو
ایشیا/کرسنویارک
ایشیا/کوالا_لمپور
ایشیا/کچنگ
ایشیا/کویت
ایشیا/مکاؤ
ایشیا/مگاڈن
ایشیا/منیلا
ایشیا/مسقط
ایشیا/نیکوسیا
ایشیا/نووسبرک
ایشیا/اومسک
ایشیا/فنوم_پنہ
ایشیا/پونٹیاناک
ایشیا/پیونگ_یانگ
ایشیا/قطر
ایشیا/رنگون
ایشیا/ریاض
ایشیا/سائگون
ایشیا/سمرقند
ایشیا/سیول
ایشیا/شنگھائی
ایشیا/سنگاپور
ایشیا/ٹائپی
ایشیا/تاشقند
ایشیا/ٹبلیسی
ایشیا/طہران
ایشیا/تھمفو
ایشیا/ٹوکیو
ایشیا/اجنگ_پینڈینگ
ایشیا/الانباٹر
ایشیا/ارومقی
ایشیا/وینٹیانی
ایشیا/ولاڈیووسٹک
ایشیا/یاکٹسک
ایشیا/یکاٹیرنبرگ
ایشیا/ییروان
ایٹلینٹک
ایٹلینٹک/ازورس
ایٹلینٹک/برمودا
ایٹلینٹک/کیناری
ایٹلینٹک/کیپ_ورڈ
ایٹلینٹک/فائروی
ایٹلینٹک/جین_ماین
ایٹلینٹک/ماڈیرا
ایٹلینٹک/ریکجیوک
ایٹلینٹک/ساؤتھ_جیورجیا
ایٹلینٹک/سینٹ_ہیلینا
ایٹلینٹک/سٹینلی
اسٹریلیا
اسٹریلیا/ایڈیلیڈ
اسٹریلیا/برسبن
اسٹریلیا/بروکن_ہل
اسٹریلیا/ڈارون
اسٹریلیا/ہوبارٹ
لنڈیمین
اسٹریلیا/لارڈ_ہوی
اسٹریلیا/ملبرن
اسٹریلیا/پرتھ
اسٹریلیا/سڈنی
یورپ
یورپ/ایمسٹرڈیم
یورپ/انڈورا
یورپ/ایتھنز
یورپ/بیلفاسٹ
یورپ/بلغراد
یورپ/برلن
یورپ/بریٹسلیوا
یورپ/برسلز
یورپ/بوخارست
یورپ/بودھاپسٹ
یورپ/چسیناؤ
یورپ/کوپنہیگن
یورپ/ڈبلن
یورپ/جبل الطارق
یورپ/ہلسنکی
یورپ/اسطنبول
یورپ/کیلیننگریڈ
یورپ/کیو
یورپ/لسبن
یورپ/لجوبلجانا
یورپ/لندن
یورپ/لکسمبرگ
یورپ/مدرید
یورپ/مالٹا
یورپ/منسک
یورپ/موناکو
یورپ/موسکو
یورپ/نکوسیا
یورپ/اوسلو
یورپ/پیرس
یورپ/پروگ
یورپ/ریگا
یورپ/روم
یورپ/سمارا
یورپ/ سین_میرینو
یورپ/سراییوو
یورپ/سمفیروپول
یورپ/سکوپی
یورپ/صوفیا
یورپ/سٹاک ہالم
یورپ/ٹیللن
یورپ/ٹرین
یورپ/ازہگوروڈ
یورپ/واڈوز
یورپ/ویٹیکن
یورپ/ویینا
یورپ/ولنس
یورپ/وارساؤ
یورپ/رغرب
یورپ/زاپوروزھی
یورپ/زیورخ
انڈین
انڈین/انٹاناناریوو
انڈین/چاگوس
انڈین/کرسمس
انڈین/کوکوس
انڈین/کومورو
انڈین/کیرگیویلین
انڈین/ماہی
انڈین/مالدیپ
انڈین/موریشس
انڈین/مایوٹی
انڈین/ری_یونین
پیسیفک
پیسیفک/ایپیا
پیسیفک/آکلینڈ
پیسیفک/چتھم
پیسیفک/ایسٹر
پیسیفک/ایفیٹ
پیسیفک/انڈربری
پیسیفک/فاکاؤفو
پیسیفک/فیجی
پیسیفک/فونافوٹی
پیسیفک/گالاپاگوس
پیسیفک/گیمبیئر
پیسیفک/گواڈلکانال
پیسیفک/گوام
پیسیفک/ہونولولو
پیسیفک/جانسٹن
پیسیفک/کریٹیماٹی
پیسیفک/کوسرے
پیسیفک/کواجالین
پیسیفک/ماجورو
پیسیفک/مارکیوساس
پیسیفک/مڈوے
پیسیفک/ناؤرو
پیسیفک/نیو
پیسیفک/نارفالک
پیسیفک/نومیا
پیسیفک/پاگو_پاگو
پیسیفک/پالاؤ
پیسیفک/پٹکیرن
پیسیفک/پوناپی
پیسیفک/پورٹ_موریسبی
پیسیفک/راروٹونگا
پیسیفک/سائپان
پیسیفک/تاہیتی
پیسیفک/ٹاراوا
پیسیفک/ٹونگاٹاپو
پیسیفک/ٹرک
پیسیفک/ویک
پیسیفک/والس
پیسیفک/یاپ
Orage کا طے شدہ الارم
الارم فہرست بنائیں: %d الارم شامل کیے گئے %d واقعات کی عمل کاری ہوئی.
	الارم تلاش کیے گئے %d جن میں سے %d فعال ہیں. (%d recurring الارم تلاش کیے گئے)
	Recur ختم، محفوظہ فائل میں منتقل کیا جارہا ہے.
محفوظہ فعال نہیں ہے. بند کیا جارہا ہے
Archiving threshold: %d مہینہ/مہینے
	%04d-%02d-%02d سے پرانے واقعات محفوظہ میں محفوظ کیے جارہے ہیں
محفوظہ میں محفوظ کیے جارہے ہیں uid: %s
	برائے ادا مکمل نہیں، محفوظہ میں محفوظ نہیں کیے جائیں گے
	Recurring اختتام سال: %04d، مہینہ: %02d، دن: %02d
محفوظہ میں محفوظگی مکمل

محفوظہ حذف کرنا شروع کیا جارہا ہے
	PHASE 1: reset recurring appointments
	PHASE 2: return archived appointments
محفوظہ کی حذف کاری مکمل

ٹائم زون اٹھائیں
UTC
فلوٹنگ
کیلینڈر کی فائلیں
حالیہ اجنبی فائلیں
صرف پڑھنے کے لیے
پڑھنا لکھنا
***** اجنبی فائلیں نہیں *****
درآمد/برآمد
درآمد
فائل سے پڑھیں:
فائلوں کے نام کوما (,) سے الگ کریں.
نوٹ: Orage کی فائل کے ناموں میں کوما غیر کارآمد کیرکٹر ہے.
برآمد
لکھیں تا فائل:
منتخب کریں
تمام اپائنٹمنٹ:
مسمی اپائنٹمنٹس:
آپ انہیں آسانی سے واقعات فہرست ونڈو سے گھسیٹ سکتے ہیں.
Orage اپائنٹمنٹ UIDs کوما سے فاصلے دیے ہوئے.
محفوظہ
ابھی محفوظہ بنائیں (threshold: %d مہینے)
آپ محفوظہ کی threshold پیرامیٹرز میں تبدیل کرسکتے ہیں
محفوظگی ابھی واپس لیں
Orage کی فائلیں
Orage کی مین کیلینڈر فائل
حالیہ فائل
نئی فائل
حرکت اختیارات
پھرنام دیں
صرف Orage کی داخلی فائلوں کے نام کی تبدیلی.
خارجی فائل سسٹم کو کچھ مت کہیں.
نئی فائل لازمی ہونی چاہیے.
کاپی
حالیہ فائل پرانی جگہ میں کاپی کردی گئی ہے اور اس میں تبدیلی نہیں ہوگی.
منتقل کریں
حالیہ فائل پرانی جگہ سے منتقل کرکے چھپا دی گئی ہے.
محفوظہ فائل
اجنبی فائل
نئی خارجی فائل شامل کریں
خارجی فائل:
اختیارات
صرف پڑھنے کے لیے
ڈیٹا کا تبادلہ - Orage
	یہ ہے %s ورژن %s برائے ایکسفس %s


	GNU کے جنرل پبلک لائسنس کے تحت جاری کیا گیا

	کمپائل ہوا بمقابل GTK+-%d.%d.%d،
GTK+-%d.%d.%d کو استعمال کرتے ہوئے 

	Using DBUS for import.

	Not using DBUS. Import works only partially.

Usage: orage [options] [files]


اختیارات:

--version (-v) 		show version of orage

--help (-h) 		print this text

--preferences (-p) 	show preferences form

--toggle (-t) 		make orage visible/unvisible

--add-foreign (-a) file [RW] 	add a foreign file

--اجنبی-فائل (-r) حذف کریں 	اجنبی فائل حذف کریں

فائلیں=ical فائلیں orage میں لوڈ کرنے کے لیے

	ڈی بس orage میں شامل نہیں. 

	بغیر dbus [فائلیں] اور اجنبی فائل اختیارات(-a اور -r) صرف orage کو چلانے پر استعمال کی جاسکتی ہیں 


نا معلوم آپشن %s


_تبادلہ ڈیٹا
_تدوین
منت_خب تاریخ دیکھیں
_آج منتخب کریں
_ہدایات
مین سیٹ اپ
ٹائم زون
محفوظہ threshold (مہینے)
(0 = محفوظگی نہیں)
صوتی کمانڈ
ڈسپلے
کیلینڈر کی مین ونڈو
بارڈر دکھائیں
مینیو دکھائیں
چپکا ہوا سیٹ کریں
ٹاپ پر سیٹ کریں
ٹاسک بار میں دکھائیں
پیجر میں دکھائیں
نظام کی ٹرے میں دکھائیں
کیلنڈر شروعات
چھپائیں
چھوٹا کریں
اضافی ترتیبات
ہمیشہ آج منتخب کریں
متحرک آئکن حجم
(0 = ثابت آئکن استعمال کریں)
Orage کی ترجیحات
ریمائنڈر
کھولیں
نیا فعال الارم:

%02d د %02d گ %02d منٹ تا: %s

کوئی فعال الارم دریاف نہیں ہوا
نئی اپائنٹمنٹ
Orage بابت
Orage گھڑی
وقت اور تاریخ کیا ہے؟
کیلینڈر
کیلینڈر ترتیبات
ترتیبات برائے ایکسفس 4 کیلنڈر اطلاقیہ
ایکسفس 4 کیلینڈر ترتیبات
ڈیسک ٹاپ کیلینڈر
یہ ونڈو شاید مصروف ہے اور جواب نہیں دے رہی.
کیا آپ اطلاقیے کو بند کرنا چاہتے ہیں؟
انتباہ
کچھ نہیں
ترتیبات منیجر ساکٹ
ساکٹ آئی ڈی
ورژن معلومات
.
%s: %s
تمام دستیاب کمانڈ لائن اختیارات دیکھنے کے لیے %s --help ٹرائی کریں

مقام کار %d
مقام کار کا نام
ترتیبات منیجر ساکٹ
ونڈو کا سلوک اور شارٹ کٹ وضع کریں
ونڈو منیجر
ونڈو کا سلوک اور ایفیکٹ مرتب کریں
ونڈو منیجر کار کردگی
مقام کاروں کی تعداد اور نام متعین کریں
مقام کار
  
<b>بکس منتقلی اور ری سائز</b>
<b>بٹن کا خاکہ</b>
<b>ڈبل کلک ح_رکت</b>
<b>فوکس ماڈل</b>
<b>نئی ونڈو فوکس</b>
<b>کلک پر اونچا کریں</b>
<b>فوکس پر اونچا کریں</b>
<b>عنوان کی _ہمواری</b>
<b>عنوان کا _فونٹ</b>
<b>ونڈو _شارٹ کٹ</b>
<b>ونڈوز سنیپنگ</b>
<b>مقام کار سمیٹنا</b>
<b>_تھیم</b>
فعال
ا_علی
جب ونڈوز کو فوکس وصول ہو انہیں خودکار اونچا کریں
نئی بننے والی ونڈوز کو خودکار فوکس دیں
فوکس کے لیے _کلک کریں
خاکہ تبدیل کرنے کے لیے بٹن پر کلک کرکے گھسیٹیں
بند کریں
فوکس شدہ ونڈو کی اونچائی سے _پہلے وقفہ:
تاخیر|<i>طویل</i>
تاخیر|<i>مختصر</i>
فا_صلہ:
فاصلہ|<i>چھوٹا</i>
فاصلہ|<i>چوڑا</i>
فوکس _ماؤس کے پیچھے
خفیہ
چھپائیں
ونڈوز کی منتقلی پر اس کا مواد پوشیدہ کریں
ونڈوز کی _ریزنگ پر اس کا مواد چھپائیں
_کیبورڈ
بڑا کریں
مینیو
اطلاقیہ ونڈو کے اندر کلک کرنے پر ونڈو اونچی کریں
مدافعت|<i>چھوٹا</i>
مدافعت|<i>چوڑا</i>
شیڈ
ونڈوز دیگر ونڈوز کی طرف سنیپ کریں
ونڈوز سکرین _بارڈر کی طرف سنیپ کریں
چسپاں
عنوان پٹی پر دہرا کلک کرنے پر ادا ہونے والی حرکت
ونڈو کا عنوان حذف نہیں کیا جاسکتا
عنوان
سکرین کی ونڈو گھسیٹنے _پر مقام کار سمیٹیں
جب پ_ؤائنٹر سکرین کے کناروں تک پہنچے مقام کار کو سمیٹیں
ونڈو کا فوکس لینے سے پہلے _وقفہ:
ک_ناروں کی مدافعت:
_فوکس
طے شدہ پر _بحال کریں
_انداز
ونڈو شیڈ
ونڈو چھپائیں
ونڈو بڑی کریں
ونڈو بھریں
کچھ نہیں
بائیں
درمیان
دائیں
ونڈو آپریشن مینیو
اوپر
نیچے
مسترد
ونڈوز سائکل
ونڈوز چکر (عکسی)
ونڈو بند کریں
ونڈو افقی طور پر بڑی کریں
ونڈو عمودی طور پر بڑی کریں
ونڈو منتقل کریں
ونڈو ری سائز کریں
ونڈو چسپاں کریں
بڑی ونڈو
چھوٹی ونڈو
ونڈو افقی طور پر بھریں
ونڈو عمودی طور پر بھریں
اوپر منعکس کریں
فل سکرین منعکس کریں
ونڈو اوپری مقام کار میں منتقل کریں
ونڈو نچلے مقام کار میں منتقل کریں
ونڈو بائیں مقام کار میں منتقل کریں
ونڈو دائیں مقام کار میں منتقل کریں
ونڈو سابقہ مقام کار میں منتقل کریں
ونڈو اگلے مقام کار میں منتقل کریں
ونڈو مقام کار 1 پرمنتقل کریں
ونڈو مقام کار 2 پرمنتقل کریں
ونڈو مقام کار 3 پرمنتقل کریں
ونڈو مقام کار 4 پرمنتقل کریں
ونڈو مقام کار 5 پرمنتقل کریں
ونڈو مقام کار 6 پرمنتقل کریں
ونڈو مقام کار 7 پرمنتقل کریں
ونڈو مقام کار 8 پرمنتقل کریں
ونڈو مقام کار 9 پرمنتقل کریں
ونڈو مقام کار 10 پرمنتقل کریں
ونڈو مقام کار 11 پرمنتقل کریں
ونڈو مقام کار 12 پرمنتقل کریں
ڈیسک ٹاپ ظاہر کریں
اوپری مقام کار
نچلا مقام کار
بائیں مقام کار
دائیں مقام کار
سابقہ مقام کار
اگلا مقام کار
مقام کار 1
مقام کار 2
مقام کار 3
مقام کار 4
مقام کار 5
مقام کار 6
مقام کار 7
مقام کار 8
مقام کار 9
مقام کار 10
مقام کار 11
مقام کار 12
مقام کار شامل کریں
نزدیکی مقام کار شامل کریں
آخری مقام کار حذف کریں
فعال مقام کار حذف کریں
تھیم
حرکت
شارٹ کٹ
xfconf کو چلانے میں ناکامی. وجہ: %s
ترتیبات ڈائیلاگ نہیں بنایا جاسکتا.
طے شدہ پر بحال کریں
یہ شارٹ کٹس کو ان کی طے شدہ قدروں پر بحال کردے گا. کیا آپ واقعی ایسا کرنا چاہتے ہیں؟
<i>معتم</i>
<i>شفاف</i>
_فوکس چوری ممانعت فعال کریں
سکرین کے _وسط میں
طے شدہ طور پر، ونڈوز رکھیں:
کمپ_وزیٹر
سائکلن_گ
تمام مقام کاروں پر ونڈوز کے درمیان چکر
براہ راست فل سکرین اوورلے ونڈو ظاہر کریں
کچ_ھ نہ کریں
بڑا کرنے پر ونڈوز کے _فریم چھپائیں
اعزام معیاری ICCCM فوکس ہنٹ
ارجنٹ ونڈو کی تکراری بلنکنگ باقی رکھیں
ونڈوز کو پک_ڑنے اور منتقل کرنے کا بٹن:
ونڈوز کی ڈیکوریشن چمکا کر اضطراری حالت سے متنبہ کریں
ونڈوز ڈیکوریشن کی ک_ثافت:
_غیر فعال ونڈوز کی کثافت:
پوپ اپ ون_ڈوز کی کثافت:
_منتقل کرتے وقت ونڈوز کی کثافت:
حجم تب_دیل کرتے وقت ونڈوز کی کثافت:
ونڈوز منتقل کرتے وقت ان کا اصل _حجم برقرار رکھیں
_ڈوک ونڈوز کے ذیل میں سایہ ظاہر کریں
_سادہ ونڈوز کے ذیل میں سایہ ظاہر کریں
پ_وپ اپ ونڈوز کے ذیل میں سایہ ظاہر کریں
حجم|<i>بڑا</i>
حجم|<i>چھوٹا</i>
ونڈو_ز مقام کار پر منتقل ہوں
ماؤس _پؤائنٹر کے ذیل میں
ونڈو سنیپنگ کی بجائے _کنارہ مدافعت استعمال کریں
مقام کاروں کے درمیان منتقلی کے لیے ڈیسک ٹاپ پر _ماؤس کا پہیہ استعمال کریں
جب ونڈو خود کو raises کرے:
اصل ڈیسک ٹاپ _خاکہ کے مطابق مقام کار سمیٹیں
جب _پہلا یا آخری مقام کار تمام ہو مقام کار سمیٹیں
_قابلیتِ رسائی
ونڈو حالیہ ڈیسک ٹاپ پر _لائیں
منتخب کردہ ونڈوز کی سائکلنگ کے دوران اس کے گرد فری_م بنائیں
_ڈسپلے کمپوزیٹنگ فعال کریں
_بشمول خفیہ (مثلاً iconified) ونڈوز
ونڈوز کا کم سے کم حجم:
_پلیسمنٹ
جب ماؤس کا کوئی بھی بٹن دبایا جائے ونڈوز _ریز کریں
سابقہ مقام کار _یاد رکھیں اور اسے پھر بلائیں
جب کیبورڈ شارٹ کٹ سے منتقلی انجام دی جائے
وہ ونڈوز ن_ظر انداز کریں جو "skip pager"
یا "skip taskbar" خصوصیات سیٹ رکھتی ہیں
_مقام کار
<b>مارجن</b>
<b>مقام کار</b>
مقام کار کا نام تبدیل کریں
مارجن سکرین کے کناروں کا علاقہ ہے جہاں کوئی ونڈو نہیں رکھی جاسکتی
_نام:
مقام کاروں کی _تعداد:
%s (پر %s)
%s: تقسیم نقص
ب_ڑا کریں
_بڑا کریں
_چھوٹا کریں
ت_مام دیگر ونڈوز منمائز کریں
_ظاہر کریں
_منتقل کریں
_دوبارہ حجم دیں
ہمیشہ آگے
بالکل دیگر ونڈوز کی طرح
ہمیشہ دیگر ونڈوز کے نیچے
ونڈو اوپر رول کریں
ونڈو نیچے رول کریں
_فُل سکرین
فل س_کرین چھوڑیں
سیاق _ہدایات
ہمیشہ ظاہری مقام کار پر
صرف اسی مقام کار پر
دوسرے مقام کار پر منتقل کریں
_بند کریں
تباہ کریں
_برخاست
دوبارہ چلائیں
%s: GtkMenu پوائنٹر پکڑنے میں ناکام ہوگیا

%s: رنگ مختص نہیں کیا جاسکتا %s

%s: رنگ مختص نہیں کیے جاسکتے: رنگوں کی جی قدر نوعیت ڈورے کی نہیں ہے
%s: رنگ کا تجزیہ نہیں ہوسکا %s

%s: رنگ بیان نہیں کیے جاسکتے: رنگوں کی جی قدر نوعیت ڈورا نہیں ہے
چائلڈ عمل کاری سے مواد پڑھنے میں غلطی: %s

امدادی ڈائیلاگ سپاؤن نہیں کیا جاسکتا: %s

کیا آپ فائل '%s' کی تبدیلیاں محفوظ کرنا چاہتے ہیں؟
میں تبدیل نہیں ہوسکتا '%s' کوڈ سیٹ
پائپ پراسیس نہیں کھولا جاسکتا
اردو ترجمہ از محمد علی مکی
%s کی بابت
لکھنے کے لیے فائل نہیں کھولی جاسکتی
فائل نہیں لکھی جاسکتی
فونٹ
/_فائل
/فائل/_نیا
/فائل/نئی ونڈ_و
/فائل/_کھولیں...
/فائل/حالیہ کھ_ولیں
/فائل/_محفوظ کریں
/فائل/محفوظ ب_نام...
/فائل/_طباعت...
/فائل/_برخاست
/_تدوین
/تدوین/_تنسیخ عمل
/تدوین/_عمل
/تدوین/_کٹ
/تدوین/_کاپی
/تدوین/_پیسٹ
/تدوین/_حذف
/تدوین/منتخب ت_مام
/_تلاش
/تلاش/_تلاش...
/تلاش/اگ_لا تلاش کریں
/تلاش/سابقہ تلاش_ کریں
/تلاش/_تبدیل کریں...
/تلاش/_جمپ تا...
/_اختیارات
/اختیارات/_فونٹ...
/اختیارات/_متن سمیٹیں
/اختیارات/_سطر نمبر
/اختیارات/_خودکار توازن
/_ہدایات
/ہدایات/_بابت
تلاش کردہ جملہ نہیں پایا گیا
تبدیل کریں؟
%d الفاظ تبدیل کئے گئے ہیں
تلاش
تلاش ب_رائے:
_ملتا جلتا
بدلیں
بد_لیں بمع:
سب ب_دل دیں
جمپ تا
_جمپ
لائن نمبر:
حالیہ مقام (%s)
دوسرا کوڈ سیٹ
کوڈ سیٹ:
'%s' کی معاونت نہیں ہے
خودکار دریافت
کھولیں
محفوظ بنام
رموز انکوڈنگ:
'%s' پہلے سے موجود ہے. اس کے اوپر لکھ دیا جائے؟
انتباہ. آپ روٹ کا کھاتہ استعمال کر رہے ہیں. نظام کو نقصان پہنچ سکتا ہے.
بلا عنوان
ماؤس پیڈ
سادہ ٹیکسٹ ایڈیٹر
ٹیکسٹ ایڈیٹر
'''دعائے استفتاح''' کو [[ثناء]] بھی کہتے ہیں۔ [[تکبیر تحریمہ]] کہنے کے بعد جب نمازی ہاتھ باندھ کر کھڑا ہو جائے تو '''دعائے استفتاح''' پڑھے۔ [[رسول اکرم]] صلی اللہ علیہ و علی آلہ وسلم اس موقع پر مختلف [[دعا|دعائیں]] پڑھتے اور اللہ سبحانہ و تعالٰی کی حمد، پاکیزگی اور تعریف بیان فرماتے۔ دعائے استفتاح پڑھنا ضروری ہے کیونکہ نماز ٹھیک طرح سے ادا نہ کرنے والے ایک [[صحابی]] کو نماز کا درست طریقہ سکھاتے ہوئے رسول اللہ صلی اللہ علیہ و علی آلہ وسلم نے اس کا حکم دیا تھا اور فرمایا تھا:

{{اقتباس| لَا تَتِمُّ صَلَاةٌ لِأَحَدٍ مِنْ النَّاسِ حَتَّى يَتَوَضَّأَ فَيَضَعَ الْوُضُوءَ يَعْنِي مَوَاضِعَهُ ثُمَّ يُكَبِّرُ وَيَحْمَدُ اللَّهَ جَلَّ وَعَزَّ وَيُثْنِي عَلَيْهِ وَيَقْرَأُ بِمَا تَيَسَّرَ مِنْ الْقُرْآنِ <ref>
[[سنن ابی داؤد]] کتاب الصلاۃ باب صلاۃ من لا یقیم صلبہ فی الرکوع و السجود، صحیح سنن ابی داؤد حدیث نمبر 857</ref>

لوگوں میں سے کسی کی نماز اس وقت تک مکمل نہیں ہوتی جب تک وہ اچھی طرح [[وضو]] کر کے تکبیر تحریمہ نہ کہے اور جب تک اللہ تعالیٰ کی حمد و ثناء اوربڑائی بیان نہ کرے اور جتنا قرآن آسانی سے پڑھ سکتا ہے وہ نہ پڑھ لے۔}}

== دعائے استفتاح کیلئے منقول دعائیں ==
درج ذیل دعاؤں میں سے کوئی بھی دعا اس موقع پر پڑھی جا سکتی ہے۔ ان میں سے بعض دعاؤں کو [[نبی کریم]] صلی اللہ علیہ وعلی آلہ وسلم نفل نمازوں میں پڑھا کرتے تھے۔انہیں فرض نماز میں پڑھنا بھی اگرچہ جائز ہے لیکن [[امام]] کو [[جماعت]] کرواتے وقت لمبی دعائیں پڑھنے سے اجتناب کرنا چاہیے تا کہ [[مقتدی|مقتدیوں]] پر مشقت نہ ہو۔

====پہلی دعا====
{{اقتباس|أَللّٰهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَّ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ أَللّٰهُمَّ نَقِّنِيْ مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ أَللّٰهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ 
(صحیح البخاری کتاب الاذان باب ما یقول بعد التکبیر، صحیح مسلم کتاب المساجد باب ما یقال بین تکبیرۃ الاحرام و القراءۃ، <ref>[[سنن نسائی]] حدیث نمبر1039، ارواء الغلیل حدیث8۔ متن میں مذکور الفاظ سنن نسائی کے ہیں</ref>


اے [[اللہ]]! میرے اور میری خطاؤں کے درمیان دوری ڈال دے جیسے تو نے [[مشرق]] اور [[مغرب-سمت|مغرب]] کے درمیان دوری رکھی ہے۔ اے اللہ! مجھے خطاؤں سے اس طرح پاک کر دے جیسے سفید کپڑا میل سے پاک کیا جاتا ہے ۔ اے اللہ! میری خطائیں (اپنی مغفرت کے )پانی، برف اور اولوں سے دھو ڈال۔}}

[[رسول اللہ]] صلی اللہ علیہ و علی آلہ وسلم اس دعا کو فرض نمازوں میں پڑھا کرتے تھے

====دوسری دعا====
{{اقتباس|وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا مُسْلِمًا وََّمَا أَنَا مِنْ الْمُشْرِكِينَ ۔ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ ۔ لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ ۔ اللَّهُمَّ أَنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أَنْت ۔ سُبْحَانَكَ وَبِحَمْدِكَ ۔ أَنْتَ رَبِّي وَأَنَا عَبْدُكَ ۔ ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعًا إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ ۔ وَاهْدِنِي لِأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ ۔ وَاصْرِفْ عَنِّي سَيِّئَهَا لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ ۔ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ كُلُّهُ فِي يَدَيْكَ وَالشَّرُّ لَيْسَ إِلَيْكَ ۔ ۔وَالْمَهْدِيُّ مَنْ هَدَيْتَ ۔ أَنَا بِكَ وَإِلَيْكَ ۔ لَا مَنْجَا وَلَا مَلْجَأ مَنْكَ إِلَّا إِلَيْكَ ۔ تَبَارَكْتَ وَتَعَالَيْتَ ۔ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ <ref>[[صحیح مسلم]] صلاۃ المسافرین و قصرھا باب الدعاء فی صلاۃ اللیل و قیامہ، مسند احمد، صحیح ابن حبان، مستخرج ابی عوانۃ، السنن الکبرٰی للنسائی۔ یہاں تمام روایات کے الفاظ جمع کرکے بیان کیے گئے ہیں</ref>


میں نے یکسو اور فرمانبردار ہو کر اپنا چہرہ اس ذات کی طرف کیا جس نے آسمانوں اور زمین کو پیدا کیا اور میں مشرکوں میں سے نہیں ہوں۔ بلاشبہ میری [[نماز]]، میری [[قربانی]]، میرا جینا، میرا مرنا [[اللہ]] [[رب العالمین]] کے لیے ہے۔اس کا کوئی شریک نہیں۔ مجھے اسی کا حکم دیا گیا ہے اور میں سب سے پہلے اللہ کے سامنے سر تسلیم خم کرنے والوں میں سے ہوں۔ اللہ! تو [[بادشاہ]] ہے تیرے سوا کوئی سچا اور حقیقی [[معبود]] نہیں۔ تو [[پاک]] اور [[حمد]] کے لائق ہے۔ تو میرا [[رب]] ہے اور میں تیرا [[بندہ]] ہوں (یعنی تیرے سوا میں کسی کی عبادت نہیں کرتا)۔ میں نے اپنی جان پر ظلم کیا، اپنے گناہوں کا اعتراف کرتا ہوں، تو میرے سارے [[گناہ]] معاف فرما دے۔تیرے سوا کوئی نہیں جو گناہوں کو معاف کر سکے۔ مجھے اچھے [[اخلاق]] کی توفیق عطا فرما، تیرے سوا کوئی بھی اس کی توفیق نہیں دے سکتا۔اور مجھ سے برے اخلاق کو دور رکھ، تیرے سوا ان کو دور رکھنے والا بھی کوئی نہیں۔اللہ! میں (تیرے دربار میں) حاضر ہوں تمام بھلائیاں تیرے ہاتھ میں ہیں ۔ اور شرکی نسبت تیری طرف نہیں کی جا سکتی ۔ جسے تو [[ہدایت]] عطا فرما دے حقیقت میں وہی ہدایت یافتہ ہے۔ میں تیرے ساتھ ہوں اور تیری طرف ہی میرا لوٹنا ہے۔ تجھ سے بھاگ کر نجات پانے اور پناہ ڈھونڈنے کی کوئی جگہ سوائے تیرے ہی پاس ہونے کے کہیں اور کوئی نہیں ہے۔ تیری ذات بابرکت اور بلند و بالا ہے۔ میں تجھ سے [[مغفرت]] کا طلب گار ہوں اور تیری طرف رجوع کرتا ہوں}}

====تیسری دعا====
{{اقتباس|سُبْحَانَكَ اللّٰهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرَكَ۔ <ref>[[سنن ابی داؤد]] کتاب الصلاۃ باب من رأی الاستفتاح بسبحانک اللھم و بحمدک حدیث عائشۃ رضی اللہ عنہا، صحیح سنن ابی داؤد حدیث نمبر 776</ref>

اے اللہ! تو پاک ہے،( ہم )تیری حمد کے ساتھ (تیری پاکیزگی بیان کرتے ہیں)۔ تیرا نام بڑی برکت والا ہے اور تیری بزرگی بلند ہے۔ اور تیرے سوا کوئی سچا معبود نہیں ہے}}


رسول اللہ صلی اللہ علیہ و علی آلہ وسلم نے فرمایا:

{{اقتباس|إن أحب الكلام إلى الله أن يقول العبد سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غير<ref>سلسلۃ الاحادیث الصحیحۃ 2598۔ سنن نسائی</ref>

اللہ تعالیٰ کے ہاں پسندیدہ ترین کلام یہ ہے کہ بندہ کہے سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك }}

یہ دعا مقبول عام ہے اور مسلمانوں کی اکثریت اسی دعا کو ثناء میں پڑھتی ہے۔ 

====چوتھی دعا====
{{اقتباس|سُبْحَانَكَ اللّٰهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرَكَ ۔ لَا إِلَهَ إِلَّا اللَّهُ ۔ لَا إِلَهَ إِلَّا اللَّهُ ۔ لَا إِلَهَ إِلَّا اللَّهُ ۔ اللَّهُ أَكْبَرُ كَبِيرًا ۔ اللَّهُ أَكْبَرُ كَبِيرًا ۔ اللَّهُ أَكْبَرُ كَبِيرًا <ref>سنن ابی داؤد کتاب الصلاۃ باب من رأی الاستفتاح بسبحانک اللھم و بحمدک، صحیح سنن ابی داؤد حدیث نمبر 775</ref>


اے اللہ! تو پاک ہے،( ہم )تیری حمد کے ساتھ (تیری پاکیزگی بیان کرتے ہیں)۔ تیرا نام بڑی برکت والا ہے اور تیری بزرگی بلند ہے۔ اور تیرے سوا کوئی سچا اور حقیقی معبود نہیں ہے، اللہ کےسوا کوئی سچا اور حقیقی معبود نہیں ہے، اللہ کےسوا کوئی سچا اور حقیقی معبود نہیں ہے، اللہ کےسوا کوئی سچا اور حقیقی معبود نہیں ہے۔اللہ بہت بڑا ہے سب سے بڑا، اللہ بہت بڑا ہے سب سے بڑا، اللہ بہت بڑا ہے سب سے بڑا۔}}

نبی کریم صلی اللہ علیہ و علی آلہ وسلم یہ دعا رات کی نفلی نماز میں پڑھتے تھے۔

====پانچویں دعا====
{{اقتباس|اللَّهُ أَكْبَرُ كَبِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا ۔ <ref>[[صحیح مسلم]] المساجد و مواضع الصلاۃ باب ما یقال بین التکبیرۃ الاحرام و القراءۃ</ref>


اللہ سب سے بڑا ہے۔ بہت بڑا۔ اس کے لیے حمد و شکر ہے بہت زیادہ۔ وہ (ہر [[عیب]] سے) پاک ہے۔ صبح و شام ہم اس کی پاکیزگی بیان کرتے ہیں}}


ایک [[صحابی]] نے ان کلمات سے نماز کا آغاز کیا تو نبی صلی اللہ علیہ و علی آلہ وسلم نے فرمایا:

{{اقتباس|عَجِبْتُ لَهَا فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ ۔ <ref>[[صحیح مسلم]] المساجد و مواضع الصلاۃ باب ما یقال بین التکبیرۃ الاحرام و القراءۃ</ref>

اِن الفاظ کو (اللہ کی طرف سے اتنا )پسند کیا گیا کہ ان کے لیے [[آسمان]] کے دروازے کھول دیے گئے}}

====چھٹی دعا====
{{اقتباس|الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ <ref>[[صحیح مسلم]] المساجد و مواضع الصلاۃ باب ما یقال بین التکبیرۃ الاحرام و القراءۃ</ref>


تمام تعریف اور حمد اللہ کے لیے ہے، بکثرت ، پاکیزہ اور برکت دی گئی (حمد اور تعریف)۔}}


ایک صحابی نے ان کلمات کے ساتھ اپنی نماز کا آغاز کیا تو رسول اللہ صلی اللہ علیہ و علی آلہ وسلم نے فرمایا:
{{اقتباس|لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا أَيُّهُمْ يَرْفَعُهَا <ref>صحیح مسلم المساجد و مواضع الصلاۃ باب ما یقال بین التکبیرۃ الاحرام و القراءۃ</ref>

میں نے بارہ [[فرشتے|فرشتوں]] کو دیکھا جو اس کوشش میں تھے کہ کون پہلے ان الفاظ کواوپر (اللہ سبحانہ و تعالیٰ کی بارگاہ میں لے جانے کے لیے) اُٹھاتا ہے۔}}

====ساتویں دعا====
{{اقتباس|أَللّٰهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَنْ فِيْهِنَّ وَلَكَ الْحَمْدُ أَنْتَ الْحَقُّ وَوَعْدُكَ حَقٌّ وَقَوْلُكَ حَقٌّ وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ وَالنَّبِيُّونَ حَقٌّ وَمُحَمَّدٌ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ وَعَلَيْكَ تَوَكَّلْتُ وَبِكَ آمَنْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ أَنْتَ رَبُّنَا وَإِلَيْكَ الْمَصِيْرُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَنْتَ أَعْلَمُ بِهٖ مِنِّيْ أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ أَنْتَ إِلٰهِیْ لَا إِلَهَ إِلَّا أَنْتَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِكَ <ref>[[صحیح بخاری]] کتاب التوحید باب قول اللہ تعالیٰ و ھو الذی خلق السماوات والارض، [[صحیح مسلم]] صلاۃ المسافرین و قصرھا باب الدعاء فی صلاۃ الیل و قیامہ، ابو عوانہ، ابو داؤد، وابن نضر، وا لدارمی۔ یہاں امام البانی نے ان تمام روایات میں مذکور الفاظ کو جمع کر دیا ہے</ref>


اے اللہ! حمد وشکر تیرے ہی لیے ہے۔ تو نور ہے آسمانوں اور زمین کا اور ان کے درمیان جو کچھ ہے ان کا بھی۔حمد و شکرتیرے لیے ہے تو قائم رکھنے والا ہے۔ آسمانوں اور زمین کو اور ان کے درمیان جو کچھ ہے اس کو بھی۔ اور حمد و شکر تیرے ہی لیے ہے، تو رب ہے آسمانوں اور زمین کا اور ان کے درمیان جو کچھ ہے ان کا بھی۔اور تیرے لیے حمد و شکر ہے، تیری ذات برحق ہے، تیرا وعدہ سچا ہے، تیری باتیں حق ہیں، ([[قیامت]] کے دن) تیری ملاقات حق ہے، [[جنت]] اور [[جہنم]] برحق ہیں، [[انبیاء]] برحق تھے اور [[محمد]] (صلی اللہ علیہ و علی آلہ وسلم) برحق (سچے [[نبی]])ہیں، قیامت (کا آنا) برحق ہے۔ اے اللہ! میں نے خود کو تیرا مطیع کر دیا، میں تجھ پر [[ایمان]] لایا، تجھ پر [[توکل]] کیا، تیری ہی طرف میں رجوع کرتا ہوں، تیری ہی مدد سے میں جھگڑا کرتا ہوں اورتیرے ہی فیصلے کا طلبگار رہتا ہوں۔ پس تو میرے اگلے ،پچھلے، پوشیدہ اور ظاہر تمام گناہوں کو معاف فرما دے۔ تو ہی [[اول]] ہے تو ہی [[آخر]] ہے، تو ہی میرا معبود ہے، تیرے سوا کوئی سچا اور حقیقی معبود نہیں اور [[نیکی]] کرنے اور [[برائی]] سے بچنے کی طاقت (عطا کرنا بھی) تیرے سوا کسی کے بس میں نہیں۔}}


نبی کریم صلی اللہ علیہ و علی آلہ وسلم یہ دعا رات کے نوافل میں پڑھا کرتے تھے۔ 

====آٹھویں دعا====
{{اقتباس|اللَّهُمَّ رَبَّ جَبْرَائِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنْ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ <ref>[[صحیح مسلم]] صلاۃ المسافرین و قصرھا باب الدعاء فی صلاۃ الیل و قیامہ</ref>


اے اللہ! [[جبرائیل]]، [[میکائیل]] اور [[اسرافیل]] کے رب! آسمانوں اور زمین کو پیدا کرنے والے! پوشیدہ اور ظاہر کو جاننے والے! تو ہی اپنے بندوں کے درمیان اس چیز کا فیصلہ کرے گا جس میں وہ اختلاف کرتے رہے ہیں۔ [[حق]] کے بارے میں جو اختلاف کیا گیا ہے اس میں مجھے اپنے حُکم سے (درست بات کی) ہدایت عطا فرما، بے شک تو جس کو چاہتا ہے سیدھے راستے کی طرف ہدایت دے دیتا ہے۔}}

====نویں دعا====
بعض دفعہ نبی کریم صلی اللہ علیہ و علی آلہ وسلم رات کی نفل نماز میں تکبیر تحریمہ کہنے کے بعد دس دفعہ [[اللہ اکبر]]، دس دفعہ [[الحمد للہ]]، دس دفعہ [[سبحان اللہ]]، دس دفعہ [[لا الٰہ الا اللہ]] اور دس دفعہ [[استغفر اللہ]] کہتے پھر دس دفعہ ہی یہ دعا فرماتے:

{{اقتباس|أَللّٰهُمَّ اغْفِرْ لِيْ وَاهْدِنِيْ وَارْزُقْنِيْ وَعَافِنِيْ <ref>صحیح سنن ابی داؤد حدیث نمبر 1356، مسند احمد، مصنف ابن ابی شیبۃ</ref>

اللہ! میری [[مغفرت]] فرمادے، مجھے ہدایت دے اور مجھے [[رزق]] اور [[عافیت]] عطا فرما}}

پھر دس مرتبہ یہ دعا فرماتے تھے:

أَ{{اقتباس|للّٰهُمَّ إِنِّيْ أَعُوذُ بِكَ مِنَ الضِّيْقِ يَوْمَ الْحِسَابِ <ref>ایضاً</ref>

"اللہ! میں تجھ سے تیری [[پناہ]] مانگتا ہوں قیامت کے دن کی تنگی سے "

====دسویں دعا====
رات کی نفلی نمازشروع کرنے کا ایک اور طریقہ جو سنت مطہرہ سے ملتا ہے یہ ہے کہ تین دفعہ اَللہُ أَ کْبَر کہ کر درج ذیل دعا پڑھی جائی:

{{اقتباس|ذُو الْمَلَكُوتِ وَالْجَبَرُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ  <ref>[[سنن ابی داؤد]] کتاب الصلاۃ باب ما یقول الرجل فی رکوعہ و سجودہ، صحیح سنن ابی داؤد حدیث نمبر 874، و رواہ الطیالسی ایضا</ref>


([[اللہ]]) [[بادشاہت]]، [[غلبہ]]، [[کبریائی]] اور [[عظمت]] کا [[مالک]] (ہے)۔}}

== مزید دیکھئے ==
* [[نماز]]

== حوالہ جات ==
{{حوالہ جات}}

[[زمرہ:نماز]]
[[زمرہ:دعائیں]][[تصویر:Jean Paul Sartre.jpg|framepx|thumb|left|ژاں پال سارتر]]پیدائش: 21 جون 1905ء

انتقال:15 اپریل 1980ء


== ابتدائی زندگی ==

مشہور فرانسیسی فلسفی۔ژاں پال سارتر پیرس میں پیدا ہوئےتھے۔ ان کے والد بحری فوج میں افسر تھے لیکن ابھی سارتر ایک سال ہی کے تھے کہ ان کے والد کا انتقال ہوگیا اور ان کی پرورش ان کی والدہ نے کی۔ ان کا بچپن اپنے نانا کے گھر میں گذرا جہاں ایک بڑاکتب خانہ تھا جس میں سارے سارے دن سارتر دنیا بھر کے موضوعات کی کتابیں پڑھتے رہتے تھے اور مضامین لکھتے رہتے تھے۔یہی وجہ ہے کہ نوعمری ہی میں انہیں بقول ان کے ادب کے جنون کا مرض لاحق ہوگیا تھا۔ مطالعہ اور تحریر کے اسی جنون کی بدولت سارتر سن ستر کے عشرے میں بینائی سے یکسر محروم ہوگئے۔ 

== تعلیم ==

سارتر نے پیرس کے اعلیٰ تعلمی ادارہ ایکول نارمیل سوپئیریر میں فلسفہ کا مطالعہ کیا۔ اسی دوران ان کی خاتون فلسفی سیمون ڈی بوور سے ملاقات ہوئی جو سن انیس سو اسی میں سارتر کی وفات تک ان کی رفیقہ رہیں۔ 


== قید و بند ==

انیس سو اکتیس سے انیس سو پینتالیس تک سارتر درس وتدریس سے منسلک رہے اور اس دوران انہوں نے مصر، یونان اور اٹلی کے دورے کیے۔ دوسری عالم گیر جنگ کے دوران سارتر کو جرمن فوج نے گرفتار کر لیا اور ایک سال تک جرمنی میں نظر بند رہے۔ قید سے فرار کے بعد انہوں نےفرانس پر جرمنی کے قبضہ کے خلاف مزاحمتی تحریک میں حصہ لیا اور جنگ کے بعد انہوں نے سیمون ڈی بوور کے ساتھ مل کر ’لا تیمپ موردرن‘ یعنی ’عصرِ جدید‘ کے نام سے بائیں بازو کا ایک جریدہ نکالا جو جنگ کے بعد کے دور کے نئے نظریات کا نقیب مانا جاتا ہے۔ 

اس جریدہ میں مشہور فلسفی مارلو پونتی اور البرٹ کامیو کی وہ نگارشات شائع ہوئیں جنہوں نے پچھلی صدی کے وسط میں ایک ایسا فکری انقلاب برپا کیا جس نے انسانی سوچ کی نئی راہیں تراشی ہیں۔


== کامل آزادی کا فلسفہ ==

سارتر کا پہلا ناول ’لا ناوسی‘ یا متلی انیس سو اڑتیس میں شائع ہوا جس کا بنیادی تھیم تھا کہ انسان کی زندگی کا کوئی مقصد نہیں اور نہ کوئی معنی۔ انسان کی اقدار کی واحد بنیاد کامل آزادی ہے۔ انسان اپنے جذبات اور خیالات کا خود خالق ہے اور خود اپنے رویوں کا ذمہ دار ہے۔ 

یہ ناول ان کے فلسفہ موجودیت یا ھستی ’ایگزسٹنشلزم‘ کا نقطہ آغاز تھا۔ جس کو انہوں نے انیس سو تینتالیس میں اپنی تصنیف ’وجود اور عدم ‘ میں مزید فروغ دیا۔

اپنے فلسفہ ہستی کی سارتر نے یہ وضاحت کی کہ گو ہر شخص اپنا وجود رکھتا ہے لیکن کسی دوسرے کو اس کے کردار، اس کی منزل اور اس کی زندگی کی سمت متعین کرنے کا قطعی کوئی حق نہیں۔ یہ حق اور اختیار صرف اسی فرد کو ہی حاصل ہے اور اس حق کے استعمال کی کلی ذمہ داری اسی شخص کو حاصل ہے۔ 

اس فلسفے کا بنیادی مقصد انسان کی کامل آزادی ہے۔ سارتر کے مطابق ناقص عقیدہ ’مووے فوئی‘ خود فریبی ہے کہ ہم یہ سوچ کر اپنے کرب سے نجات حاصل کریں کہ ہم آزاد نہیں اور ہمیں حالات پر کوئی اختیار نہیں۔ یہ بات اپنے آپ کو دھوکہ دینے کے مترادف ہے کہ ہم یہ یقین کر لیں کہ حالات اور زندگی ہمارے کردار، ہمارے روئیے اور طرز عمل کو متعین کرتے ہیں۔ 

غرض سارتر کا استدلال ہے کہ انسان کو اپنی ہستی اور وجود پر غور اور تجسس پر وقت ضائع نہیں کرنا چاہیے بلکہ اپنے وجود کو ایک حقیقت تسلیم کرلینا چاہیے اور اسی کے ساتھ یہ حقیقت بھی کہ انسان آپ اپنا معمار ہے، اپنے کردار کا اور اس کی یہ ذمہ داری ہے کہ وہ آپ اپنی زندگی کی سمت متعین کرے۔ یوں ہم سب آزاد ہیں ، مکمل اور بھر پور طور سے۔

سارتر گو مارکسزم اور سوشلزم کے زبردست حامی تھے لیکن وہ کمیونسٹ پارٹی یا بائیں بازو کی کسی اور جماعت سے وابستہ نہیں رہے۔ البتہ وہ اپنے آپ کو فرانسیسی کمیونسٹ پارٹی کا ’ہم سفر‘ ضرور کہتے تھے۔


== مارکسزم کے زبردست حامی ==

گو سن انیس سو تریپن میں اسٹالن کے انتقال کے بعد انہوں نے سوویت یونین کا دفاع کیا لیکن سویت نظام پر تنقید کے حق کی بھی حمایت کی۔ 

سن انیس سو چھپن میں ہنگری پر سوویت یونین کے حملے کی سارتر نے ڈٹ کر مخالفت کی اور اس کے بعد ہی فرانس کی کمیونسٹ پارٹی سے ان کا فاصلہ بڑھا۔ لیکن سارتر کا کہنا تھا کہ ہمارے دور میں مارکسزم ایک ایسا فلسفہ ہے جس کےآگے جانا ممکن نہیں۔ مارکسزم کا فلسفہ صرف اسی صورت میں انسان کی زندگی سے بے ربط اور بے محل ہوگا جب بنی نوع انسان کی حقیقی آزادی کی بنیاد پر ایک انقلاب برپا ہوگا۔ 

سارتر سن انیس سو اسّی میں اپنے انتقال تک جنگ کے خلاف تحریکوں میں انتہائی سرگرم رہے۔ چاہے وہ الـجزائر میں حریت پسندوں کے خلاف فرانس کی جنگ ہو یا ویت نام میں کمیونسٹوں کے خلاف امریکیوں کی جنگ یا عربوں کے خلاف فرانس، برطانیہ اور اسرائیل کی جنگ ، سارتر ان سب جنگوں کے خلاف مہمات اور مظاہروں میں پیش پیش رہے ہیں۔

انہوں نے انیس سو اڑسٹھ میں فرانس میں طلباء کی بغاوت کی بھی بھر پور حمایت کی۔ 


== ادب کا نوبیل انعام مسترد کردیا ==

سارتر کو سن انیس سو چونسٹھ میں ادب کے نوبیل انعام کی پیشکش کی گئی تھی جسے انہوں نے یہ کہہ کر ٹھکرا دیا تھا کہ ایک ادیب کو اپنے آپ کو ایک ادارہ میں تبدیل کرنے کی اجازت نہیں دینی چاہیے۔ اور اپنی کامل آزادی برقرار رکھنی چاہیے۔

سارتر کی شخصیت تہہ دار تھی۔ وہ دانشور بھی تھے ایک فلسفی بھی۔ ناول نگار اور حیات نویس بھی تھے۔ سیاسی مہمات اور مظاہروں میں بھی پیش پیش تھے۔ پیانو بھی بہت اچھا بجاتے تھے اور اچھے گلو کار ہونے کا ساتھ اچھے باکسر بھی تھے۔

[[زمرہ:شخصیات]]
[[زمرہ:فلسفی]]
[[زمرہ:فرانسیسی شخصیات]]

{{Link FA|hr}}

[[ar:جان بول سارتر]]
[[fa:ژان پل سارتر]]
[[en:Jean-Paul Sartre]]
[[af:Jean-Paul Sartre]]
[[an:Jean-Paul Sartre]]
[[az:Jan Pol Sartr]]
[[bn:জঁ-পল সার্ত্র্‌]]
[[zh-min-nan:Jean-Paul Sartre]]
[[be:Жан-Поль Сартр]]
[[be-x-old:Жан-Поль Сартр]]
[[bs:Jean-Paul Sartre]]
[[br:Jean-Paul Sartre]]
[[bg:Жан-Пол Сартр]]
[[ca:Jean-Paul Sartre]]
[[cs:Jean-Paul Sartre]]
[[cy:Jean-Paul Sartre]]
[[da:Jean-Paul Sartre]]
[[de:Jean-Paul Sartre]]
[[et:Jean-Paul Sartre]]
[[el:Ζαν-Πωλ Σαρτρ]]
[[es:Jean-Paul Sartre]]
[[eo:Jean-Paul Sartre]]
[[eu:Jean-Paul Sartre]]
[[hif:Jean-Paul Sartre]]
[[fr:Jean-Paul Sartre]]
[[fy:Jean-Paul Sartre]]
[[ga:Jean Paul Sartre]]
[[gd:Jean-Paul Sartre]]
[[gl:Jean-Paul Sartre]]
[[ko:장폴 사르트르]]
[[hy:Ժան Պոլ Սարտր]]
[[hi:ज्यां-पाल सार्त्र]]
[[hr:Jean-Paul Sartre]]
[[io:Jean-Paul Sartre]]
[[ilo:Jean-Paul Sartre]]
[[id:Jean-Paul Sartre]]
[[is:Jean-Paul Sartre]]
[[it:Jean-Paul Sartre]]
[[he:ז'אן-פול סארטר]]
[[jv:Jean-Paul Sartre]]
[[ka:ჟან-პოლ სარტრი]]
[[sw:Jean-Paul Sartre]]
[[ku:Jean-Paul Sartre]]
[[la:Ioannes Paulus Sartre]]
[[lv:Žans Pols Sartrs]]
[[lb:Jean-Paul Sartre]]
[[lt:Jean-Paul Sartre]]
[[lmo:Jean-Paul Sartre]]
[[hu:Jean-Paul Sartre]]
[[mk:Жан-Пол Сартр]]
[[ml:ഷാൺ-പോൾ സാർത്ര്]]
[[mr:ज्याँ-पॉल सार्त्र]]
[[arz:چان پول سارتر]]
[[mn:Жан Пол Сартр]]
[[nl:Jean-Paul Sartre]]
[[ja:ジャン＝ポール・サルトル]]
[[no:Jean-Paul Sartre]]
[[nn:Jean-Paul Sartre]]
[[oc:Jean-Paul Sartre]]
[[uz:Jean-Paul Sartre]]
[[pnb:ژاں پال سارتر]]
[[pl:Jean-Paul Sartre]]
[[pt:Jean-Paul Sartre]]
[[ro:Jean-Paul Sartre]]
[[qu:Jean-Paul Sartre]]
[[ru:Сартр, Жан-Поль]]
[[sq:Jean-Paul Sartre]]
[[simple:Jean-Paul Sartre]]
[[sk:Jean-Paul Sartre]]
[[sl:Jean-Paul Sartre]]
[[ckb:ژان پۆڵ سارتەر]]
[[sr:Жан-Пол Сартр]]
[[sh:Jean-Paul Sartre]]
[[fi:Jean-Paul Sartre]]
[[sv:Jean-Paul Sartre]]
[[ta:ஜான் பவுல் சாட்டர்]]
[[th:ฌอง ปอล ซาร์ตร์]]
[[tr:Jean-Paul Sartre]]
[[uk:Жан-Поль Сартр]]
[[vi:Jean-Paul Sartre]]
[[vo:Jean-Paul Sartre]]
[[war:Jean-Paul Sartre]]
[[yo:Jean-Paul Sartre]]
[[zh-yue:薩特]]
[[diq:Jean-Paul Sartre]]
[[bat-smg:Žans Puolės Sartros]]
[[zh:让-保罗·萨特]]اسلامی مہینے [[رمضان]] کی  آخری دس راتوں میں ایک نہائت بابرکت رات کی روایت ملتی ہے جس کے بارے میں [[قرآن|قران]]  میں [[سورۃ القدر]] کے نام سے ایک سورت بھی نازل ہوئی ہے۔ اس رات میں عبادت کرنے کی بہت تاکید ہے۔ بعض روایت کردہ احادیثِ نبوی کے مطابق اس رات کو آخری دس راتوں میں سے طاق راتوں میں تلاش کرنا چاہئے۔


[[زمرہ:اسلامی تہوار]]
[[زمرہ:رمضان]]
[[زمرہ:مقدس راتیں]]

[[ar:ليلة القدر]]
[[fa:شب قدر]]
[[en:Laylat al-Qadr]]
[[az:Qədr gecəsi]]
[[bs:Lejletul kadr]]
[[de:Lailat al-Qadr]]
[[es:Noche del Destino]]
[[fr:Laylat al-Qadr]]
[[id:Lailatul Qadar]]
[[kk:Қадір түні]]
[[hu:Az Elrendelés Éjszakája]]
[[ml:ലൈലത്തുൽ ഖദ്‌ർ]]
[[ms:Lailatul Qadar]]
[[nl:Laylat al-Qadr]]
[[nn:Lailat al qadr]]
[[pt:Laylat al-Qadr]]
[[ru:Ночь предопределения]]
[[simple:Laylat al-Qadr]]
[[sv:Laylat al-Qadr]]
[[tr:Kadir Gecesi]]
[[uk:Аль-Кадр]]
[[diq:Şewa Qedri]]Inferiority Complex
اپنے آپ کا غلط اندازہ لگاتے ہوئےدوسروں کے مقابلے میں خود کو حقیر سمجھنے کو [[نفسیات]] کی اصطلاح میں "احساس کمتری" کہا جاتا ہے۔ اگر کسی موقع پر [[انسان]] کسی خاص چیز سے خوفزدہ ہو جائے تو پھر بھی وہ احساس کمتری کا شکار ہو جاتا ہے۔ نفسیات کے ماہرین انسانی ذہن اور اعصابی بدنظمی کی حالت کو بھی اسی بیماری میں شامل کرتے ہیں۔

احساس کمتری معارشروں اور قوموں کی صورت حال کیلیے بھی استعمال کیا جاتا ہے۔ مثلا{{دوزبر}} یہ کہا جاتا ہے کہ [[امریکہ]] میں وہ آبادی جو [[افریقہ]] سے لائ گئ تھی اس قوم کو ایک تاریخی احساس کمتری یا Inferiority Complex ہے۔ اسٹریلیا میں ثقافتی معانوں میں بھی احساس کمتری کی بات کی جاتی ہے، جس کو Cultural Cringe بھی کہا جاتا ہے۔

[[زمرہ:نفسیاتی امراض]]
[[زمرہ:نفسیات]]

[[fa:عقده حقارت]]
[[en:Inferiority complex]]
[[bg:Комплекс за малоценност]]
[[ceb:Kaikog]]
[[de:Minderwertigkeitskomplex]]
[[et:Alaväärsuskompleks]]
[[es:Complejo de inferioridad]]
[[fr:Sentiment d'infériorité]]
[[id:Rendah diri]]
[[he:תסביך נחיתות]]
[[lt:Nepilnavertiškumo kompleksas]]
[[arz:عقدة النقص]]
[[nl:Minderwaardigheidscomplex]]
[[ja:劣等感]]
[[pl:Kompleks niższości]]
[[pt:Complexo de inferioridade]]
[[ru:Комплекс неполноценности]]
[[sk:Komplex menejcennosti]]
[[sr:Комплекс ниже вредности]]
[[fi:Alemmuuskompleksi]]
[[sv:Mindervärdeskomplex]]
[[tr:Aşağılık kompleksi]]
[[uk:Комплекс меншовартості]][[کشمیر]] کے رہنے والوں کو کشمیری کہا جاتا ہے۔ ان کا تعلق بھارت اور پاکستان دونوں حصوں کے کشمیر سے ہو سکتا ہے۔ اس کے علاوہ ایسے لوگ جو سینکڑوں سالوں سے [[پنجاب]] اور دیگر علاقوں میں آباد ہیں مگر ان کے آباء کشمیر سے تھے انہیں بھی کشمیری کہا جاتا ہے۔ پنجاب میں اسے ایک ذات کے طور پر بھی سمجھا جاتا ہے۔

[[زمرہ:بشریات]]
[[زمرہ:کشمیر]]
[[زمرہ:پاکستان کی زبانیں]][[تصویر:J.M.jpg|framepx|thumb|left|جان میکس ویل کوئٹزی]]پیدائش: 9 فروری 1940

افریقی ادیب اور ناول نگار۔ 2003ء کا ادبی نوبل انعام یافتہ۔ جنوبی افریقہ کے شہر کیپ ٹاؤن میں پیدا ہوئے۔والد ایک وکیل جبکہ والدہ ایک استانی تھیں۔ان کا تعلق ان ڈچ خاندانوں سے ہے جو کہ سترھویں صدی میں جنوبی افریقہ میں آکر آباد ہوئیں۔تعلیم مکمل کرنے کے بعد آئی بی ایم کمپیوٹر کے ساتھ منسلک ہوئے۔ مارچ 2006 انگریزی ادب میں ان کی خدمات کی وجہ سے آسٹریلیا کی شہریت بھی دی گئی۔نوبل انعام ان کی ان صلاحیتوں کے اعتراف کے طور پر دیا گیا ہے جن کے تحت وہ پورے انہماک سے وہ سارے روپ دکھا سکتے ہیں جو وہ خود دیکھ رہے ہوتے ہیں۔

[[زمرہ:افریقی شخصیات]]
[[زمرہ:نثر نگار]]
[[زمرہ:نوبل انعام یافتہ]]

[[ar:جون ماكسويل كويتزي]]
[[fa:جان ماکسول ک‍وت‍س‍ی‌]]
[[en:J. M. Coetzee]]
[[af:J.M. Coetzee]]
[[an:John Maxwell Coetzee]]
[[az:Con Maksvell Kutzee]]
[[bn:জন ম্যাক্সওয়েল কুতসি]]
[[bs:John Maxwell Coetzee]]
[[br:John Maxwell Coetzee]]
[[bg:Джон Максуел Кутси]]
[[ca:John Maxwell Coetzee]]
[[cs:John Maxwell Coetzee]]
[[da:John Maxwell Coetzee]]
[[de:J. M. Coetzee]]
[[et:John Maxwell Coetzee]]
[[el:Τζον Μάξγουελ Κούτσι]]
[[es:J. M. Coetzee]]
[[eo:John Maxwell Coetzee]]
[[eu:John Maxwell Coetzee]]
[[fr:J. M. Coetzee]]
[[gd:J.M. Coetzee]]
[[gl:John Maxwell Coetzee]]
[[ko:존 맥스웰 쿠체]]
[[hi:जाह्न माक्सवेल कोएट्ज़ी]]
[[hr:John Maxwell Coetzee]]
[[io:John Maxwell Coetzee]]
[[id:John Maxwell Coetzee]]
[[is:J. M. Coetzee]]
[[it:John Maxwell Coetzee]]
[[he:ג'ון מקסוול קוטזי]]
[[sw:J. M. Coetzee]]
[[la:Iohannes Maxwell Coetzee]]
[[lv:Džons Maksvels Kutzē]]
[[hu:John Maxwell Coetzee]]
[[nl:John Maxwell Coetzee]]
[[ja:J・M・クッツェー]]
[[no:John Maxwell Coetzee]]
[[oc:John Maxwell Coetzee]]
[[pnb:جان میکسویل کوٹزی]]
[[pl:John Maxwell Coetzee]]
[[pt:J. M. Coetzee]]
[[ro:J.M. Coetzee]]
[[ru:Кутзее, Джон Максвелл]]
[[sq:John Maxwell Coetzee]]
[[sk:John Maxwell Coetzee]]
[[sl:John Maxwell Coetzee]]
[[sr:Džon Maksvel Kuci]]
[[sh:John Maxwell Coetzee]]
[[fi:J. M. Coetzee]]
[[sv:J.M. Coetzee]]
[[ta:ஜே. எம். கோட்ஸி]]
[[th:จอห์น แมกซ์เวล คูตซี]]
[[tr:John Maxwell Coetzee]]
[[uk:Джон Максвелл Кутзее]]
[[vec:John Maxwell Coetzee]]
[[vi:John Maxwell Coetzee]]
[[yo:J. M. Coetzee]]
[[zh:约翰·马克斯维尔·库切]]Chalan

قانونی اصطلاح۔ [[پولیس]] زیر دفعہ 161 ضابطۂ [[فوجداری]] ملزموں کے خلاف گواہوں کے بیان لیتی ہے۔ اور ان کے خلاف کاروائی مکمل کرکے عدالت متعلقہ میں بھیجتی ہے۔ یہی کاروائی چالان کہلاتی ہے۔

[[Category:قانونی اصطلاحات]]سندھ کے معروف صوفی گلوکار . پورا نام فقیر سہراب خاصخیلی تھا. نہوں نے آٹھ برس کی عمر سے صوفیوں کا کلام گانا شروع کیا تھا اور سار ی زندگی یہی کام کیا جو ان کا ذریعہ معاش تو تھا ہی لیکن محبوب مشغلہ بھی تھا۔یہ فن انہیں ورثہ میں ملا ۔ ان کے والد ہمل فقیر خود اپنے وقت کے بڑے گائک تھے اورتھری میر واہ میں مدفون بزرگ شاعر خوش خیر محمد ہسبانی کے مرید تھے۔ کچھ بیٹے کو انہوں نے تربیت دی تو کچھ بیٹے کا شوق جس نے سہراب خاصخیلی کو سہراب فقیر بنا دیا۔سائیں سچل سرمست کا کلام خصوصاً سنگ گانے کا ملکہ حاصل کیا۔  بیرونی ممالک میں اپنے فن کا مظاہر کیا اور برطانیہ ، بھارت، ناروے، سعودی عرب اور دیگر کئی ممالک میں جا کر انہوں نے سامعین سے داد وصول کی . وہ سائیں سچل کے علاوہ حضرت شاہ عبداللطیف بھٹائی، حضرت سلطان باہو، سا ئیں بھلے شاہ اور دیگر شعراء کا کلام بھی گایا کرتے . 23 اکتوبر 2009 کو کراچی کے ایک ہسپتال میں ان کا انتقال ہوا۔

[[Category:گلوکار]]
[[Category:سندھی شخصیات]]
[[Category:صوفی گلوکار]]ابراھیم گاردی مسلمانوں کا ایک سردار اور [[مرہٹہ]] [[فوج]] کا [[توپچی]] تھا۔

اکتوبر 1760 سے جنوری 1761 تک مرہٹوں کی اتحادی افواج مختلف مقامات پر [[ابدالی]] لشکر سے ٹکراتی رہی، مر ہٹوں کی اتحادی افواج میں ابراہیم خان گاردی بھی تھا جو کہ اپنے ساتھ دو ہزار سوار اور 9 ہزار پیدل فوج لایا تھا۔ آخری لڑائی میں مرہٹوں کی اتحادی افواج کا سپہ سالار [[بسواں راوُ]] مارا گیا، ابدالی کے لشکر نے اتحادی لشکر کا قتل عام شروع کر دیا، مرہٹوں کی کمر توڑ دی گئی تو احمد شاہ ابدالی نے تلوار نیام ڈال دی، شکست خوردہ اتحادی افواج کے گرفتار ہونے والے سرداروں اور فوجیوں میں گیارہ ہزار فوجی مہیا کرنے والا مسلمان سردار ابراہیم خان گاردی بھی شامل تھا۔ جب اسے فاتح بادشاہ کے سامنے پیش کیا گیا تو احمد شاہ ابدالی نے نفرت آمیز لہجے میں اس سے پوچھا ، کہو خان صاحب کیا حال ہے ؟ کس طرح تشریف آوری ہوئی ؟ ابراہیم گاردی نے کہا ، میں ایک جاں فروش سپاہی ہوں، حضور جان بخشی کرینگے تو اسی طرح حق نمک ادا کرونگا، نفرت اور غصے سے احمد شاہ ابدالی کا چہرہ سرخ ہو گیا ّ گاردی ! جاں فروشوں کی جان بخشی تو ہو سکتی ہے لیکن ایمان فروش دنیا میں رہنے کے قبل نہیں ہوتے ّ یہ تاریخی جملہ کہنے کے بعد احمد شاہ ابدالی نے حکم دیا ” اس ایمان فروش کو میری آنکھوں سے دور کر کے صفحہ ہستی سے مٹا دیا جائے ” پوری ذمہ داری سے حکم کی تعمیل کر دی گئی۔

== بیرونی روابط ==
* [http://pakiez.com ایمان فروشی]

[[زمرہ:مسلم شخصیات]]مراقبہ ، جس کی انگریزی عام طور پر meditation کی جاتی ہے اور اگر اسی متبادل کو ہم پلہ براۓ لفظ{{زیر}} مروجہ [[عربی]] ، [[فارسی]] اور [[اردو]] تسلیم کر لیا جاۓ تو پھر مراقبہ کی تعریف یوں کی جاسکتی ہے کہ ؛ مراقبہ ایک ایسی [[عقلی]] [[تادیب]] (discipline) کا نام ہے کہ جس میں کوئی شخصیت ماحول کے روابطِ حیات سے ماوراء ہو کر افکارِ عمیق کی حالت میں چلی جاۓ اور اندیشہ ہاۓ دوئی سے الگ ہوکر  سکون و [[فہم|فہم (awareness)]] کی جستجو کرے۔ یعنی یوں بھی کہہ سکتے ہیں کہ فکرِ آلودہ سے دور ہوکر فکرِ خالص کا حصول مراقبہ کہلاتا ہے۔ meditation کو تاریخ اسلام کے پس منظر میں دیکھا جاۓ تو لفظ مراقبہ کا درست متبادل تسلیم نہیں کیا جاسکتا، اسلام میں آج کے دور میں meditation میں شامل مختلف طریقہ ہاۓ کار کا کوئی تصور نہیں ہے؛ عبادت میں خشوع و خصوع ہی اصل میں درست طور پر وہ طریقۂ کار ہے کہ جس کی اسلام میں وضاحت ملتی ہے۔ عبادت میں توجہ اور خشوع و خصوع کے علاوہ کسی دیگر طریقے سے مراقبہ کو اسلام کا جزء نہیں کہا جاسکتا۔ 
== اصل الکلمہ ==
مراقبہ ، عربی لفظ رقب کی [[اصل الکلمہ]] سے مشتق لفظ ہے جس کے معنی بنیادی طور پر دیکھنے، توجہ دینے وغیرہ کے آتے ہیں اور اسی سے اردو میں راقب اور رقیب کے الفاظ بھی ماخوذ کیۓ جاتے ہیں<ref>ایک موقع [[روۓ خط]] پر [http://www.urbandictionary.com/define.php?term=Muraqba لفظ مراقبہ کی اصل الکلمہ]</ref>۔ مراقبہ کا لفظ اس اصل الکلمہ کے اعتبار سے اپنے ذہن کی گہرائیوں میں دیکھنے یا اپنی عقل کو دیکھنے کے قابل بنانے کے تصور میں لیا جاسکتا ہے۔ 
== وضاحت ==
مراقبہ انسان کا اپنی [[خودی]] ([[self]]) یا ذات میں گہرائی کی طرف ایک سفر ہے جس سے انسان اپنے اندر ([[باطنیت|باطن]]) میں اپنا [[فہم|اصلی گھر (awareness of self)]] یا فکر و سوچ کا ایک خاص مقام تلاش کر سکتا ہے۔ مراقبہ چونکہ [[ذہن]] کی ایک [[نفسیاتی]] کیفیت ہے اور اس کا انسانی [[شعور|شعور (consciousness)]] سے گہرا اور براہ راست تعلق ہوتا ہے، اس لیۓ کسی بھی رنگ و نسل سے تعلق اور تعلیم یافتہ و غیر تعلیم یافتہ ہونے کی مراقبہ میں کوئی قید نہیں ہے گویا مراقبہ سب کے لئے ایک جیسا فکری عمل ہے۔ مراقبہ ، مراقب (شخصیت) کی توجہ اس کے باطن (ماحول کے اثرات سے دور یکسوئی) کی طرف لے جانے کا موجب بنتا ہے اور اس طرح یکسوئی سے کی جانے والی فکر کے دوران انسان کی توجہ چونکہ مختلف خیالات میں بکھرے اور بھٹکے ہوۓ شعور (conscious) سے الگ ہوکر کسی ایک بات پر یکسوئی سے مرتکز ہو جاتی ہے لہ{{ا}}ذا ذہنی و نفسیاتی طور پر انسان ایک قسم کی حالت{{زیر}} سکون پہ مقیم ہو جاتا ہے۔ اس بات کو یوں بھی سمجھا جاسکتا ہے کہ مراقبے سے انسان کی توجہ؛ مختلف خیالات میں منتشر شعور (مجازی مراکز) کے بجاۓ کسی ایک فکر پر مرتکز شعور (حقیقی مرکز) سے مربوط ہو جاتی ہے ۔ اگر تمام دنیاوی خیالات سے الگ ہوکر محض عبادت پر توجہ کی جائے تو عبادت میں خشوع و خضوع حاصل ہوتا ہے جس سے انسان مادی تصورات سے جدا ہوکر دینی علم میں اضافہ کر سکتا ہے اور کم از کم اسلام میں اسے خاص طور پر مراقبہ کے نام سے تعبیر نہیں کر سکتے ہیں کیونکہ یہ دنیاوی خیالات سے دور رہ کر خود کو [[اللہ]] کے سپرد (عبادت میں مشغول) کر دینے کی کیفیت ہے، عبادت میں طاری اس ذہنی کیفیت کو لغتی معنوں مراقبہ ہی کہیں گے لیکن اسلام میں مراقبہ (اپنے رائج تصور میں) نا تو عبادت کا حصہ ہے اور نا ہی عبادت کے لیۓ لازم ہے۔ اس کے برعکس ایسے مذاہب بھی ہیں کہ جن میں مراقبہ کو ایک مرکزی حیثیت حاصل ہے، جیسے [[بدھ مت]] اور [[ہندو مت]] وغیرہ۔ ۔حقیقی مراقبہ کا راز صرف ذہنی تصور (imagination)  کے ساتھ منسلک ہے اور اس تصور سے مراد مراقبے کی ابتدائی اور انتہائی سطحوں پر شعور میں بیدار افکار سے ہوتی ہے۔ مراقبہ نفسیاتی علم کی وہ قسم ہے جو انسان کی شخصیت ، [[روح]] اور [[خودی|ذات]] کو آپس میں یکجا کر دے اور ان سب کو ایک نقطہ سے مربوط کر کے کثرت و دوئی سے آزادی کا احساس پیدا کر دے ۔ مراقبہ ، ظاہری زندگی کے مستقل نہ ہونے کا احساس پیدا کرتا ہے اور زندگی کی حقیقت کو قریب سے سمجھنے اور اسکی ظاہری نا پائداری کے احساس کو اجاگر کرتا ہے۔ مراقبہ کو ایک ذہنی ورزش کا نام دے سکتے ہیں جس کے باعث وقت گزرنے کے ساتھ ساتھ اس کے اثرات نمایاں ہوتے چلے جاتے ہیں، جتنا زیادہ اس عمل (مشق / ریاض) کو کیا جائے اتنی زیادہ اس میں مہارت حاصل ہو گی۔

== '''مراقبہ کا عمل اور تاریخ انسانی''' ==
{{صفائی نو لکھائی}}
اس زمین پر ظہور انسانی سے ہر دور کے لوگو ں کا چند اکے سوالات سے واسطہ پڑتا رہا ہے جیسا کہ اس کائنات کا بنانے والا کون ہے ۔؟زمین پر زندگی کا آغاز کسیے ہوا ۔؟ زندگی کا مقصد کیا ہے ۔؟ہم کیوں پیدا ہوئے اور کیو ں مر جاتے ہیں۔؟آیا ان سب معا ملات کے پس پردہ کو ئی باقاعدہ منصوبہ بندی ہے یا پھر سارا عمل خود بخود ہو رہا ہے ۔ہر دور کے لوگوں میں کائنات کے خالق کو جاننے کا جوش خروش پایا جاتا ہے (یہاں ایک اصول واضح کرتا چلو کہ اگر کوئی شخص کسی مسئلے کا حل تلاش نہ کر سکے تو پھر اس کے لیے ضروری ہے کہ وہ اس مسئلے کو مختلف زاویوں سے جانچے ۔ یعنی تمام امکانات کا جائزہ لے) ا کثر اوقات دیانتداری سے مسئلہ کو حل کرنے کی کاوش خودبخود ہی مسئلہ کو آسان بنا دیتی ہے ۔لہذا انہی خطوط پر چلتے ہوئے لوگوں میں معاملات زندگی کو سمجھنے کی سوجھ بوجھ پیدا ہو گئی ہے ۔یہ جاننے کیلئے کہ اس کائنات کا خالق کو ن ہے ۔لوگوں نے اس کائنات (آفاق)کی تخلق سے متعلق تخلیق کرنا شروع کر دی۔ کائنات کے راز کو جاننے کیلئے مختلف روش اختیار کی گیں.

لوگو ں کے ایک گروہ نے آفاق کو اپنا مر کز چن کر کائنات کے اسرار کو جاننے کیلئے اسکالرشپ مطالعہ شروع کر دیا نتیجہ نا صرف قوانین اور مظاہر قد رت کو جانا بلکہ انتہائی مفید مشینری،الیکٹرانکس کے آلات و دیگر ایجادات کا ایک ڈھیر لگا دیا ۔ان تحقیقات کی بدولت سائنس نے ترقی کی اور نت نئی ایجادات کا لا متناہی سلسلہ چل پڑا لہذا مستقل جستجو نے طبعی (Physical) اور زےستی (Biological) قوانین کے راز فاش کرنے شروع کر دیئے۔سائنس اور ٹیکنالوجی میں پیش رفت کے باعث آجکا جد ید دور ان لوگوں کی مستقل تجقیقات اور جدو جہد کا نتیجہ ہے جنہوں نے اس کائنات کا ظاہری مطالعہ کیا۔یہ تحقیق اپنی مسلسل پیش رفت کے باعث قدرت کے رازوں کو مسخر کرنے پر گامزن ہے .

علاوہ ازیں لوگوں کے دوسرے گروہ نے بجائے اس کے کہ زندگی کی حقانیت کو آفاق میں تلاش کیا جائے خود انہوں نے ایک دوسری روش اختیار کی۔ ان لوگوں کی سوچ تھی کہ ا گراس ظاہری کائنات کا کو ئی خا لق ہے تو انکے وجود (جسم )کا بھی کوئی خالق ہو گا ؟ لہذا اس سوچ سے وہ بھی اس تخلیق کا کچھ نہ کچھ حصہ ضرور ہے ۔ اپنی تو جہ کائنات کے ظاہری وجود سے ہٹا کر اپنے وجو د ( نفس) کے اسرار کی کھوج میں لگا دی۔ اس طرح انہوں نے آفاق سے ہٹ کہ مطالعہ نفس میں دلچسپی لی اور اپنی ذات پہ تجربات کا ایک سلسلہ شروع کیا تا کہ اپنے اندر کے رازِ حقیقت کو سمجھا جائے اس طرح سے علم نورانی مذاہب کے سلسلے نے وجود پکڑا یہاں یہ بات واضع کرتا چلوں کہ تمام تجربات انسان کے اپنے (Software ) یعنی ذہن (MIND (پہ کئے گئے نہ کہ جسم پہ) 
پرانے وقتوں میں لوگ یہ تصور کرتے تھے کہ یہ دنیا صر ف چار عناصر سے مل کر بنی ہے ۔زمین، پانی اور آگ اور ہوا، پھر سائنسی ایجادات کا سلسلہ چلا اور زیادہ سے زیادہ انکشافات سامنے آنے لگے اور یہ طے پایا کہ کائنات108عناصر سے ملکر بنی تھی ۔پھر ان 108عناصرکی پیچیدگیوں کے مطالعہ کے بعد یہ اخذ کیا گیا کہ یہ تمام عناصر صرف ایک ذرہ ایٹم (ATOM)سے ملکر بنے ہیں اور ان عناصر میں صرف فرق ایٹم کی ترتیب کا ہے۔ اسکے بعد کی تحقیق نے ثابت کیا کہ ایٹم ہی بنیادی ذرہ نہیں بلکہ الیکٹران ہی وہ بنیادی ذرہ ہے جو تمام دنیا کی اساس ہے۔ تاہم الیکٹران کی دریافت ایک مسئلہ کا پیش خیمہ ثابت ہوا۔الیکٹران اگرچہ بنیادی ذرہ کہلایا مگر یہ مطلق ذرہ والی فطرت ظاہر نہ کر پایا یعنی ایک وقت میں وہ متحرک بھی تھا اور غیر متحرک بھی۔ کبھی یہ ذرہ کا کردار ادا کرتا اور کبھی ایک لہر کی شکل میں ہوتا۔یہ معاملہ سائنسدانوں کیلئے انتہائی پیچیدہ ہو گیا کہ وہ الیکٹران کی اصل تعریف کیسے کر سکیں ۔لہذا ایک نئی اختر ع سا منے آئی اور الیکٹران دوہری خصوصیت کا حامل ٹھرا ے جو کہ لہر کے ذرات ا ور کبھی صرف ذرہ کی خصوصیت کا اظہار کرتا ۔ مگر جب اس الیکٹران پر مزید تحقیق جاری رکھی تو یہ کھوج ایک انتہائی درجے پر پہنچی کہ الیکٹران صرف اور صرف ایک کمترین توانائی کا ذرہ (Energy Particle)ہے اور یہ توانائی ہی کی خصوصیت ہے جو کہ اپنے آپ کو الیکٹران میں تبدیل کرتی ہے اور بعد میں اس مادے میں تبدیل ہوجاتی ہے۔ مشہور سائنسدان البرٹ آئینسٹاین کی مساوات E= MC2 بھی تمام مادہ اور توانائی ایک دوسرے میں تبدیل ہونے کے عمل کہ تقویت دیتی ہے۔سائنسدانوں کی تمام تحقیق اب تک ہمیں یہاں تک لانے میں یقینی طور پہ کامیاب ہو ی ہے کہ یہ درخشاں توانائی اپنے بنیادی درجہ پر اس کائنات میں جاری و ساری ہے ۔ جبکہ ہر چیز  ایک مخصوص جگہ گھیرتی ہے اور پھر توانائی میں تبدیل ہو سکتی ہے۔

یہ تو بات ہو رہی تھی ا ن لوگوں کے بارے میں جنہوں نے مسلسل آفاق کی تحقیق سے زندگی کے چند اسرار کا اندازہ لگایا اور ہمیں ہستی کے نئے میدان میں لاکھڑا کیا ۔ اب ان لوگوں کے بارے میں بات کرتے ہیں جنہوں نے نفس کو اپنی تحقیق کا مرکز بنایا اور اپنے جسم و ذات پر یہ تحقیق شروع کر دی اور انہوں نے اپنی توجہ اپنے ا ند ر مرکوز کر دی جسکے نتیجہ میں نفوذ کرنے کے بہت سے طریقہ کار دریافت کیے تا کہ ا پنے اندر کا سفر کرکے اس اکائی (جز)کو تلاش کیا جا سکے جو کے انکو اس کائناتی حقیقت سے مربوط کرتا ہے ۔اس کوشش نے علم نورانی (علم مراقبہ) کے عمل کو تقویت دی ۔تمام طریقہ کار جو کہ مختلف طرح سے مراقبہ کے عمل میں نظر آتے ہیں وجود پائے۔ جس کا عمل دخل کم و بیش ہر مذہب کی اساس معلوم ہوتا ہے۔ آ ج مراقبہ کے عمل میں جو جدت اور انواع و اقسام کے طریقہ کار نظر آتے ہیں انہی لوگوں کے مرہون منت ہے جنہوں نے اپنے نفس کو تحقیق کیلئے چنا۔ ان تحقیقات اور مراقبہ کی مختلف حالتوں میں لوگوں نے محسوس کیا کہ اس سارے نظام عالم وجود میں شعوری توانائی کا نفوذ اور منسلکہ رشتہ ہے ۔مراقبہ کی گہری حالتوں میں اب ہر فرد واحد کا واسطہ ایک ا ہم گہرا احساس دلانے وا لے وجود یعنی خودی ( میں،SELF)سے پڑا اور یہ اخذ کیا گیا کہ یہ جو سلسلہ کائنات میں توانائی کا عمل دخل نظر آتا ہے اس کی کوئی حقیقت نہیں بلکہ ایک اعلی حس آگاہی (Supreme Consciousness) ہے جس کا اس کائنات میں نفوذ ہے ۔ اب ان تحقیقات مراقبہ اور سائنس میں کبھی کبھی ہم آہنگی ہونے کے ممکنات موجو د ہیں ۔ اس فطرت کی ہر شے کچھ نہیں سوائے ایک مطلق حس آگاہی کے ۔یہ ایک اعلی مطلق خبر آگاہی جسکا ہر طرف نفوذ ہے اور یہی وہ اللہ ہے جو کائنات میں ہمیں اپنی ذات کے اندر اور باہر محسوس ہوتا ہے ( اللہ نور السمٰوات ولارض) ( ھو ا ول و آخر ظاہر و باطن) کبھی ہم اپنی ذات (خودی ) سے تعلق ہمیں ایک رابطہ ملتا ہے کہ ہم اپنے اللہ کو جانیں  (من عرفہ نفسہ فقد عرفہ رب)۔
(یہاں یہ بات واضع کرتا چلوں کہ اس درجہ کے احساس خود شناسی پہ [[وحدت الوجود]] کا مغالطہ نہ ہو، اگلی کسی تحریر میں اس فلسفہ بھی بیان کردوں گا ) ۔ مراقبہ ایک عمل ہے جو اپنی گہری حالتوں میں کسی بھی شخص کیلئے وجود حقیقی سے روابط کا ذریعہ بنتا ہے

== '''  علم نورانی (مراقبہ)  ''' ==
مدتوں سے لوگ مراقبہ کو ایک انتہائی پرا سرار اور مشکل موضوع سمجھتے رہے ہیں ہمیشہ بڑے بوڑھے اور فار غ لوگوں کو اس کا حقدار سمجھا جاتا رہا ہے ۔ ۔مراقبہ پر پوری دنیا میں سائنسی طریقہ کار کے تحت تجربات کر کے اخذ کر لیا ہے کہ اس عمل سے انسانی ذہن اور جسم پر انتہائی اعلی مثبت اثرات مرتب ہو تے ہیں جس میں تعلیم و عمر کی کوئی قید نہیں اب کوئی بوڑھا ہو یا جوان سب ہی مراقبہ کی کرنے مے دلچسپی رکھتے ہیں مزید برآں اب تو سکول و کالج میں مراقبہ کی تعلیم کو ایک لازمی مضمون کی حےثےت حاصل ہوتی جا رہی ہے کم و بیش پوری دنیا میں مراقبہ کی تربیتی کلاسز کا اجراء ہو چکا ہے اعلی تعلیم یا فتہ ڈاکٹر اور صحتی ادارے اپنے مریضوں کو روزانہ مراقبہ کرنے کا مشورہ دیتے ہیں مراقبہ جو کہ پہلے وقتوں میں صرف مذہب کا حصہ سمجھا جاتا تھا اب دنیاوی پیش قدمی کے علاوہ روز مرہ مسائل کے حل کے لئے بھی مرکزی حےثےت اختیار کر گیا ہے آج پوری دنیا میں ذہنی دباﺅ کو کم کرنے اور ذہنی سکون حاصل کرنے کے لئے مراقبہ کو مرکزی حےثےت حاصل ہو چکی ہے اور اس کو آج کے وقت میں انتہائی میسر آلہ قرار دے دیا گیا ہے جوں جوں معاشرہ میں اسکی آگاہی بڑھتی جا رہی ہے نتیجہ میں انسانی بھائی چارہ اور عالمی اتحاد میں اضافہ ہوتا چلا جا رہا ہے جب زیادہ لوگ مراقبہ کی بدولت ذاتی شناسائی حاصل کرتے جائیں گے انکو کائنات کی سچائی اور اصلیت کا قرب حاصل ہو گا اور نتیجہ عالمی بھائی چارہ وجود میں آئے گا۔

== عبادت اور مراقبہ میں فرق ==
{{نیم حذف}}
مراقبہ اور عبادت میں فرق پر بات کرنے سے پہلے یہ بات قابل توجہ ہے کہ عبادت سے مراد کس مذہب سے ہے؟ اگر یہاں مراقبہ سے مراد تمام مذاہب سے ہے تو پھر اس موضوع پر الگ الگ ہر مذہب کی عبادت سے مراقبے کا موازنہ لازم آتا ہے۔ لیکن پھر ایسی صورت میں اسے ---- عبادت اور مراقبہ میں فرق ---- کے بجاۓ ---- عبادت اور تعمق میں فرق ---- کہنا زیادہ موزوں ہوگا اور اس کی منطقی وجہ یہ ہے کہ مراقبہ (muraqibah) اپنی اصل میں اسلامی پس منظر رکھتا ہے اور مراقبہ اور عبادت میں فرق کی عبارت استعمال کی جاۓ تو اس سے ذہن میں مراقبہ اور نماز کا فرق ہی آتا ہے جبکہ meditation چونکہ ہر مذہب میں استعمال ہونے والا ایک تصور ہے (گو اس کے ہر زبان میں الگ الگ نام ہیں) اور عربی ، فارسی اور اردو تینوں زبانوں میں اس کے لیۓ مراقبے کے ساتھ ساتھ تُعمِّق کا لفظ لغات میں آتا ہے، لغات میں مراقبے کو استبصار بھی کہا جاتا ہے لیکن یہ اپنے معنوں میں enlightenment سے زیادہ قریب ہے۔ 
 
عبادات میں اللہ سے بات کی جاتی ہے اور اپنا رابطہ ازل سے جوڑا جاتا ہے مگر مراقبہ میں اپنے باطن کی ا تھا ہ گہرائیوں میں جا کر اپنے اللہ کو سنا جاتا ہے اور کائنات کی حقیقت سے نا صرف سنا شا ہوا جاتا ہے بلکہ مشاہدہ ء قدرت بھی کیا جاتا ہے۔ مراقبہ کا نصب العین (مقصد)صرف اور صرف آپ کے جسم، جذبات ،اور ذہن کو یکجا کرنا ہے اور اس اعلی درجے کی یکسوئی کا مقصد صرف اپنے باطن میں موجزن آگہی کے بحر بیکراں میں غوطہ زن ہونا ہے یہیں سے کشف و وجدان کے دھارے پھوٹتے ہیں ۔ اسطرح ایک انسان کا رابطہ کائنات کی اصل سے جڑ جاتا ہے اور علم و عر فان کے چشمے پھو ٹ پڑ تے ہیں ۔ کامیابیوں کے دروازے کھل جاتے ہیں ۔ اور انسان پستی کے گرداب سے نکل کر ہستی کے نئے میدان میں آ جاتا ہے جہاں ہر طرف بہار ہی بہار ہے ۔بہار بھی ایسی کہ خزاں نہیں ہوتی اور سوچ انسانی آسمان کی بلندی کو چھوتی ہے اور لذت بھی ایسی
      
ع کہ جیسے روح ستاروں کے درمیاں گزرے

یہی زندگی کا موسم بہار ہے جسکے آ جانے کے بعد ہر طرف کامیابیوں کے دروازے کھل جاتے ہیں اور انسانی سوچ کا سفر ایک نئی سمت گامزن ہو جاتا ہے۔ جسکے سامنے ایک وسیع و اریض میدان عمل ہے اور یہاں کی سلطنت میں صرف آج کی حکمرانی جبکہ گذشتہ کل کی کسی تلخی کا دکھ نہیں اور آنے والے کل کی خوشیوں کا دور دورہ ہے۔یہاں لذت و سرور کا وہ سماں ہے جو کہ دنیا کے کسی نشے میں نہیں ۔ اور خواب حقیقت کے روپ میں بدل جاتے ہیں جبکہ زندگی سوچوں کی تنگ و تاریک گلیوں میں دھکے کھانے کے بجائے روشن اور وسیع میدانوں میں سفر کرتی ہے۔اب اسکا سفر کوئی سڑاند والا جوہڑ نہیں کہ جس میں وہ غوطے کھائے بلکہ ایک بحربیکراں جسکے سفینے صرف کامیابی ،خشحالی اور سکون کی منزل تک لے جاتے ہیں۔

== '''نفس، میں (مثلاSelf, I, Ego) اور مراقبہ''' ==
درحقیقت آپ صرف ایک احساس خودی (Self) ہیں۔ اور یہ حس آگاہی ہے نہ کے آپکا ذہن، جسم یا پھر خیالات بلکہ اس مکمل شعوریت (خودآگاہی) ہیں جوکہ محسوس کرتی ہے۔ اور شاہد بنی ہوئی ہیں کہ آپ زندگی میں کیا رول ادا کر رہے ہیں۔ یہ احساس خودی اپنی خاصیت کے اعتبار سے انتہائی پر سکون، ٹھہراﺅ والا ،از سرنو زندگی بخشنے والا ہے۔ مراقبہ ایک خودی (Self )کو اپنے اندر جاننے کا عمل ہے۔ اس موقع پہ آپ کہہ سکتے ہیں کہ ایک فرد یہ کس طرح جان سکتا ہے کہ اس کے اندر خودی (Self ) موجود ہے جوان تمام واقعات و حالات کا مشاہدہ کر رہی ہے جو ہمارا ذہن یا جسم اس زندگی میں کر رہا ہے۔ 
یہ بات یہاں تک واضح ہوگئی کہ مراقبہ ایک ایسا عمل ہے۔ جو ہمیں اپنے اندر موجود خودی (Self) سے ملانے کا ذریعہ بنتا ہے اور یہ خودی اپنی خاصیت کے اعتبار سے انتہائی پر سکون، ٹھہراﺅ والی اور از سرنو زندگی بخشنے والی ہے۔ لہٰذا ہم چاہےںگئے کہ مراقبہ کو سمجھنے کیلئے ہم سب سے پہلے اپنے اندر موجود خودی (Self) کو جانیں۔آپ اس خودی کو اور بھی نام دے سکتے ہیں۔ مثلاً، نفس، میں (مثلاSelf, I, Ego) وغیرہ آئیے اب ایک چھوٹا سا تجربہ کرتے ہیں جو انتہائی دلچسپی کا حامل ہے اور آپ کے لئے اس (میں ) سے شناسا ئی کا ذریعہ بنے گا۔ 

== '''میں(Self) کا انسانی وجود سے تعلق''' ==

”آپ اپنی آنکھیں بند کر کے کوئی ایک لفظ، کسی کا نام یا اللہ کا نام 25 مرتبہ اپنے ذہن میں دہرائیں مگر گنتی دل ہی دل میں ہونی چاہیے مگر گنتی کرتے ہوئے ذہن میں کوئی اور خیال نہیں آنا چائیے اور اگر گنتی میں کوئی غلطی ہو تو دوبارہ سے گنتی شروع کردیئے۔ مگر گنتی ذہن میں ہی رہے ناکہ ہاتھوں یا انگلیوں پہ“ اس تجربہ کے کرنے کے بعد ہوسکتا ہے کہ آپ کامیابی کے ساتھ25 مرتبہ ایک لفظ اپنے ذہن میں گنتے رہے ہونگے اور خیال بھی ذہن میں آتا ہوگا۔ یا ہو سکتا ہے کہ چند خیالات ذہن سے گزرے ہوں۔ یا پھر پہلی کوشش ناکام ہو گئی ہو اور کئی مرتبہ اس تجربہ کو کرنا پڑا ہو تو پھر جا کر 25 مرتبہ کی گنتی پوری ہوئی ہو یا پھر خیالات بھی آ رہے ہوں اور گنتی بھی جاری رہی ہو۔ ہو سکتا ہے کہ آپ کامیابی کے ساتھ یہ تجربہ نہ کر پائے ہوں کہ آپ 25 مرتبہ کوئی ایک لفظ دہرائیں اور کوئی خیال بھی ذہن میں نہ آئے ۔ 

'''مراقبہ اور ذات (Self ) سے شناسائی'''

معاملہ کچھ بھی، تجربہ کچھ بھی ہو، بات حقیقت ہے کہ آپ اپنے اندرونی خودی (Self ) کے وجود کا انکار نہ کرپانیں گے۔ کیونکہ جب آپکا ذہن گنتی میں مصروف تھا تو وہ کون تھا جو مشاہدہ کر رہا تھا کہ ذہن سے خیالات گزر رہے ہیں؟وہ کون تھا جو ایک ہی وقت میں مشاہدہ کر رہا تھا کہ ذہن میں خیالات بھی آ رہے ہیں اور گنتی بھی ہورہی ہے؟ کیونکہ آپ کا ذہن کو ےقےنا گنتی میں مصروف تھا۔ےقےنا آپ کہیں گے کہ وہ میں تھا جو دیکھ رہا تھا کہ کوئی خیال ذہن میں آ رہا ہے اور گنتی بھی صحیح ہو رہی ہے۔ وہ کون تھا جو مشاہدہ کر رہا تھا؟ آپ کا جسم یا پھر آپ کا ذہن؟ یا پھر آپ خود؟ اگر آپ یہ سارا عمل دیکھ رہے تھے تو آپ کو اپنے ذہن اور جسم سے علیحدہ ہونا چاہیے۔ جی ہاں! دراصل یہ حس آگاہی ہی تو خودی (Self-I) ہے جو آ پکو اپنے خیالات تصورات سے آگاہ کرتی اور صرف اور صرف خودی (Self-me) ہی ہے جو آ پکو بتلاتی ہے کہ ا پکے اندر اور باہر کیا ہو رہا ہے؟ کہاں ہو رہا ہے ؟ و دیگر سے آگاہی کا سبب بنتی ۔ اس جاننے والے کو جاننے کا عمل ہی مراقبہ ہے۔ مراقبہ دراصل اپنی ذات سے شناسائی کا عمل ہے .
== ==

== بیرونی روابط ==
* روزنامہ '''نوائے وقت''' [http://www.alqlm.org/forum/showthread.php?t=2349 10اکتوبر2008 اشاعت خاص]
== حوالہ جات ==
<references/>

[[زمرہ:مراقبہ]]
[[زمرہ:تدخلات عقل و جسم]]
[[زمرہ:خود]]
[[زمرہ:روحانیت]]

{{تصوف-مفصل}}

[[fa:مراقبه]]
[[en:Meditation]]
[[af:Meditasie]]
[[als:Meditation]]
[[bn:ধ্যান]]
[[bg:Медитация]]
[[ca:Meditació]]
[[cs:Meditace]]
[[da:Meditation]]
[[de:Meditation]]
[[et:Meditatsioon]]
[[el:Διαλογισμός]]
[[es:Meditación]]
[[eo:Meditado]]
[[fr:Méditation]]
[[fy:Meditaasje]]
[[gl:Meditación]]
[[hi:ध्यान]]
[[hr:Meditacija]]
[[id:Meditasi]]
[[it:Meditazione]]
[[he:מדיטציה]]
[[sw:Sala ya moyo]]
[[lt:Meditacija]]
[[hu:Meditáció]]
[[mk:Медитација]]
[[mwl:Meditaçon]]
[[nl:Meditatie]]
[[new:ध्यान]]
[[ja:瞑想]]
[[no:Meditasjon]]
[[nn:Meditasjon]]
[[tpi:Meditesen]]
[[pl:Medytacja]]
[[pt:Meditação]]
[[ro:Meditație]]
[[ru:Медитация]]
[[sq:Meditimi]]
[[simple:Meditation]]
[[sk:Meditácia]]
[[sr:Медитација]]
[[fi:Meditaatio]]
[[sv:Meditation]]
[[te:ధ్యానం]]
[[tr:Meditasyon]]
[[uk:Медитація]]
[[zh:冥想]]{{انضمام مضمون|مروہ الشربینی}}
{{صفائی نو لکھائی}} 

شہیدہ الحجاب کے نام سے معروف مرواشیرینی مصر سے تعلق رکھنے والی ایک با غیرت مسلم خاتون تھیں جو ایک نسل پرست جرمن کی سفاکیت کا نشانہ بنیں۔ مروا شیرینی جن کو اب سارے عالم اسلام میں اب ”شہیدہ الحجاب“ کے نام سے جانا جاتا ہے،


==پس منظر==
31 سالہ مرواشیرینی اپنے شوہر ایلوی عکاذکے ہمراہ  جرمنی میں رہائش پذیر تھیں جہاں ا یلوی عکاذ  بسلسلہ روزگار مقیم تھے ۔ آپ نے اجنبی ملک میں بھی بلا خوف و خطر حجاب کو  اپنایا ہوا تھا۔  2008 مروا ایک روز ایک تفریحی مقام پر اپنے بیٹے مصطفیٰ کے ساتھ ٹہل رہی تھیں کہ ایک اٹھائیس سالہ جرمن نوجوان ( جس کا نام  ”ایلکس“ بتایا گیا ہے ) اس باحجاب خاتون کو میں” دہشت گرد اسلامسٹ“ کہہ کر پکارا ۔ 
مروا شیرینی  نے ”ایلکس“ کی اس بد تمیزی پر جرمنی کی ایک عدالت میں ایلکس کے خلاف مقدمہ درج کیا ۔ عدالت میں دائر کی گئی اپنی درخواست میں لکھا کہ” جرمن نوجوان نے ان کی مذہبی شناخت کی توہین کی ہے“ چنانچہ تحقیق و تفتیش کے بعد ایلکس کو مجرم ٹھہرا کراس پر عدالت نے 750 یورو جرمانہ عائد کیا ۔ ایلکس ڈبلیو نے عدالت کے اس فیصلے کے خلاف نظر ثانی کی اپیل کی جس پر عدالت نے فریقین کو طلب کیا


==شہادت== 
7 جولائی 2009 کو  مروا شیرینی  عدالت پہنچی جبکہ خبیث جرمن نوجوان بھی عدالت پہنچا ،ابھی نظر ثانی کی درخواست شنوائی کا آغاز ہو ہی رہا تھا کہ اس حجاب دشمن جرمن نوجوان نے عفت مآب مروا شیرینی پر تیز دھار خنجر  سے حملہ کر دیا۔ اس نے مروا کو لہو لہان کر کے انہیں اٹھارہ سے زائد وار کئے جن کی تاب نہ لاکر مروا شیرینی کمرہ عدالت میں جام شہادت نوش فرمایا۔ شہادت کے وقت آپ تین ماہ کی حاملہ تھیں اس دوران ان کے شوہر نے درندہ صفت جرمن نوجوان پر جھپٹنے کی کوشش کی تو اس درندے نے ا ن کو بھی لہو لہان کر دیا۔ ایلوی عکاذ گزشتہ کئی دنوں سے  اسپتال میں موت اور زندگی کی کشمکش میں مبتلا  ہیں۔ جبکہ عدالت میں وقوع ہونے والے اس دلخراش واقعے میں مروا  کا تین سالہ بیٹا مصطفی بھی ان کے ساتھ تھا جو معجزاتی طور پر بچ نکلنے میں کامیاب ہوا۔

==جرمن حکومت کا شرمناک کردار==
انسانی حقوق کے چیمپیئن جرمنی کی پولیس  کی جانبداری اس سے عیاں ہے کہ جس وقت جرمن درندہ ایلکس نے عفت مآب مروا شیرینی پر حملہ کیا تو عدالت میں موجود پولیس نے ایلکس کو قتل کرنے کے بجائے مروا شیرینی کے شوہر پر گولی چلائی ۔ عدالت ابھی تک ایلکس کے خلاف قتل کا مقدمہ دائر نہیں کر سکی اور یہ کہ مجرم کمرہ عدالت میں چاقو کیسے ساتھ لایا تھا اور اسے مسلم خاتون کو حجاب پر قتل کرنے کی عدالت میں کس نے اجازت دی تھی اس سب پر جرمن عدالت پر دہ ڈالے ہوئے ہے۔ ایک ہفتہ سے زائد وقت گزرنے کے باوجود جج اور وکلا کی موجودگی میں قتل کے مذموم فعل کا ارتکاب کرنے والے نسلی حیوان ایلکس کو ابھی تک جرمن حکومت مجرم کو قرار واقعی سزا دینے میں لیت و لعل سے کام لے رہی ہے

==مصری حکومت کی بے حسی==
اگرچہ مصری خاتون”شہیدہ الحجاب“ کے اس بہیمانہ قتل پر مصری مسلمانوں میں زبردست اشتعال پایا جا رہا ہے لیکن اس کے باوجود [[حسنی مبارک]] کی امریکہ نواز سرکار اس سانحے پر جرمن حکومت کے خلاف  کسی بھی کارروائی سے صرف ظر کر رہی ہے ۔ مصری حکومت کے اس شرمناک طرز عمل پر مصری اخبارات اپنی شدید برہمی کا اظہار کر رہے ہیں اور وہ فوری طور پر ”شہیدہ الحجاب“ کے جرمن قاتل کو سزا دینے کا مطالبہ کر رہے ہیں ۔ یاد رہے حسنی مبارک حکومت نے مصر میں عوامی احتجاج پر پابندی عائد کر رکھی ہے جس وجہ سے مصری مسلمان سڑکوں پر آکر کوئی بھی احتجاج کرنے سے قاصر ہیں ۔ 
==قاتل==
جرمن نوجوان جس کا نام ”ایلکس“ بتایا گیا ہے اپنے خبث دل اور نجس دماغ میں مسلمانون کے ساتھ انتہائی درجے کی نفرت رکھتا ہے ۔وہ جرمنی کی نیشنل ڈیمو کریٹک پارٹی سے تعلق رکھتا ہے جو غیر جرمن کے ساتھ بھی تعصب رکھتی ہے اور مسلمان دشمنی میں پیش پیش ہے ۔وہ جرمنی میں مساجد کے خلاف آج تک کئی مرتبہ احتجاج کر چکی ہے۔

[[زمرہ:مصری شخصیات]]''''جادو ايک ايسا فلسفہ ہےجوانساني دماغ کومنتشر کرديتا ہے'اور ہوش وحواس کو مضمحل کرديتا ہےجس کےباعث انساني آنکھ کو وہی دکھاءی ديتا ہے جو جادوگر دکھاتا ہے'''اپنے شہر میں http://t.co/hqEweKUTبغیر عاجزى کے وحدت الوجود كى کیفیت میں کچھ ولایت نہیں اگرچہ صاحب کیفیت كى زبان سے انا پرستی کا ظہور کیفیت کا اثر... http://fb.me/AwFKDk7Hپیمبروں سے زمینیں وفا نہیں کرتیں۔۔۔۔ ہم ایسے کون خدا تھے جو اپنے گھر رہتے۔ افتخار عارفپردے میں رہنے دو پردہ نہ اٹھانہ http://t.co/X08eZXJy http://t.co/k5wgL9yXدو شاعر ایک ترنگ: ایک خوبصورت بحر میں دو بہت اچھی غزلیں آپ کے ذوق کی نظر۔پہلی غزل سلیم کوثر کیغزلاس عالمِ ... http://t.co/UFtXk4xp@AmitabhBachan فضل الرحمان کاطالبان اورامریکاکےدرمیان ثالث بننےسےانکار Daily Islam Online Edition: http://t.co/31MfFwos via @addthisجاویداقبال کا بلاگ » Blog Archive » سعودی عرب میں شادی http://javediqbal.ueuo.com/?p=552Stocks: یورپی و امریکی اسٹاک مارکیٹس میں کمی کا رجحان http://t.co/o5enCHE================================== دیکھئیے سب گدا بادشاہ ہو گئے دیکھئیے شان یہ اُن کی خیرات کی ایک اُنگلی سے ٹکڑے... http://t.co/VvL4Wop2نیپکن: napkin: noun. Example sentence:براہ مہربانی آپ مجھے ایک اور نیپکن لا کر دے سکتے ہیں؟Translation:Can you b... http://t.co/V7GGSis8نماز عيد كا طريقہ http://t.co/a3XFHm1F Twitter: http://t.co/2TzTBZGt http://t.co/WFApSBhZمحبت ہر وقت موسم میں ایک پھل ہے ، اور ہر ہاتھ کی پہنچ میں. ~ مدر ٹریسا http://bit.ly/bElRDP Islam Question and Answer - قربانی کی تعریف اوراس کا حکم http://t.co/cMENrfWyعلم مال سے بہتر ہے کیونکہ علم تمہاری حفاظت کرتا ہے اور تم مال کی حفاظت کرتے ہودوران پرواز نومولود بچے کو ’فلش‘ کرنے کی کوشش ببچے کو جہاز کے ٹائلٹ میں جنم دے کر فلش کرنے والی خاتون میڈیکل کی... http://t.co/tcw7UUJVحکومت قوم کوکچھ نہیں دےرہی ،چیرمین تحریک انصاف عمران خان================================== آج پھر دیکھا ہے اُن آنکھوں کو احمد آج پھر سے ہم دیوانے ہو گئے احمد حسان... http://t.co/ghLOaWOQکوئی اسے کچھ بھی سمجھے مگر مجھے اس بات سے شدید دکھ پہنچا کہ میرا آئیڈیل سیاسی کردار اور شفاف ترین لیڈر مخدوم... http://t.co/7BCplmBuدسمبر میں چینی، بھارتی صنعتی پیداوار میں واضح اضافہ: چین اور بھارت کا شمار دنیا کی تیزی سے ترقی کرتی ہوئی بڑی مع... http://t.co/2WA4flmvصحت: health: noun. Example sentence:صحت دولت سے بہتر ہے.Translation:Health is better than wealth. http://t.co/Nk861ou8تعلیم یافتہ نوجوان کسی بھی پرچم تلے جمع ہو ں مقصد صرف انقلاب اور مثبت تبدیلی ہے، الطاف حسین ، یہ کون بتائےگا کہ... http://t.co/n5fzlarO#SecStateپاکستان کے لوگوں کے پاس ان کی اپنی خوش حالی کی کلید ہے: وزیر خارجہ کلنٹنStocks: اسلام آباد انڈیکس 70پوائنٹس نیچے آگیا http://t.co/9O5wlTMیوم ِ آزادی منائیں ۔۔۔۔۔ آج ارضِ پاک پر ہے ٓزمائش کا سماں http://goo.gl/fb/tCGGvمحبت ایک فطرت کی طرف سے مہیا کر کینوس ہے اور کلپنا کی طرف سے کڑھائی. ~ والٹیر http://bit.lyاُسے بھی ہم نے گنوایا تری خوشی کے لئے ۔۔۔۔ تجھے بھی دیکھ لیا ہے ارے زمانے جا ۔۔۔ احمد فرازQuran Translation Course - قرآن مجید کا آسان ترجمہ کورس http://www.esnips.com/doc/2fd86462-c9c9-44c3-a247-ebc95e71258e/QURAN_TARJUMA_COURSE#moharram #roza محرم میں کثرت سے نفلی روزے رکھنے کی فضیلت http://t.co/LzUiOUdY Twitter... http://t.co/6vyE4aB5بھارتی بیٹنگ لائن کا مستقبل http://t.co/fybJ1wUآج کی خبر ھے کہ وزیر قانون پنجاب مولانا حضرت رانا ثناء اللہ مدظلہ العالی نے فرمایا ھے کہ بینظیر بھٹو کے قتل کا... http://t.co/DKKPTuuCشامی اپوزیشن دھڑوں کے مابین سمجھوتہ ناکامی سے دوچار ہونے کا اندیشہ: چوبیس گھنٹے نہیں گذرے ہیں کہ فریقین میں معاہ... http://t.co/jj07iVCOمسکراہٹ اور خوش رہنے والوں کی عمر بھی طویل خوش رہنے والے لوگ نہ صرف زندگی سے زیادہ لطف اندوز ہوسکتے ہیں بلکہ ایک... http://t.co/wpCKT1sO’2002سے حراستی ہلاکتوں اور فرضی جھڑپوں کے173واقعات ‘ http://wp.me/pK9kd-djنائیجریا کے مشرق میں دو مخالف گروپوں کے درمیان جھڑپوں میں کم سے کم پچاس افراد ہلاک ہو گئے ہیں۔خواتین و حضرات ! گاڑی کا وہ میکینک کام کرتے کرتے اٹھا اس نے پنکچر چیک کرنے والے ٹب سے ہاتھ گیلے کے اور ویسے ہی جا... http://t.co/q0RpLKxBکراچی:فیضان احمد کو 17 ستمبر کو حسن اسکوائر سے اغواکیا گیا تھا،سی پی ایل سی چیف#nowPlaying -- میرے اندر کوئی بِکھرا ہوا ہے کُچھ دنوں سے http://t.co/DV4AGDX via @youtubeسیاسی مارکیٹنگ http://t.co/t4Oy6aqiزرداری کو ھارٹ اٹیک یا وطن سے مفروری کی تیاری؟ تاریخ کا بدترین غدار ملت، کرپٹ ترین لٹیرا، بھٹو خاندان کا سفاک و... http://t.co/SwK4DqaUدو جانوں پر ایک سوچا ، دو دل ہے کہ ایک کے طور پر ہرا دیا. ~ جان کیٹس http://bit.ly/bcFG7L صومالیہ:امدادی سرگرمیوں کا دائرہ وسیع http://t.co/Nr42NaEمحبت کے بغیر زندگی پھول یا پھل کے بغیر ایک درخت کی مانند ہے. ~ Kahlil Gibran http://bit.ly/bBK7Zu نهايت فضول عمل ھے كه انسان قرآن تو خفظ کر لے مگر معرفت قرآن کے لیئے دیگر کتب پر استفادہ کرے یعنی وه هادى برحق کے... http://fb.me/15dUoFGJ5اور جو (کتاب) تم کو تمہارے پروردگار کی طرف سے وحی کی جاتی ہے اُسی کی پیروی کئے جانا۔ بےشک خدا تمہارے سب عملوں سے خبردار ہے(al ahzab 2)@UrduWriter ۔جن لوگوں نے اپنے دین کو ٹکڑے ٹکڑے کردیااور گروہ در گروہ ہوگئے (اے رسول!) تیرا ان سے کچھ تعلق نہیں ہے(سورۃانعام)@Javedakhtarjadu ‎کیا ھال ھیں آپ کے.میں عامر پاکستان سےStocks: کراچی اسٹاک مارکیٹ میں شدید مندی؛ انڈیکس دھڑام سے ... http://t.co/LGfy4ezمسلم لیگ( ن) کا اقتدار میں آ کر بینظیر بھٹو کے قاتلوں کو عوام کے سامنے لانے کا اعلان ، صدر آصف علی زر داری اور و... http://t.co/9h93fxIeطالبان نے قطر میں رابطہ دفتر کھولنے کی تصدیق کر دی: طالبان نے قطر میں اپنا پہلا سیاسی رابطہ دفتر کھولنے کی تصدیق... http://t.co/3LJUCwX8تم نیک ہو اور لوگ تمہیں برا کہیں یہ اس سے اچھا ہے کے تم برے ہو اور لوگ تمہیں اچھا کہیں You are good(in deeds) and... http://t.co/NNpBkmsOوینا کا سفینہ….ڈوبتا ہے یا ابھرتا ہے!! | The News Tribe: http://t.co/VAuY27yu via @AddThisبیادِ سڈنی: چاول خوروں کے نام http://bit.ly/ozl7XDNew Post : Join & Share plz: Join & Share plzNews Update رھیے با خبرCommunity http://t.co/9vWrPAOIبھٹو مرحوم کے سیاسی اثرات http://fb.me/RCHBY2r0Stocks: لاہور اسٹاک مارکیٹ میں اضافے کا رجحان http://t.co/Wr37YS5کراچی میں عمران خان کا کامیاب شو http://t.co/w2AdoqyKپاکستان کا کہنا ہے کہ گزشتہ ڈیڑھ سال سے امریکہ نے پاکستان کو دہشت گردی کے خلاف جنگ کے اخراجات کیلیے کوئی ادائیگی نہیں کی۔اب کوئی کام بھی کریں ناصر رونا دھونا تو عمر بھر ہے یہ ناصر کاظمیﻣﯿﻤﻮ ﮐﯿﺲ ، ﻣﻨﺼﻮﺭ ﺍﻋﺠﺎﺯ ﻧﮯ ﺑﻠﯿﮏ ﺑﯿﺮﯼ ﮐﺎ ﺧﻔﯿﮧ ﭘﻦ ﮐﻮﮈ ﺗﺤﻘﯿﻘﺎﺗﯽ ﮐﻤﯿﺸﻦ ﮐﻮ ﻓﺮﺍﮨﻢ ﮐﺮﺩﯾﺎ ، ﺍﻥ ﮐﺎ ﮐﮩﻨﺎ ﮨﮯ ﮐﮧ ﺣﺴﯿﻦ ﺣﻘﺎﻧﯽ ﺑﮭﯽ... http://t.co/kiLRbB4qسونے کے آداب ، سنت نبوی صلی اللہ علیہ وآلہ وسلم اور جدید سائنس‎: سونے کے آداب ، سنت نبوی صلی اللہ علیہ وآلہ وسلم... http://t.co/SkHDUuLwمیں کس طرح کی عبادت نہیں پتہ تھا یہاں تک کہ میں کس طرح کی محبت میں جانتا تھا. ~ ہینریشمعِ تنہا کی طرح، صبح کے تارے جیسے۔۔۔۔۔۔۔ شہر میں ایک دو ہی ہوں گے ہمارے جیسے۔ عرفان صدیقیقوم، علاقہ، زبان اور انسانیت کا تقاضا | م بلال م کی بیاض http://t.co/TYGvCRbc via @mbilalmpkطلب میں جس کی میں مر چلا ہوں اسی کو میری طلب نہیں ہے اسے نہ الزام دے تو احمد وہ تیرا کب تھا جو اب نہیں ہے احمد... http://t.co/VzTwaDNvاسلام آباد:ملزم سردار علی سے خود کش جیکٹ بھی برآمد ہوئی، ذرائع http://t.co/l84cW7Vp@Saba_Imtiaz @cyalm فضل الرحمان کاطالبان اورامریکاکےدرمیان ثالث بننےسےانکار Daily Islam Online Edition: http://t.co/y4yBNZN4 via @addthis@MohsinHijazee بس دو دن باسی ہے۔ لیکن تپنے کا عنصر زیادہ شامل ہے نسبتاً دلائل کے :)شب برات مبارک هو.مخصوص حالات میں کم خوابی بھی زیادہ وزن کا سبب یہ سچ ہے کہ زیادہ سونا، کھانا اور کم ورزش کسی بھی انسان کے وزن... http://t.co/o7Zt16pjقوموں نے ترقی کس زبان میں کی؟ | م بلال م کی بیاض http://t.co/wDoz98Pl via @mbilalmpk#SecStateہم چاہتے ہیں کہ افغانستان اقتصادی ترقی کی ایک شاہراہ بنے، ایک نئی شاہراہ ریشم کے منصوبہ کےذریعہ: وزیر خارجہ کلنٹنلیاری میں رینجرز کا سرچ آپریشن مکمل، آپریشن میں ٹارچرسیل اور اسلحہ برآمد کرکے متعداد افراد کو حراست میں لے لیا گیاپاکستانی صحافت سےوابستہ سفارتکار | The News Tribe: http://t.co/EB5Wm5uU via @AddThisمسلم معاشرے کا ایک اہم ناسور اسراف بھی ہے ۔ از۔ اکمل سید: ہر شخص کوشاں ہے کہ وہ چلتاہوا جدید فیشن کاحامل لباس ز... http://t.co/TFwt6uw0برطانیہ میں نسلی قتل کے الزام میں دو دہائیوں بعد ملزمان کو سزا: برطانیہ میں نسلی بنیادوں پر قتل کے ایک واقعے میں... http://t.co/ggbvf857#janabat #sardi #tayamom كيا شديد سردى ميں جنابت سے تيمم كيا جا سكتا ہے ؟ http://t.co/maMm2OKd... http://t.co/qoD9VLmCروح اور روحانیت کی دنیا کا چرچا کرنے والے اگر کبھی کسی کوتاہی کے زمیدار ٹھرائے جا سکتے ہیں تو وہ صرف اس قدر ہوتی... http://t.co/8SHJ51Xzحضرت خديجہ تاريخ کے آئينہ ميں http://goo.gl/fb/yD8xEپاک امریکھ تعلقات، متوقع موڑ http://t.co/IndC0Lsehttp://t.co/Xl7vJhNj فوت شدگان کی جانب سے قربانی کرنا Twitter: http://t.co/2TzTBZGt http://t.co/YP5silQKمیں نے ایک waterwheel ہو ، رجوع اور چکھنے کے تم ، پانی کی چال کے طور پر جب تک. ~ http://bit.ly/97Tk75Learn a new word: "Applaud" in Urdu is واہ واہ (wah wah) http://t.co/qaW05FNALearn a new word: "Prepare" in Urdu is تیار کرنا (tayyar karna) http://t.co/omHUuO0Gاسمبلی اجلاس، نئے صوبوں کی قراردادایجنڈے میں شامل نہیں کر سکتے: ڈپٹی سپیک..http://www.dailypak.com/index.php?pag=detail&id=34036بزرگان راےونڈ نے اس خبر کی کہ عالم اسلام کے عظیم مبلغ حاجی عبدالوھااسرائیل کا امریکہ کے ساتھ مشترکہ جنگی مشقوں کا اعلان http://t.co/pHEQ2rO8میمو گیٹ کی محض تحقیقات ہونی چاہیے تھی،چیرمین تحریک انصافآپ کا نعتیہ رسالہ نعت رنگ دنیا بھر میں پڑھا جاتا ہے جو آج تک تمام نعتیہ رسالوں میں سب سے منفرد و اعلیٰ رہا ہے@Mushahid میمو: سنسنی خیز انکشافات read the article memogate very informative http://t.co/xRLhUrG7شہرِ ظلمات کو ثبات نہیں- کلیات حبیب جالب ( انقلابی شاعری) - http://t.co/fdba3E1fانسانی پنجر اور ہڈیوں کی ساخت اور قرآن مجید کی دعوتِ غوروفکر http://t.co/LTRivmI9ائر ہوسٹیس: stewardess: noun. Example sentence:میری بیٹی ہوسٹیس کے طور پر کام کرتی ہے.Translation:My daughter wo... http://t.co/x0EkzDY3باہر کے ایمان کے تین تحفے ، امید اور محبت ، سب سے بڑی محبت ہے. ~ Corinthians 13:13 بائبل http://biLearn a new word: "Ago" in Urdu is گذشتہ (guzishta) http://t.co/z2zisxksکیا خبر ہے اور کیا بے خبری ؟ http://t.co/6B1VQYgLسرفراز نواز شعیب اختر کےخلاف بھارتیوں کا ساتھ دینے لگے http://t.co/246SH1Dvغالب نہ کر حضور میں تو بار بار عرض ۔۔۔۔۔ ظاہر ہے تیرا حال سب اُن پر کہے بغیر@Mushahid میمو: سنسنی خیز انکشافات read the article memogate very informative http://t.co/xRLhUrG7بیادِ سڈنی: نئے زمانے کا ذکر ہے http://bit.ly/gbNY37جموں ممبران نے علاحدہ اسمبلی کا مطالبہ کیا http://t.co/neMZwmzJدو گھنٹے لگاتار ٹی وی دیکھنا، دل کے لیے خطرناک حال ہی میں کی گئی ایک تحقیق کے مطابق روزانہ دو گھنٹے سے زائد ٹی... http://t.co/abE78RWNہیرے کی کان میں ہیرے ہی ہوتےہیں‎: خلیفہ ہارون الرشیدکا ایک بیٹا تھا جس کی عمر 16 سال کے لگ بھگ تھی۔ بہت اچھی ترب... http://t.co/wvZq9Chvیونان میں میڈیا بھی مالیاتی بحران کی زد میں: یونان میں گھمبیر اقتصادی صورت حال کے مہیب سائے اب ملکی ذرائع ابلاغ ... http://t.co/JZpIVxW7صدر نے سیلابی پانی جلد نکالنے کی ہدایت کی ہے:شازیہ مری --http://www.dailypak.com/index.php?pag=detail&id=33946UrduBlogz.com -: جاوید نامہ:۳۔ منظوم اردو ترجمہ حصہ اول: تمہید http://bit.ly/i3nNQjانٹر نیٹ پر طبی معلومات: فائدے بھی، نقصانات بھی | صحت | Deutsche Welle | 02.01.2012 http://t.co/azEjJQWgہنگورجہ کے قریب مسافر وین کا گیس سلنڈر پھٹ گیا،4افرادزخمی، پولیسسفیر گروسمین: پاکستان کے عوام کو میرا پیغام ەے کە امریکە پاکستان کا دوست ەے اور پاکستان کے ساته شانە بشانە کهڑا ەے۔#Pakistan #terrorismارفع کریم کی فضا گیلانی نے عیادت کی،علاج کی ہر ممکن مدد کی پیشکش: نو سال کی عمر میں مائیکروسافٹ سرٹیفائیڈ پروفی... http://t.co/dWlL3O5V@DunyaTV پتان مصباح الحق کی بنگلا دیش کے خلاف دوسرے ٹیسٹ میں نصف سنچریصدر اوبامہ اور مشیل اوبامہ کی جانب سے اسٹیو جابز کے انتقال پر اظہارٍ افسوس۔ اسٹیو امریکہ کے عظیم موجدوں میں سے ایک تھا۔ http://t.co/eR1xFhC5#SecStateمیں ذاتی طورپر یہ سمجھتی ہوں کہ یہ تعلقات دونوں ممالک کے لئے نہیات اہمیت کے حامل ہیں : سیکریٹری کلنٹناسامہ کا قتل انسانیت کیخلاف جرم ہے، آئی سی سی میں تحریری شکایت: http://t.co/CpyR7CX via @aajdailyوینا ملک کو غلطی کا احساس،کہتی ہیں تصاویر کھنچوا کر غلطی کی Daily Jang Date : 12/28/2011 Updated at 0835 PST... http://t.co/Qt3ZnYD0Breaking بھٹو ریفرنس کیس، سپریم کورٹ نے توہین عدالت کے شوکاز نوٹس پر بابر اعوان کی میڈیا ٹاک کا نوٹس لے لیا http://t.co/95XLmZi9دل کی وجوہات اس وجہ سے نہیں سمجھتی ہے. ~ جاک Benigne Bossuel http://bit.ly/bsBAxp مصنوعی جلد کی تیاری میں مثبت پیش رفت جرمنی میں سائنسدانوں نے ایک ایسی مشین کی تیاری میں کامیابی حاصل کی ہے جو... http://t.co/yNrElqPsذیابیطس کے مرض کی نئی دوا ذیابیطس کے بین الاقوامی ادارے انٹرنیشنل ڈائباٹیز فیڈریشن کے مطابق 2030ءتک دنیا میں ہر... http://t.co/IpOTFUXnاسرائیلی فلسطینی بات چیت ٹھوس نتائج کے بغیر اختتام پذیر: عمان میں اسرائیلی اور فلسطینی وفود کے درمیان ایک سال سے... http://t.co/5DBJolpWسال کے آخری لمحات اور 2011ء کے بہترین کرکٹ لمحات پر کچھ مزید لکھنے کی تیاری دو شایع شدہ تحاریر http://t.co/wsfpdygh و http://t.co/j6yBXzleحروں کے روحانی پیشوا پیر پگارا علاج کیلئے لندن روانہ: حروں کے روحانی پیشوا پیر پگارا علاج کیلئے لندن روانہ http://t.co/jf2PspGpمتنازع پریس کانفرنس:بابراعوا ن سمیت دیگر افراد کوتوہین عدالت کے نوٹس جاری|اردو سکائی نیوز، صبح کا اخ http://t.co/vevbhHxqStocks: ایف بی آر:حصص بازار کے دولتمند سرمایہ کاروں کے خلا... http://t.co/5NoKhOkعقل سے ذات ، ماورا اس کی کیا لکھے گا قلم ثنا اس کی@UrduWriter وہ لا محدود ہے اور ہم لوگ اس کی پوری معرفت حاصل کر ہی نہیں سکتے۔جس خدا کا عرفان مکمل طور پر حاصل ہوجائے وہ خدا لامحدود نہیں رہتامحبّت نہ کسی مرد کا حق ہے نہ کسی عورت کا ......... یہ تو حسن کا حق ہے اور اسے یہ حق بلا تکلف ملتا ہے ، مرد نے اس... http://t.co/tulLHXgoکچھ کرنے ، اسے پیار سے یا اسے بالکل بھی نہیں کرتے میں. ~ مہاتما گاندھی http://bit.ly/bOrdmo اسلام ایک مکمل ضابطہٴ حیات ہے۔ http://t.co/jbKaCSR9 #Uncategorized #Complete_Code #Islam #life #Syed_Shahrukh_Kamalكفار كےتہواروں كےلئے تيا كردہ كھانے كھانا جائز نہيں http://t.co/naRBR0oa Twitter... http://t.co/xCprN5UDUltra Mind | سوچنے کاایک نیاانداز۔ حیرت انگیز چند لمحات میں زندگی تبدیل | Urdusky Network, Pakistan. http://t.co/OP6V1u4uكفار سے مشابہت كے ضوابط و اصول http://t.co/W1VVmZtq Twitter https://t.co/2TzTBZGt http://t.co/eY9lA2Rnجب تک کہ: unless: conjunction. Example sentence:جب تک آپ اسے ایک کہانی نہیں پڑھیں گے وہ سونے کے لئے نہیں جائے گا... http://t.co/preixENRفرحت عباس شاہ کی ایک نظم: "اذیت"کتنے چہرےدن بھر دھوکہ دیتے ہیںکتنی آنکھیںدن بھر دھوکہ کھاتی ہیںکتنے دلہر روز نئی... http://t.co/oVA0sisvبيوى نے ماضى كے كچھ اعترافات كيے تو اب خاوند اسے عار دلاتا اور طعنے د يتا اور گاليا نكالتا ہے... http://t.co/P9kOwq7eگڈ مڈ مارننگ ۔۔۔۔: مدت ہوئی یہ با ت توپرانی ہوگئی کہ جب غریب آدمی مرغی کھارہا ہو تو سمجھ جائیے کہ یا تو آدمی ب... http://bit.ly/lDQoPcدوا سازی کے یورپی نگران ادارے کو آئندہ برس درخواستوں میں اضافے کی توقع یورپ کے دوا سازی سے متعلق نگران ادارے... http://t.co/RYrxC6tPحبیب بینک انتظامیہ کراچی خیبر پختونخوا کے ارضی حقائق سے ناواقف http://t.co/6LOiai3wامداد کو مطلع کرنےسے مشروط کرنا کوئی نئی بات ہے اور نہ ہی یہ شرائط پاکستان کے لئے خاص ہیں۔ http://t.co/ufY8JR0Uملک کی مقتدر قوتوں کو زوالفقار مرزا کے بیان پر سنجیدگی سے تحقیقات کروانی چاہیے .بجلی میں مذید چار فیصد اضافے کی سمری وزیراعظم کو ارسال‘ بجلی 14 فیصد مہنگی کی جائے گی پیپلز پارٹی اور ایم کیو... http://t.co/ujk3Cynmتبدیلی کے نعرے کی وجہ سے عمران خان کے ساتھ آیا،جاوید ہاشمی|اردو سکائی نیوز 24 دسمبر 2011 http://t.co/Jicb5TyOسپریم کورٹ نے وکیل بابر اعوان کو ایک اور اظہار وجوہ کا نوٹس جاری کرتے ہوئے کہا ہے کہ کیوں نہ اُن کا لائسنس منسوخ کردیا جائے۔UrduBlogz.com -: امید http://bit.ly/icNg1aآئی ایس آئی ،سی آئی اے کے ستاسی اہلکاروں کو ویزے دینے پر رضا مند: http://t.co/ics4gtR via @aajdailyپرانے ریکارڈز سے نئے اسپیکرز http://t.co/hrPMyY2e http://t.co/Z1GOQpCXسی این جی اور ایک مہینے کی چھٹی http://t.co/5V1NOlmSاپنے پوتے سے باتوں کے دوران چاند نکل آیا، جسے دیکھ کر وہ بہت خوش ہوا۔ وہ بولا:دادا جس طرح ہم بتیاں بجھا کر سو جاتے... http://t.co/VdoVHPMnاپنے سامراجی آقا امریکہ کے حکم پر اپنے برھمن آقا مہاراج بھارت کو تجارت کیلئے پسندیدہ ملک قرار دینے والے، صاحب ِ... http://t.co/iZQyIXDV@noumaan_ ہاہاہا خوب ۔۔۔ چلیں آپ کا یہ جملہ میں کسی اگلے جلسے کے لیے محفوظ کر لیتا ہوں۔ وہاں آپ سے رائے طلب کریں گے :)New Post : : حضرت ابو ہریرہ رضی الله عنہ سے روایت ہے کہ: رسول الله صلی اللہ علیہ وآلہ وسلم نے فرمایا: ایک آدمی ... http://t.co/URG5MWUIبھارتی طالب علم کا قتل، برطانیہ میں نوجوان پر فرد جرم عائد | حالات حاضرہ | Deutsche Welle | 02.01 http://t.co/keaWVmgjمنانے روٹھنے کے کھیل میں ہم ۔۔۔۔ بچھڑ جائیں گے یہ سوچا نہیں تھااس بار پاک انگلینڈ سیریز کسی تنازع کا شکار نہیں ہوگی، محسن خان: http://t.co/uPSzI09DSarmayakar: روس،تھائی لینڈ اور میکسیکو نے 6ارب ڈالرمالیت کا سو... http://t.co/Qxn08IHروزنامہ امروز ایک عرصہ پہلے بند ہو چکا ہے،اور اقبال ساغر صدیقی اس کے ملتان ایڈیشن کے ایڈیٹر ہوا کرتے تھے۔یوم اقبال پر حضرت اقبال رحمۃ اللہ علیہ کی زمین میں میری اک غزل احباب کی نذر اس شہر ِ صدآشوب میں اتری ہے قضا دیکھ... http://t.co/4yr6cs7Cیہ ٹھیک ہے کے تم ایک گلاب نہیں بن سکتے لیکن اس کا یہ مطلب تو نہیں کے اگر تم گلاب نہ بن سکو تو پھر ایک کانٹا بن... http://t.co/2GuxZHBIسوات میں طالبان کےدور میں جدوجہد کرنیوالی ملالہ کو ایوارڈ کیلیےنامزد کیا گیا تھاPoetry by Hazrat Mehboob-e-Zaat (1898 – 1961) (علی حق کے پیارے) http://t.co/0rnPcXIj #Poetry_by_Hazrat_Mehboob_e_Zaatعدم تشدد کے مرکز میں محبت کے اصول کھڑا ہے. ~ مارٹن لوتھر کنگ http://bit.ly/aZ55OH سنجیدہ: serious: adjective. Example sentence:بیس افراد شدید طور پر زخمی تھے.Translation:Twenty people were serio... http://t.co/c0ozKIdKنویںذوالحج صبح کی نمازکےبعدسےتیرہ ذوالحج کی نمازعصر تک ھرنمازکےبعدیسر کے بال بھی دل کی بیماری کی اطلاع دے سکتے ہیں۔ طبی محققین نے دل کے امراض کے حوالے جو جستجو کا سلسلہ جاری رکھا... http://t.co/cS5NcEszکوئٹہ میں ارباب خان روڈ پر دھماکا، پندرہ افراد ہلاک،اکیس زخمی، دہشت گردی کا مرکز خیبر پختون خوا سے بلوچستان منتقل... http://t.co/MqzAGoPgPolitics Articles : http://t.co/bnQmvDLy - پی پی پی کے ادوار اور انجام۔۔۔۔ http://t.co/fZ4cO978Daily Express News Story: http://bit.ly/fgVGaU via @addthis کیا دیکھ! عبداللہ طارق سہیلچائے اور کافی ’امراض قلب سے بچاتی ہیں‘ ہالینڈ کے سائنسدانوں نے اپنی 13 برس پر محیط ایک تحقیق کے بعد کہا ہے کہ... http://t.co/AChHdYSrبرطانیہ کو سائنس کا تعلیمی مرکز بنانے کیلئے سائنس یونیورسٹی کا قیام زیر غور ہے: یونیورسٹی برطانیہ میں ہائی ٹیک ... http://t.co/mfRCbvCjزندگی دردِ سر ہوئی حاتم۔۔۔۔ کب ملے گا مجھے پیا میرا ؟ (شاہ حاتم)تبدیلی دستک دے رہی ہے http://t.co/ovRc2dIFغرورِ حسن میں شاہی جلال ہوتا ہے پری رُخوں کا سبھی کچھ کمال ہوتا ہےبندگی صرف اللہ کی اور والدین کے ساتھ حسن سلوک __________________ اور آپ کے پروردگار نے فیصلہ کر دیا ہے کہ تم اس کے... http://t.co/GKUMcJujمر ید کے صدر پو لیس نے مغوی صحافی فاروق اسلام کمبوہ کا سراغ لگا نے کے بعد 1ماہ قبل اغواء ہو نے والے تا جر کا بھی سراغ لگا لیاسیکریٹری کلنٹن اسلام آباد میں شەریوں کے سوالوں کے جواب دے رەی ەیں۔ دیکهنے کے لئے آئیے: pic.twitter.com/R5itovNT http:// go.usa.gov/9Jh============================== کیا ہوا تھا پھر مجھے میں جانتا نہیں بس اتنا جانتا ہوں مجھے عشق ہوا تھا احمد حسان... http://t.co/MCkEx0yrکیا ایسا کرنا جائز ہے؟ http://t.co/j2FJV1h@husainhaqqani جب اُس نے خاک اُڑانے کا ارادہ کرلیا ہے/ تو ہم نے دل کے صحرا کو کشادہ کر لیا ہےاحباب کو مطلع کیا جا رھا ھے کہ کل سے متحدہ قاتل موومنٹ اور قادیانی کلٹ کے مشترکہ ہیکر اٹیک کی وجہ سے میری نیوز... http://t.co/UAndOr4Xداڑھی پائنچے پر بھی اسلام کا مذاق اڑانے والے کتنی شدت کے ساتھ اپنے مرنے والوں کو 'شہید' قرار دے رہے ہیں۔ 'شرم تم کو مگر نہیں آتی'Sarmayakar: پاکستان اور آئی ایم ایف کے مذاکرات 11 مئی کو دبئی ... http://t.co/f1QDCczدو جانوں پر ایک سوچا ، دو دل ہے کہ ایک کے طور پر ہرا دیا. ~ فریڈرک ڈنڈی http://bit.ly/cjU6tb عالمی ایجنسی برائے ایٹمی توانائی کی مسئلۂ ایران کے تصفیہ کے لیے کوششیں http://t.co/ucJJVtC8 #Urduملاقات میں خطے کی صورتحال پر تبادلہ خیال کیا جائے گا http://t.co/l84cW7Vpاب کہاں ہیں نگہِ یار پہ مرنے والے ...... صورتِ شمع سرِ شام سنورنے والے ۔۔۔۔۔ عزم بہزادکرنے کے لئے کسی سے محبت کرتے اس طرح خدا نے اسے ارادہ دیکھ کر ہوتا ہے. ~ Fyodor Dostoyevsky http:/کشمیر کے لوگوں کا زرداری [ پی پی پی ] مخالف قوتوں کے منہ پر ووٹوں کا تھپڑ. جیو عوامUrduBlogz.com -: بارش ۔۔۔۔۔۔۔ http://bit.ly/er9f7APolitics Articles : http://t.co/bnQmvDLy - سیاست سے پاک ،صحافیوں کا ملاپ، پاک بھارت۔۔ http://t.co/AenCTEWJLearn a new word: "Locate" in Urdu is مقرر کرنا (muqarrar karna) http://t.co/AArYIaChمحبت پر غالب کی خواہش ہے irresistibly خواہش ہو. ~ لوئس Ginsberg http://bit.ly/9kKAJy ایران کا طویل فاصلے تک مار کرنے والے میزائل کا کامیاب تجربہ: میزائل خلیج میں کسی بھی ہدف کو نشانہ بنانے کی صلاح... http://t.co/pxHANRUmحالیسہ مسودہ قانون کے تحت پاکستان کی فوجی امداد میں 70 کروڑ ڈالر کی کٹوتی نہیں کی گئی۔ http://t.co/ufY8JR0UUrduBlogz.com -: چھلی http://bit.ly/hcx8hVتعلیمی اداروں میں موبائل فون پرپابندی کی قرارداد منظور --http://www.dailypak.com/index.php?pag=detail&id=33928http://t.co/dGKPpmjG ذبيحہ حلال ہونے كے ليے بسم اللہ كى شرط Twitter:... http://t.co/AOc4OtNfنمونیہ سے بچاؤ کی نئ دواسےپاکستان میں شرح اموات میں65 فیصد کمی متوقع دنیا بھر میں نمونیہ سے بچاؤ کا عالمی دن 12... http://t.co/306OLJebمحبت رسول ایمان میں سے ہے http://goo.gl/fb/Vl2Ofجیب کترا: pick-pocket: noun. Example sentence:پولیس نے کل رات ایک جیب کترے کو گرفتار کیا.Translation:The police ... http://t.co/U0uHTAlH@M_Saad_K بہت سارے لوگوں کو موقع دیا ہے۔ اور وہ لکھتے بھی رہتے ہیں۔ آپ پرانی تحاریر دیکھ سکتے ہیں۔ لکھاری کا نام سرخی کے نیچے ہوتا ہے۔احادیث متعارضہ اور ان کا حل http://t.co/8aaKKUXSکشمیر:کرفیو کا ایک اور دن - http://tinyurl.com/3555gqdرمضان کی نماز کے بارے میں کیا آیا ہے ؟ http://goo.gl/fb/wkThJبے تاب جی کو دیکھا دل کو کباب دیکھا جیتے رہے تھے کیوں ہم جو یہ عذاب دیکھا پودا ستم کا جس نے اس باغ میں لگایا... http://t.co/wWyqD8Ywبرقع اور پگڑی میں بم چھپانا اسلامی اقدار کے منافی ہے، کرزئی: http://t.co/cQNMni3 via @aajdaily============================== بس بہت ہو گیا تماشہ اب اور نہ ہو سکے گا اب کچھ بھی یہ محبت، وفا، خلوص، لگن بھاڑ... http://t.co/TEusBDPwایجنٹ سمیت تینوں کھلاڑیوں کو جیل بھیج دیا گیا http://t.co/Esculi37السلام عليكم و رحمة الله و بركاته ___صبح بخير دوستو! القرآن: اور جو کوئی اطاعت کرے الله اور رسول کی تو یہ لوگ ان... http://t.co/YUUJ4xM3مٹ جائے گی مخلوق تو انصاف کرو گے http://t.co/SDAMuIyLearn a new word: "Interest" in Urdu is اثر (asar) http://t.co/F8Bg41BAآج اسلام آباد میں شدت پسندی کے خلاف پاک ۔امریکە تعاون پر #SecStateسیکریٹری کلنٹن کا بیان دیکهنے کے لئےکلک کریںhttp://t.co/UynqlPe2UrduBlogz.com -: محبت جب ہو جائے ۔ ۔ ۔ http://bit.ly/hOEqtqNew Post : Join & Share plz News Update رھیے با خبر: Join & Share plz News Update رھیے با خبرNews Update رھیے... http://t.co/MpGOB7sVعوام الناس ھوشیار ھوشیار : ہا ئیکو رٹ کے حکم امتناعی کے باوجو زرداری کرپشن کنگ کے زیر سرپرستی چلنے والے کرپشن ٹول... http://t.co/XMOeEYiOکلیوں پہ محوِ خواب ہیں ، خوش خواب تتلیاں شبنم میں چاند تکتی ہیں ، مہتاب تتلیاںموم کے کاغذ … کالم … جاوید چوہدری http://goo.gl/fb/oMcLWچین میں شمسی توانائی کے شعبے کی بڑھتی مشکلات سالِ نو کے موقع پر اعلان کیا گیا کہ چینی کمپنی LDK نے جرمن شہر... http://t.co/NOXQTgdsاحمد فراز…شاعری سے ایس ایم ایس تک !!! http://goo.gl/fb/McZcmوزارت قانون کی رائے کے بعد نعیم خالد لودھی کوعہدےسےہٹایاگیا،وزیراعظم ہاوسNew Post : Join & Share plz: Join & Share plzNews Update رھیے با خبرCommunity http://t.co/7f5UgRZsاردو محاورات کی لغت http://t.co/J1YAxab via @AddThis"ﯾﮧ ﻭﻗﺖ ﺑﮭﯽ ﮔﺬﺭ ﺟﺎﺋﮯ ﮔﺎ": ﮐﺴﯽ ﺑﺎﺩﺷﺎﮦ ﻧﮯ ﺍﭘﻨﮯ ﻣﻠﮏ ﺳﮯﺗﻤﺎﻡ ﭘﮍﮬﮯ ﻟﮑﮭﮯ،ﻋﻘﻠﻤﻨﺪ ﺍﻭﺭﻋﺎﻟﻢ ﻗﺴﻢ ﮐﮯ ﻟﻮﮔﻮﮞﮐﻮ ﺟﻤﻊﮐﯿﺎ ﺍﻭﺭ ﺍﻥ ﺳﮯ... http://t.co/ZnafdXeY#SecStateسیکریٹری کلنٹن فاکس نیوز پر:ەماری پالیسی جدوجهد بات چیت اور تعمیر هے دوستوں کےساته امن کی ضرورت نهیں ەوتی #Afghanistan #PakistanUrduBlogz.com -: دنیا بھر میں مادری زبانوں کا عالمی دن منایا گیا http://bit.ly/gyS4D0http://www.nawaiwaqt.com.pkتلاشی غیر قانونی قرار دینے پر برطانوی مسلمانوں میں خوشی کی لہرپرویز مشرف کی رواں ماہ کے آخر میں پاکستان واپسی کا فیصلہ موخر: پرویز مشرف کی رواں ماہ کے آخر میں پاکستان واپسی ک... http://t.co/DjcMI1SK’ریلوے کا جدید نظام ہیک ہو سکتا ہے کمپیوٹر سکیورٹی کے ایک ماہر نے خدشہ ظاہر کیا ہے کہ ریل گاڑیوں کی پٹریوں کو... http://t.co/JBADwLQxپیپروں میں پاس کروانا ہو تو http://t.co/zyPCRBAo http://t.co/LZ6xe3uoکوئٹہ، نامعلوم افراد نے فائرنگ کر کے خروٹ آباد میں مرنیوالوں کا پوسٹمارٹم کرنیوالے پولیس سرجن باقر شاہ کو قتل کر... http://t.co/M9LY14xPStocks: اسامہ کی ہلاکت کے ایشیائی اسٹاک مارکیٹس پر مثبت اث... http://t.co/nSls277انٹر نیٹ پر طبی معلومات: فائدے بھی، نقصانات بھی انٹر نیٹ پر طبی صحت کے بارے میں معلومات تلاش کرنے والے افراد... http://t.co/6Uu79lAkNew Post : Join & Share Plz News Update رھیے با خبر: Join & Share Plz News Update رھیے با خبرNews Update رھیے... http://t.co/xWe2erIQمدارس کی مالی معاونت ،’اس حمام میں سب ننگے ‘ http://t.co/vUmtXNPtStocks: اسٹاک مارکیٹ کے سرمایہ کار کا بدترین دشمن کون؟ http://t.co/kHiuYmRLearn a new word: "Carbon" in Urdu is کوئلہ (koilaa) http://t.co/27kOYhTFنعت شریف – تیرے ہی در پر پڑا رہوں گا- http://nblo.gs/kdzTPNew Post : Join & Share plz: Join & Share plzNews Update رھیے با خبرCommunity http://t.co/iJ9Jx6j5مرد کے اندر عورت کی ترغیب فطری طور پر موجود ہے جب یہ ترغیب نیام سے نکل کر تلوار بنتی ہے تو زندگی کی وادی میں... http://t.co/Rm1p4ZHhکرنل قذافی منظر عام سے رو پوش ہو گیے ہیں .دل کے عارضے میں مبتلا بچوں کے والدین کے لیے خوشخبری امریکی حکام نے دل کے عارضے میں مبتلا بچوں کے لیے ایک ایسے... http://t.co/jyYC51O9ٓنئے سال کی آمد پر ٹھیک بارہ بجے لوڈشیڈنگ نے نئے سال کا استقبال کیا اور شہر تاریکی میں ڈوب گیا۔۔۔۔۔۔۔ میرے ارد... http://t.co/Bi0bEDCoمصر ،پارلیمانی انتخابات میں اخوان المسلمین کی برتری مستحکم ہو گئی ہے: حسنی مبارک کو ایک بار پھر پنجرے میں بند کر... http://t.co/G7nUmPT3ایک بچے کی ضرورت کے ساتھ پیدا ~ محبت کی جائے گی اور یہ کبھی نہیں outgrows. ~ فرینک ی کلارکخدا کرے کہ مری ارض پاک پر اترےآرمی چیف جنرل اشفاق پرویز کیانی نے کہا ہے کہ ملک کو داخلی محاذ پر سنگین خطرات اور چیلنجز درپیش ہیں،افواج نے... http://fb.me/GId5JE69ہم بھی دشمن تو نہیں ہیں اپنے.... غیر کو تجھ سے محبت ہی سہیکوئٹہ میں ارباب خان روڈ پر دھماکا،10افراد ہلاک،21زخمی: دھماکا میر نصیر مینگل کے بیٹے کے گھر کے باہرموجود ایک گاڑ... http://t.co/2kUcZZsdامریکی صدر کے خصوصی نمائندہ برائےافغانستان و پاکستان مارک گراسمین کی اسلام آباد آمد اور پاکستانی قیادت سے ملاقات۔ http://t.co/sL0HdyBWاُردو جاوداں "urdualive" J&K's fisrt online Urdu journal, is ready to launch.New Post : Join and Share plz: Join and Share plzNews Update رھیے با خبرCommunity http://t.co/ER6McU0Gالفاظ اور جملے میں کوئی فرق نہیں مگر وہابی كى توحید اور ھے قلندر كى توحید اورLearn a new word: "Lighten" in Urdu is جلانا (jalaana) http://t.co/hGsDsldRسمارٹ فون ایپلیکیشن، جنسی حملے کی صورت میں مدد آج بدھ کو بھارتی دارالحکومت نئی دہلی میں سمارٹ فونز کے لیے ایک... http://t.co/5rsTLIsShttp://t.co/dxQdbM0d قربانی ذبح کرنے والے وکیل پرچاند نظر آنے کے بعد سرمنڈانے میں کوئي حرج نہیں... http://t.co/wtnGWrNYہم فقیروں سے دوستی کرلو: http://t.co/rOByZiz via @aajdailyNew Post : Join & Share plz News Update رھیے با خبر: Join & Share plz News Update رھیے با خبرNews Update رھیے... http://t.co/oEAuFTLUانگوٹھوں اور انگلیوں کے نشانات کی طرح انسان کی چال بھی ذریعہ شناخت بن سکتی ہے http://t.co/rRxjxHTeکچھ عشق تھا کچھ مجبوری تھی سو میں نے جیون وار دیا میں کیسا زندہ آدمی تھا اک شخص نے مجھ کو مار دیا عبید اللّہ علیماسلام علیکم و رحمتہ الله و بر کا تہ' جمعتہ المبارک , اس اٌمید اور دٌعا کے سا تھ کہ آپ کا یہ جمعہ آپ کے لیے خیرو... http://t.co/ueQPcghFﻓﻮﺭﯼ ﺧﺒﺮ ﻣﺴﻠﻢ ﻟﯿﮓ ﮐﮯ ﺻﺪﺭ ﻧﻮﺍﺯ ﺷﺮﯾﻒ ﮐﺎ ﮐﮩﻨﺎ ﮨﮯ ﮐﮧ ﻣﯿﻤﻮ ﮐﮯ ﺣﻘﺎﺋﻖ ﺟﺎﻧﻨﮯ ﮐﯿﻠﺌﮯ ﺳﭙﺮﯾﻢ ﮐﻮﺭﭦ ﮔﺌﮯ، ﻋﻮﺍﻡ ﮐﻮ ﭘﺘﮧ ﭼﻠﻨﺎ ﭼﺎﮨﯿﮯ ... http://t.co/eleSQZDDپارٹیکل فزکس پر امریکی برتری کا دور ختم امریکی شہر بتاویا میں ایٹمی ذرات کو ٹکرانے والی مشین ’ٹیواٹرون پارٹیکل... http://t.co/uSkZ05lGکشمیر میں پہلا بڑا ریل حادثہ،درجنوں زخمیورزش کا تعلیمی کارکردگی سے بھی گہرا تعلق ہے ،طبی ماہرین: طبی ماہرین کے مطابق ورزش سے ذہنی دباؤ میں کمی اور موڈ ... http://t.co/21KLfk68Learn a new word: "Vase" in Urdu is دان (guldaan) http://t.co/KZeT401r================================= نہیں کیا ہے جو وہ کر جائیں؟ اپنی باتوں سے ہی مکر جائیں؟ ظلم اِتنا نہ ہم پہ کر... http://t.co/WWVSLFECبینظیر مرحومہ کے حوالے سے ھفتہ بینظیر منایا گیا تو عوام کیلئے بجلی و سوئی گیس کی بے قاتل مفلس لوڈ شیڈنگ لایا... http://t.co/StHfqa8pBreaking News کوئٹہ :ضلع بولا ن کے علاقے مچھ میںدھماکہ سنا گیا -- http://t.co/y63pyhj3بندگی و عبادت | Urdusky Network, Pakistan News, Online Urdu News Paper, Urdu Magazine, Urdu Poetry,. http://t.co/6s2KoDN6UrduBlogz.com -: سورج مُکھی ۔۔ http://bit.ly/el362tایل پی جی گیس کی قیمت میں اضا فہ --http://www.dailypak.com/index.php?pag=detail&id=33930UrduBlogz.com -: خواتین اور بلاگنگ http://feedproxy.google.com/~r/anqasha/~3/7RgiCKfNtak/blog-post_24.htmlReading Jamal_e_Taqribat_جمالِ تقریبات on Scribd http://scr.bi/f54UQn #readcastاللہ تعالیٰ نے کرہ ہوائی کو ایک محفوظ چھت بنایا ہے http://t.co/IlHh47vTتاثیر کی برسی، سرکاری طور پر خاموشی: گورنر سلمان تاثیر کی پہلی برسی کے موقع پر پیپلز پارٹی کی طرف سے سرکاری طور ... ‎http://t.co/0dMv7kRE‏يه کہتے ھیں كه رب بغیر سبب ھر چیز پر قادر ھے مگر جب صوفی نے عقیدہ سنایا كه هدايت صرف اللہ دینے والا ھے، تبلیغ و... http://fb.me/11ALWHvw0بے شک اللہ تمہارے اعمال سے باخبر ہے۔@iamadnanshahid جب سے سنڈے میگزین میں ذکر کا پتہ چلا ہے تو سوچ رہا تھا کہ کسی نے مجھے کیوں نہیں بتایا۔ کاش وقت پر یہاں آتا تو پتہ چلا جاتا۔محبت کیا ہے جب تم کسی کی آنکھوں میں دیکھو اور ان کے دل دیکھ کر. ~ جل پیٹی http://bit.ly/cwgSau مہاجر قومی موومنٹ کے رہنماآفاق احمد جیل سے رہا http://t.co/DJoKbsB9 viaUrduBlogz.com -: پھنس گئے بچّو http://bit.ly/hOgeluایک بار قائد اعظم انگلش میں تقریر کر رھے تھے ، ایک دیہاتی بہت انہماک سے سن رھا تھا ، پاس بیٹھے ایک صاحب نے بڑی... http://t.co/QnhtnML6گرمائی ایجی ٹیشن کی ہلاکتوں میں ایک اور کا اضافہ http://wp.me/pK9kd-cMپاکستان کو ایک روشن مستقبل دینا ہوگا:فا رو ق ستا ر --http://www.dailypak.com/index.php?pag=detail&id=33989مرد کو تو خدا سے وصال کا شوق روز ازل سے ہے ، لیکن ہم عورتیں کہاں جائیں - ہم کس دیوار سے سر پھوڑیں اور کس کا سہارا... http://t.co/82c9GNXhکیمپنگ کےلئے جانا: to go camping: expression. Example sentence:میں ایک بچے کے طور پر کیمپنگ کرنے جاتا تھا.Transl... http://t.co/CAGdqW53،ان کی مغفرت کی دعا کرتا ہوں۔ اللہ تعالیٰ ان کے درجات بلند فرمائے۔کیا ہوا بو لو یار@sumairariazآنے والی اسپائیڈر مین کا ٹریلر جاری: http://t.co/g66kFpY via @aajdailyکنزرویٹو پارٹی کے بیشتر ارکان برطانیہ کی یورپی یونین سے علیحدگی کے حامی: ایک چوتھائی یعنی 24 فیصد جواب دہندگان ی... http://t.co/fIQBRfpeبحث: کچا دودھ، پکا دودھ http://t.co/jXmQSvh via @URDUVOAمیموگیٹ سکینڈل، جیمز جونز کا بیان حلفی سپریم کورٹ میں جمع http://t.co/pTmIGtjM viaسود http://t.co/RyqXMBG0UrduBlogz.com -: میراتھن دوڑ جیتنے والا دنیا کا پہلا روبوٹ http://bit.ly/gx6SZBچوری اور فراڈ کے چار بڑے کیسوں میں ملوث شخص کو آڈیٹر جنرل آف پاکستان بنا دیا گیا ہے ۔ عمران خانNew Post : Join & Share plz...: Join & Share plz...News Update رھیے با خبرCommunity http://t.co/GuFADi4iکابل میں خواتین کا مردوں کے خلاف مظاہرہ http://t.co/dBHJk2oصدر مسلم لیگ(ن)نوازشریف کی سیاسی رہنماؤں سے ملاقاتطـوق نے ماتم کِیا اور بیـڑیاں رونے لگیں ......!! صبر پہ سجـاد کے خود سختیاں رونے لگیں...!!UrduBlogz.com -: یارانہ http://bit.ly/gdQXMkPakistan News Urdu, الیکشن کمیشن 31دسمبر تک انتخابی فہرستیں مکمل کرے، چیف جسٹس|اردو سکائی صبح کا اخب http://t.co/dlquMYlshttp://t.co/HT07BxV4 حج كے فوائد Twitter: http://t.co/2TzTBZGt http://t.co/MHBv7lnZکوئٹہ میں جمعہ کوہونے والےبم دھماکے کے الزام میں پولیس نے قوم پرست رہنماؤں خیربیار مری اورجاوید مینگل کے خلاف مقدمہ درج کرلیا ہے۔آگاہ اپنی موت سے کوئی بشر نہيں، سامان سو برس کا پل کی خبر نہيں، جاگنا ہو جاگ لے افلاک کے سائے تلے، حشر تک سوتا رہے گا خاک کے سائے تلے،ریاض: سربراہ ادارہ انسداد بدعنوانی محمد الشریف کی صحافیوں سے گفتگوبلدیاتی نظام پر پیپلز پا ر ٹی اورایم کیو ایم کور کمیٹی کا اجلاس --http://www.dailypak.com/index.php?pag=detail&id=33983جنات کا پوسٹمارٹم قرآن وسنت کی روشنی میں http://t.co/v0ar5CUEسنگاپور کے حکمران، بھاری تنخواہوں میں کمی کا فیصلہ: سنگاپور ایک چھوٹی سی شہری ریاست ہے مگر وہاں حکمرانوں کی تنخو... http://t.co/TP3dKv9jکلر سلورفل اوریجنل زیرو میٹر کنڈیشن 38ہزار کلو میٹرچلی ہوئی گلشن اقبال موبائل نمبر…0345-6188669 کیش میمو2798…………………شامی فورسز کا مظاہرین کے خلاف ''کیل بموں'' کا استعمال، 32 ہلاک: الدوما میں ایک لاکھ سے زیادہ افراد نے صدر بشار ا... http://t.co/mRU3KvPtزندگی اور محبت ہم نے پیدا کی زندگی ہے اور محبت ہم رہتے ہیں. ~ لیو Buscaglia http://bit.ly/8YEnls پاکستان میں رواں برس پولیو کے مریضوں کی تعداد ایک سو پچھتر سے زائد دنیا بھر میں پولیو کے مرض کے خاتمے کی... http://t.co/VOZFkFssکانفرنس میں ملک کی تمام سیاسی قیادت کو شرکت کی دعوت ، ذرائع http://t.co/l84cW7Vpسی این جی کی قیمت میں 72پیسے فی کلو کمی --http://www.dailypak.com/index.php?pag=detail&id=33991سر تو بس جھکتا ہے سوئے بیت حرم http://goo.gl/fb/Rvf56چکوال،پیرچنبل میں حساس اداروں کےاہلکاروں کومارنےوالے4دہشتگردگرفتار،ذرائعLearn a new word: "Jewellery" in Urdu is زیور (zaywar) http://t.co/1DKL1HzFشاید ہم سب سوچتے ہیں کہ انقلاب کیسے آتے ہیں ۔ از ۔محمدثقلین رضا:  چہروں کی تبدیلی ضرور آئیگی لیکن انقلاب کی کہان... http://t.co/AHKnWZMvعدالتی سسٹم کی ضروریات کیوں پوری نہیں کی جاتیں ،جسٹس سرمد جلال عثمانی http://t.co/l84cW7Vpعالمی اخبار کی طرف سے دنیا بھر میں اپنے قارئین اور قلم کاروں کو 2011 کی مبارک باد: عالمی اخبار کے سید اکمل حسین ... http://t.co/xqIAXwr2UrduBlogz.com -: ورلڈ کپ کے میچ براہ راست دیکھنے کے لئے http://bit.ly/gPE1Ujاقتدار پر قابض ہونے کا تاثر گمراہ کن http://t.co/1BzlafBA via @URDUVOAسپریم کورٹ نے کہا ہے کہ قومی مصالحتی آرڈیننس سے متعلق عدالتی فیصلے پر عمل درآمد شروع نہیں ہوا تو خواہ کوئی بھی شخص چاہے جتنے بڑے عہدے...مجھ سے بچھڑ کے شہر میں گھل مل گیا وہ شخص ۔۔۔۔۔ ورنہ تو شہر بھر سے عداوت اُسے بھی تھی۔یہ گنجے بھی عجیب ہیں ، ڈینگی مچھر تو ان کے قابو میں آ نہیں رہا یہ قوم میں ٹیکسیاں بانٹ رہے ہیںSarmayakar: بجٹ: اثاثوں پر 1.25 فیصد ٹیکس عائد کئے جانے کا امک... http://t.co/S6YyYpmروزے کی جسمانی و نفسیاتی افادیت میڈیکل سائنس کی روشنی میں http://t.co/w9mLKZCm via @tariq_sohderviاللہ کی نشانیاں از ہارون یحیٰی http://t.co/MVJz6pxXرواں سال بھارت کی کارکردگی پر ایک جامع تجزیہ۔ ہندوستان سے سلمان غنی کے زوردار قلم کے ساتھ http://t.co/IJhNO9Ar’براؤز کا نقص فیس بک پر حملے کی وجہ سماجی روابط کی مقبول ترین ویب سائٹ فیس بک کی انتظامیہ کا کہنا ہے کہ سپیم... http://t.co/7QThkDsrعید آئی ہے . سب کو عید مبارک: السلامُ علیکم دوستوں، آپ سب کو ، آپ کے اہلِ خانہ کو، آپ کے محلے والوں کو اور تمام ... http://t.co/P44iGlRPUrduBlogz.com -: ٹی بریک!! ایک تعارف۔۔۔ایک پلیٹ فارم http://bit.ly/ea2YOrملک میں نگران حکومت، کیئر ٹیکرزیا مارشل لاء کی گنجائش نہیں، میمو سکینڈل کو سینیٹ انتخابات سے فرار کے لیے اچھالا... http://t.co/6liehhtBقوم آئین پرعمل کرکے ہی آگے بڑھ سکتی ہے: چیف جسٹس www.lahmaanews.comیوں غلط تو نہیں چہروں کا تاثر لیکن لوگ ویسے بھی نہیں جیسے نظر آتےہیںگیلانی اور زرداری کتے ملک کا جان چھوڑ دو حارامیہزارا وال کے افراد پرامن جدوجہد جاری رکھیں،الطاف حسیننبی کریم صلی اللہ علیہ وسلم نے فرمایا ,اے لوگو!خبردار تمہارا رب ایک ہے اور تمہارا باپ ایک ہے خبر دار!کسی عربی کو... http://t.co/NqmncPQعدالت کا احترام کرتا ہوں، وزیراعظم توہین عدالت نوٹس پر سپریم کورٹ میں پیش ہوگئے،سوئس کورٹ کو خط صدر زرداری کو آئینی استثنیٰ حاصل ہونے کی...بعض عورتوں كو كرسمس كےتہوار پر تحفے پيش كرنا http://t.co/n5ucdcBN Twitter... http://t.co/7coR60MGNew Post : Join & Share plz,: Join & Share plz,News Update رھیے با خبرCommunity http://t.co/20sG0tGNاس نے پیکر میں نہ ڈھلنے کی قسم کھائی ہے ۔ ۔ ۔ اور مجھے شوقِ ملاقات لئے پھرتا ہے۔ انور مسعودجنگل میں اس طرح کی اُداسی کبھی نہ تھی ۔۔۔ اے کارواں ٹھہر کوئی ساتھی بچھڑ گیاعدلیہ اور فوج سے حکومتی محاذ آرائی کم ہوئی ہے ، منورحسن: عدلیہ اور فوج سے حکومتی محاذ آرائی کم ہوئی ہے ، منورحسن http://t.co/4237kEUwپاکستان کے قبائلی علاقے باجوڑ ایجنسی سے تعلق رکھنے والے سترہ نوجوانوں کو طالبان نے رہا کردیا ہے۔جاویداقبال کا بلاگ » Blog Archive » 25 مسائل اور انکا اسلام http://javediqbal.ueuo.com/?p=555گرمیوں کے روزے: http://t.co/8AhWsYU via @aajdailyامریکا میں سب سے زیادہ بچے16ستمبر کو پیدا ہوتے ہیں،تحقیق: شرح پیدائش میں سب سے زیادہ کمی اپریل اور اگست میں ریکا... http://t.co/U5oRgCcaشکریہ رابعہ آپ کاکمشنرکراچی بھی دودھ ساٹھ روپے فی لیٹر نرخ پر فروخت کرانے میں ناکام --http://www.dailypak.com/index.php?pag=detail&id=33980حکیم اللہ محسود، ایمن الظواہری کا نام انتہائی مطلوب افراد کی فہرست میں موجودمخبروں کی تنہائی http://t.co/HLgLGfgh via @AddThisپی آئی اے ،18طیارے خراب، 14 پروازیں منسوخشریعت راه عمل ھے اور شریعت سے بالا تر ھو کرطریقت میں آ کے عمل کرؤ اور ناقص اولیاء كى سنگت میں طریقت میں زندگی غرق... http://fb.me/YJn46nLnUrduBlogz.com -: رباعی کے حوالے سے کچھ استفسارات اور میرے جوابات http://bit.ly/gxen5nمعروف فلسطینی صحافی ابو وردہ اسرائیلی فوج کے ہاتھوں گرفتار: واضح رہے ابووردہ ملیشیا میں الیکٹرانک میڈیا میں ڈاک... http://t.co/pPQjNXUQAnil Narendra انل نریندر: وینا ملک کا بھارت میں کیا کام ہے؟ http://t.co/PwjqTnspNew Post : ’’حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت ہے انہوں نے بیان کیا کہ میں نے رسول ا...: ’’حضرت عبادہ بن ... http://t.co/f9LI9cDYﺍﻟﻠﮧ ﮐﮯ ﻧﺎﻡ ﺳﮯ ﺟﻮ ﺍﺱ ﻟﮍﮐﮯ ﮐﺎ ﺭﺏ ﮨﮯ: ﺣﻀﺮﺕ ﺻﮩﯿﺐ ؓ ﺳﮯ ﺭﻭﺍﯾﺖﮨﮯ ﮐﮧ ﺭﺳﻮﻝ ﺍﻟﻠﮧ ؐ ﻧﮯ ﻓﺮ ﻣﺎﯾﺎ"ﺗﻢ ﺳﮯ ﭘﮩﻠﮯ ﻟﻮﮔﻮﮞ ﻣﯿﮟ ﺍﯾﮏﺑﺎ ... http://t.co/XXAUVEmgمصر : فوجی حکمرانوں کے خلاف پانچویں روزبھی مظاہرے جاری | Urdusky Network, Pakistan News, Online Urdu http://t.co/kFtvgZhQNew Post : Join & Share Plz News Update رھیے با خبر: Join & Share Plz News Update رھیے با خبرNews Update رھیے... http://t.co/QjWUuLg1تجهے مین نےحق دیا هے میرے دل سے دل لگی کا تو کهیل اس سے جب تک تیرا دل بهل نه جاءےغرور بیچیں گے نہ التجا خریدیں گے نہ سر جھکائیں گے نہ سر جھکا خریدیں گےرحمان ملک صاحب کی ''حب الوطنی'' کی اعلٰی تصویر کشی http://t.co/YJ4ayWd0ایک خیال کی رو میں ۔۔۔: ایک خیال کی رو میں ۔۔۔ کہیں سنا ہے گئے زمانوں میں لوگ جب قافلوں کی صورت مسا... http://bit.ly/kAfl61ہلال کمیٹی کا فیصلہ ماننا تمام لوگوں کا فرض ہے،مفتی منیب الرحمن: http://t.co/q4yGrbd via @aajdailyStocks: امریکی و یورپی حصص بازاروں میں مندی جاری http://t.co/3TyCyLFدعا کی اپیل http://t.co/KORopfWZ http://t.co/L2KjnsqcStocks: کراچی اسٹاک مارکیٹ میں زبردست تیزی http://t.co/Z4zYwt1امریکی صدر نے ایران کے خلاف اقتصادی پابندیوں کے بل کی منظوری دے دی: ایران سے بات چیت کے دیگر راستے بند نہ کرنے ... http://t.co/unTgn1odکچھ طاقتیں میموکیس پرکارروائی روکناچاہتی ہیں،چودھری نثاراللہ تعالیٰ نے کرہ ہوائی کو ایک محفوظ چھت بنایا ہے http://t.co/DFDxE19Y via @tariq_sohderviمرد نے غالبن پتھر اور دھات کے زمانے سے یہ طے کر لیا تھا کہ محبت کسی کے دل میں پیدا نہیں کی جا سکتی - یہ برمے سے،... http://t.co/IxlODe0Sجھوںپڑی: slum: noun. Example sentence:یہ ایک جھوںپڑی ہو گی، مگر یہ گھر ہے.Translation:It may be a slum, but it's home. http://t.co/4knn00F9جرمن صدر کا اسکينڈل جاری ہے: جرمن صدر کرسٹيان وولف نے ايک ٹيلی وژن انٹرويو ميں اپنے اوپر لگائے جانے والے الزامات... http://t.co/Ex4257smUrduBlogz.com -: مجھے تو کوئی پس پردہ دکھائی دیتا ہے http://bit.ly/hdDBn0جلد پر زیادہ بالوں سے کھٹمل کم کاٹتے ہیں ایک نئی تحقیق سے معلوم ہوا ہے کہ جن افراد کی جلد پر بال ہوتے ہیں وہ... http://t.co/SIDKkif2جشن آزادی 14 اگست 2011 عہد ساز دن - http://t.co/cBcTbx8UrduBlogz.com -: تابعداری اور التماس http://bit.ly/hHNtKRنیوزی لینڈ نے آسٹریلیا کو آخری کرکٹ ٹیسٹ میچ میں 7 رنز سے شکست دے کردو میچوں پر مشتمل سیریز 1-1 سے برابر کردیفونز سے کیمروں کی فروخت متاثر نوجوان نسل اپنے فون پر ویڈیو بنانا زیادہ پسند کررہے ہیں امریکہ میں کیے گئے ایک... http://t.co/LA6khMUKپہلے ٹی ٹوئنٹی میں بھارت کی شکست http://t.co/FH6G0PpX #Urduآئین کے تحت 11 فروری اور 11 مارچ کے درمیان انتخابی عمل مکمل کرنا ہوگا،کنور دلشادجموں و کشمیر میں ’لڑکیوں کی کمی‘ بھارت کے زیر انتظام مسلم اکثریت والی ریاست جموں و کشمیر میں حکومت نے الٹرا... http://t.co/AwgwoS56دھند کے باعث قومی ایئرلائن کی پروازوں کا شیڈول بری طرح متاثر --http://www.dailypak.com/index.php?pag=detail&id=33939http://bit.ly/hxhV1j via @addthis وغیرہ وغیرہ! عبداللہ طارق سہیلاینڈرائڈ کے لئے فونیٹک اردو کیبورڈ لے آؤٹ | م بلال م کی بیاض http://t.co/4A1DQq53 via @mbilalmpkسابق وزرا و اراکین پارلیمنٹ کی تحریک انصاف میں شمولیت http://t.co/mSR5voaN via @URDUVOAUrduBlogz.com -: جاوید نامہ ۴: http://bit.ly/dWvn5Aخواتین کا نشے کی جانب رجحان باعث تشویش http://t.co/LjDU3g5J via @URDUVOALearn a new word: "Madam" in Urdu is بیگم صاحبہ (begum saahiba) http://t.co/1ruHyeX1پاکستان اور بھارت نے ہر سال کی طرح اس نئے سال پر بھی اسلام آباد اور نئی دلی میں جوہری تنصیبات کی فہرستوں کا تبادلہ کیا ہے۔بڑبڑانا: to mumble: verb. Example sentence:ٹھیک ہے، میں یہ کروں گا. جان بڑبڑایا.Translation:"Fine, I'll do it." ... http://t.co/adNaEBalنو ٹیفکیشن نہ جا ری ہو نے پر پا ور ہاﺅ سز کو اربو ں رو پے کی ادا ئیگیا ں معطل --http://www.dailypak.com/index.php?pag=detail&id=33924گیراج سے شروع کردہ دینا کی کامیاب کمپنیوں میں سے ایک کمپنی بنا کراس نے امریکی اختراع کی روح کو مثال بنا دیا۔ اوبامہ http://t.co/eR1xFhC5کار آمد: useful: adjective. Example sentence:معاشیات پر یہ مضمون میری تحقیق کے لئے کافی مفید تھا.Translation:The... http://t.co/WQlBdMXx@JahangirKTareen میمواسکینڈل کےکرداروںکی اصلیت اورتاریخی حقائق(3) http://t.co/Nid0mJTrوفاقی وزیر داخلہ رحمان ملک کی کراچی ایئر پورٹ پر میڈیا سے گفتگودل ڈھونڈتا ہے پھر وہی، فرصت کے رات دن۔۔۔ بیٹھے رہیں تصورِ جاناں کئے ہوئےحسن چہرے پر نہیں ہے ، یہ خوبصورتی کے دل میں ایک روشنی ہے. ~ Kahlil Gibran http://bit.ly/95bRvX Sarmayakar: ٹیکسٹائل کے 3ارب ڈالر کے برآمدی آرڈرز منسوخ ہونے ک... http://t.co/XckDtIeنئے صوبوں کے قیام کیلئے وفاق اپنے مرکزیت مسلط نہیں کر سکتا: سینیٹر رضا ربانی..http://www.dailypak.com/index.php?pag=detail&id=34041چینی سیٹلائٹ نیویگیشن سسٹم فعال ہو گیا چینی سیٹلائٹ نیویگیشن سسٹم نے چین اور اس کے گرد و نواح کے علاقوں میں... http://t.co/yktWXNnHبندے کی درجات کی بلندی جہاد سے ہے۔ http://goo.gl/fb/ZpO0Gاللہ اللہ کرتے جو اللہ والا بن جائے اسے ولی کہتے ھیں اور علی علی کرتے جو خود علی بن جائے اسے قلندر کہتے ھیں كه... http://fb.me/VHD5gIAyجموں کشمیر میں 74ہزار کنال پر فوج قابض:سرکار http://t.co/eS3ebiOILearn a new word: "Self" in Urdu is خود (khud) http://t.co/20GzTgUnوزیرِ اعظم یوسف رضا گیلانی نے کہا کہ وہ چھوٹے صوبوں کے قیام کے مکمل حمایت کرتے ہیں اور جمہوریت میں فوجی عدالتوں کی گنجائش نہیں ہے۔ہر زندہ چیز کو پانی سے پیداکیاگیا ہے۔ القرآن http://t.co/8uOttcgF via @tariq_sohderviاے اہلِ زمانہ قدر کرو، نایاب نہ ہو، کمیاب ہیں ہمصدر مبارک بند پنجرے میں عدالت کے سامنےکہانی Download this Book On http://t.co/QtuhCMuپاکستان کے قبائلی علاقے باجوڑ ایجنسی میں حکام نے تصدیق کی ہے کہ چار ماہ قبل اغوا کیے گئے نوجوانوں کو طالبان نے رہا کردیا ہے اور وہ اپ...پاکستان میں ”انگریزیا“ کی بیماری | م بلال م کی بیاض http://t.co/5l9PHF6L via @mbilalmpkزندگی نہ ملے گی دوبارہ نے باکس آفس پر دھوم مچا دی: http://t.co/CfeWWc5 via @aajdaily Video Trailerپرویز مشرف رواں ماہ میں وطن واپس آ جائیں گے، بیرسٹر سیف: بیرسٹر سیف ۔ پرویز مشرف کی سیکیورٹی کیلئے حکومت سے کوئی... http://t.co/K5JWoSKAلاھور پولیس نے سابق وزیر اعلی دوست محمد کھوسھ کے خلاف اداکارە سپنا کے مبینہ اغواٴ کا مقدمہ درج کرلیا ہے۔"جمعہ کا ترک کردینا بدترین گناہِ کبیرہ ہے ! ----------------------------------------------- ”جس شخص نے تین جمعے... http://t.co/0pMLbV3Uجمال احسانی کی دو خوبصورت غزلیں: جو تو گیا تھا تو تیرا خیال رہ جاتاہمارا کوئی تو پُرسانِ حال رہ جاتابُرا تھا یا ... http://t.co/zfeWEUTKجدید سائنس کی ٹیڑھی اینٹ،کیا نظریہ اضافیت غلط ثابت ہوجائیگا؟ http://t.co/INyrGaeo via @URDUVOAان مقدمات کی دوبارہ تفتیش کررہے ہیں اور انھیں دوبارہ کھول رہے ہیں،آئی جی سندھ http://t.co/l84cW7Vpشخصیت مسیح ؑ بائبل کے آئینے میں http://t.co/UN5rMey5نون, پی پی اور ق لیگ کےرہنماؤں نے پاکستان تحریک انصاف میں شمولیت کیلئے رابطے تیزکردئیے ہیں : لوٹوں اور برساتی... http://t.co/zioAqWVUفیصلہ آپ کا http://fb.me/WuPG7FPUطبقات ابن ِ سعد مصنف : محمد بن سعد http://t.co/NXeq2Lx3مصر میں اسلامی تحریک (ڈاکٹر ساجد خاکوانی): http://bit.ly/igBeVc via @addthisBook Detail | Urdu to English Dictionary /اردو سے انگریزی لغت | urdu, Language ,Dictionary: http://t.co/9ugi7fA0 via @AddThisمنہ پھلانا: to pout: verb. Example sentence:تم نے اپنی بہن کو کیا کہا؟ وہ پھر منھ پھلا رھی ہے.Translation:What d... http://t.co/g4uSYKfQچونکہ تم سے محبت کے اندر ہوتی ہے ، تو خوبصورتی اور چراگاہیں اگتی ہیں. محبت کے لئے جاnews in urdu, news urdu, it news in urdu, urdu news in urdu, news paper in urdu, news paper urdu,نئے http://t.co/Yynz6GUbکافر ہے تو 'ریڈار' پر کرتا ہے بھروسہ ---- مومن ہے تو 'بند ریڈار' بھی لڑتا ہے سپاہیہیلنبرگ جرمنی میں اقبال کے نام پر رکھی گئی سڑک کی نشاندہی کرتا ہوا بورڈ ۔۔ http://t.co/1vjoIIOvخیر خیریت کی پوسٹ‌: ابھی ڈفر کا تبصرہ پڑھا تو احساس ہوا کہ واقعی مجھے دو مہینے ہوگئے ہیں‌ بلاگ پر کچھ بھی پوسٹ‌ک.. http://tinyurl.com/oqc3apآرمی چیف جنرل کیانی چین روانہ --http://www.dailypak.com/index.php?pag=detail&id=33974حکومت کی ناکام پالیسیوں میں حصہ دار نہیں بن سکتے ،پرویزالٰہی: حکومت کی ناکام پالیسیوں میں حصہ دار نہیں بن سکتے ،... http://t.co/PZnl6R1Cمیاں نواز شریف نے مائک مولن خط معاملہ کی جانچ کے لیے کمیشن کا مطالبہ کردیا ہے۔Hasb-e-Haal ﻓﻮﺭﯼ ﺧﺒﺮ 272 ﮐﻨﭩﯿﻨﺮﺯ ﻣﯿﮟ ﺳﮯ 35 ﻟﯿﻮﯾﺰ ﮐﯽ ﻧﮕﺮﺍﻧﯽ ﻣﯿﮟ ﭼﻤﻦ ﺳﮯ ﮐﻮﺋﭩﮧ ﺭﻭﺍﻧﮧ ، ﭘﯿﻨﭩﺎﮔﻮﻥ ﻧﯿﭩﻮ ﺳﭙﻼﺋﯽ ﺟﻠﺪ ﺑﺤﺎﻝ ﮨ... http://t.co/CmHVi8b2ا نتظامی بنیادوں پر پنجاب اور جنوبی پنجاب میں صوبے بنانے کی بات کی : فاروق ستار..http://www.dailypak.com/index.php?pag=detail&id=34020کیا ایسا کرنا جائز ہے؟ - http://t.co/RrelB1uسیکریٹری کلنٹن#SecState کےامریکە اور #Pakistan پاکستان میں عوامی رائے پر بیان کی ویڈیو کے لئے یهاں کلک کریںhttp://t.co/9SiQw8bjلارڈز: انگلینڈ نے انڈیا کو ہرا دیا http://t.co/HBz4eiRپاکستان کی سلامتی ،خود مختاری کے تحفظ کیلیے چین کی مدد جاری رہیگی،چینی وزیر اعظممسجد کا مقام و نور اسکے نمازى كى بدولت ھے جس مسجد(کعبہ) کے نمازى ابراھیم (عليه اسلام) ھوں ادھر هزار نمازوں کا... http://fb.me/ZPC8IPc8دس سال بعد سارہ مل گئی! http://saliqamag.com/free-online-urdu-magazine-%D8%A7%D8%B1%D8%AF%D9%88/3486فلپائن میں طوفان، ایک سو تیس افراد ہلاک: فلپائن میں میں اچانک آئے ایک طوفان اور سیلابی ریلوں کے باعث کم سے کم ای... ‎http://t.co/XI8L37Qh‏تبدیلی کا عہد http://t.co/nUvmmUmDسیکیورٹی فورسز کی کارروائی، 12شرپسند مارے گئے http://t.co/imloxJZ9روشن ٹیک ڈاٹ کام - لیپ ٹاپ / کمپیوٹر اون لائن شاپ http://t.co/vzPp5dLLلیپ ٹاپ کاروبار مدد http://asakpke-urdu.blogspot.com/2011/06/laptop-business-help.htmlبیادِ سڈنی: بیٹھنے میں جہاں زمانے لگے http://bit.ly/hLphoXملا عمر کا نام ایف بی آئی کی ویب سائٹ سے نکال دیا گیاامید کی ایک بہت چھوٹی ڈگری محبت کی پیدائش کا سبب کرنے کے لئے کافی ہے. ~ Stendhal http://bit.ly/dہم آج رات دیر تلک جاگتے رہے http://t.co/it4Y5KJBبرڈ فلو سے نئی ہلاکتوں کا خدشہ، عالمی ادارہ صحت کو تحقیق پر تشویش: چین میں حکام صحت کا کہنا ہے کہ برڈ فلو وائرس ... http://t.co/voifs6mTﺍﯾﺴﮯ ﻟﻮﮒ ﺍﺏ ﭘﮭﺮ ﮐﺒﮭﯽ ﻟﻮﭦ ﮐﺮ ﻧﮩﯿﮟ ﺁﺋﯿﮟ ﮔﮯ: ﺑﺴﻢ ﺍﻟﻠﮧ ﺍﻟﺮﺣﻤٰﻦ ﺍﻟﺮﺣﯿﻢﺍﻟﺴﻼﻡ ﻭ ﻋﻠﯿﮑﻢ ﻭ ﺭﺣﻤۃ ﺍﻟﻠﮧﻭ ﺑﺮﮐﺎﺗﮧ۔۔۔۔۔۔۔۔۔۔۔۔۔۔... http://t.co/ZrQKetibہر جیسا کہ میں نے زگا صبح ، آپ کی وجہ سے میں نے مسکرا کر رہے ہیں ، آپ کی وجہ سے میں محبلمحوں کا قرض سے اقتباسکسی نے بھی نہیں ، ناپا گیا ہے بھی نہیں شاعر ، دل کتنا کو روک نہیں سکتا. ~ Zelda فجرالڑ htt...لباہی۔ http://t.co/BFzusWdgریلوے ملازمین کا چیکوں سے تنخواہوں کی ادائیگی پر احتجاج --http://www.dailypak.com/index.php?pag=detail&id=33979افغانستان میں نیٹو کمانڈر کا آرمی چیف جنرل اشفاق کیانی سے رابطہ، نیٹو حملے کے بعدسے پاکستان کی جانب سے اطلاعات ک... http://t.co/3Dtq7H6Chttp://t.co/jyGBB2Uf قربانی کھانے اورتقسیم کرنے کے بارہ میں Twitter:... http://t.co/TNhKIHBaLearn a new word: "Amity" in Urdu is دوستی (dosti) http://t.co/tsgzniqmبات یہ تھی کہ اصو لوں کا لہو ہو تا تھا .... یوں نہیں تھا کہ ہمیں ان سے محبت کم تھی. ضیاءالدین نعیمNew Post : Join & Share plz News Update رھیے با خبر: Join & Share plz News Update رھیے با خبرNews Update رھیے... http://t.co/q5Svu0baLearn a new word: "Cobbler" in Urdu is موچی (mochi) http://t.co/5YuoZuVbڈھال: shield: noun. Example sentence:رستم نے ڈھال کے ساتھ حملہ روک دیا.Translation:The knight blocked the blow w... http://t.co/3OHbWV6Sکینیا کے اولمپکس چیمپیئن ہلاک http://t.co/fupP36B"اگر جسم کی نمائش جدیدیت ہے، تو جانور زمین پر جدید ترین مخلوق ہیں. “If exposure of your body is modernism, then... http://t.co/3RQbICbCعجیب اتفاق ھے کہ قادیانی زندیقوں کے خلیفے مرزا ناصر اور مرزا مسرور بھی پاکستان سے خاموشی سے روپوش ھو کر لندن پہنچ... http://t.co/nMNsBGt0’جاوید ہاشمی تحریکِ انصاف میں شامل‘ http://t.co/Q3GoVynIہم سب دہشت گردی کی لپیٹ میں ہیں۔ - http://t.co/2xgoQdz0یہ وہ پہلا مذہب ہے جس نے جمہوریت کی تبلیغ اور اسکی ترویج کی . جب مسجد میں پانچ وقت اذان دی جاتی ہے اور نمازی ،... http://t.co/gX1TOXzWنسوانی حسن میں اضافے کے لیے چھاتیوں میں سلیکون کی پیوند کاری کو صحت کے لیے نقصان دہ قرار یورپی ملک فرانس میں... http://t.co/edodbPnlیسوع نے بارہ رسولوں کو ایک ساتھ بلایا اور انکو بیماروں میں شفاء دینے کی قوّت اور بدروحوں کو قابو میں رکھنے کا اختیار دیا ۔ luk.9.1.urd================================ وصل کی تھی گھڑی ہجر کی رات تھی بے بسی دیکھیئے میرے حالات کی دیکھیئے اِس طرح نہ... http://t.co/psMAJE7lضروری اعلان http://t.co/yOwbJ9ac http://t.co/qF9u9Nzlجاوید ہاشمی کا کراچی پہنچنے پر والہانہ استقبال ، ملتان میں (ن) لیگ کے کارکنوں کا احتجاج: جاوید ہاشمی کا کراچی پہ... http://t.co/MB9MF6GXکلام بابا فرید گنج شکر رحمۃ اللہ علیہ http://nblo.gs/lnzwlمروجہ فقہ کی حقیقت http://t.co/wmv3DcRAاگر خالی پیٹ شوگر ٹیسٹ کرانے پر خون میں اس کی مقدار 100 ملی گرام سے 125 ملی گرام تک ہو اور کھانے کے دو گھنٹے بعد... http://t.co/mdsCIHnGقادیانیت علامہ احسان الہی ظہیر کی شہرہ آفاق کتاب سے ماخوذ http://t.co/CqIMgG70جولین فاؤنٹین سے مذاکرات کا آغاز ابھی نہیں ہوا، پی سی بی ذرائعلوگ غلط ، وسنگت ہیں ، اور خود ~ مرکوز. محبت انہیں بہرحال. ~ مدر ٹریسا http://bit.ly/cCEO0r خبر ہے کہ: خبر ہے کہ:ٹوکیو:انسان کے دماغ کا کنٹرول حاصل کرنے کی ٹیکنالوجی ایجادٹوکیو: سائنسدانوں نے انسان کے دماغ ... http://bit.ly/8MOuaZجب سے سنا ہے میں نے مری جا رہی ہو تم ۔۔۔۔۔ میرا یہ حال ہے کہ مرا جا رہا ہوں میں95فیصدپاکستانی نیوزچینلزکےشوقین | The News Tribe: http://t.co/8v8tVfNf via @AddThisبھارت کی پچاس لاکھ ڈالر کی امداد قبول http://goo.gl/fb/5ezDEUrduBlogz.com -: دشمنی کا بدلہ کس سے http://bit.ly/g5bpGfقادیانی جماعت کے آفیشل ترجمان نے تصدیقی بیان دیا ھے کہ میمو سکینڈل کے مرکزی کردار منصور اعجاز قادیانی جماعت سے... http://t.co/hHN6kytnاتنے ظالم نہ بنو ۔۔۔۔۔۔۔ کچھ تو مروت سیکھو تم پہ مرتے ہیں تو کیا مار ہی ڈالو گے ہمیں؟ابھی ممکن ہی نہیں قرض چکانا تیرا/ زندگی! قرض ترا ہوگا اَدا میرے بعدNawaiwaqt-Newspaper http://t.co/Euy2Adv via @AddThis ترے رب کی پکڑ! عامرہ احسانتجھی سے ابتدا ہے، تُو ہی اک دن انتہا ہوگا – جگر مراد آبادی - http://t.co/rpyJe8WUrduBlogz.com -: لینکس چلائیں بغیر سی ڈی اور یو ایس بی کے http://bit.ly/dHJ0osپاکستان میں پانی کی آلودگی کے سبب زہر آلود سبزیاں آلودہ غذا، تمباکو نوشی کے بعد سرطان کی دوسری بڑی وجہ بن رہی... http://t.co/CbV6qwFyبات کرنا: to talk: verb. Example sentence:یہ ایک دیوار سے بات کرنے کے برابر ہے.Translation:It's like talking to a wall. http://t.co/MuF5n7cPبیادِ سڈنی: شاعری کا جواب شاعری سے http://bit.ly/nsfy4Tمشرف کی جائیداد ضبط کرنے کا حکم http://t.co/gGvfNuXایرانی سرحدی محافظوں پر پاکستانی شہری کے قتل کا الزام | حالات حاضرہ | Deutsche Welle | 04.01.2012 http://t.co/6EcwjDaFپھر سوۓ حرم لے چل حج کے انتظامی مراحل اور قلبی کیفیات کے لۓ ایک رہنما کتاب قیمت : صرف 60 روپۓ ملنے کا پتہ :... http://t.co/FUH3H0Zeurdu news,pakistan news,گوجرانوالہ ، دو گروپوں میں تصادم،13افراد جاں بحق|اردو سکائی نیوز 29 دسمبر 20 http://t.co/jIsYOElbپیٹرول 1.65روپیہ فی لٹر مہنگا ،صدر کی ہدایت پر ڈیزل کی قیمت برقرار|اردو سکائی نیوز ، شام کا اخبار 31 http://t.co/1rYfvaC6============================== بس یہ ہی کہا نا کہ آپ سا حسیں ہے وہ بات تو ذرا سی ہے حشر کیوں اُتھاتے ہیں؟ احمد... http://t.co/BhYUJu1kتم محبت میں جب تم سونے نہیں کر سکتے کیونکہ حقیقت آپ کے خواب سے بہتر ہے. ~ ڈاکٹر Seuss httpاے ایمان والو! جب نماز کی اذان ہو جمعہ کے دن، تو اللہ کے ذکر کی طرف دوڑو! اور خرید و فروخت چھوڑ... http://t.co/dWqbehVvمیں نے کہا جی یہ ہر وقت جیب میں ہاتھ ڈال کر کچھ ٹٹولتا رہتا ہے کہنے لگے جی یہ الله والا آدمی ہے اور خدا کے اصل... http://t.co/ulTT6DhKگڈ بائے 2011: السلامُ علیکم ! سال 2011 آیا اور آکر چلا بھی گیا ، بالکل بھی پتہ نہیں چلا کہ کس طرح یہ سال ختم ہوگ... http://t.co/FfpT3yh2@noumaan_ یعنی کہ آپ جلسہ کے بدخواہ تھے :)لاہور:گھر میں آگ لگنے سے 4 بچے جھلس کر جاں بحق ،ماں زخمی|اردو سکائی نیوز 31 دسمبر 2011, Pakistan New http://t.co/y5381Q11@nadeemmalik میمواسکینڈل کےکرداروںکی اصلیت اورتاریخی حقائق(3) http://t.co/Nid0mJTrاگر ہے موت میں کچھ لطف تو بس اتنا ہے کہ اس کے بعد خدا کا سعاغ پائیں گے ہم *احمد ندیم قاسمی*ظالم کی حکومت اسکی موت سے ختم ہو جاتی ہے مگر شہیدوں کی حکومت انکی شہادت کہ بعد شروع ہوتی ہے http://t.co/GffjXvKcبتا کیا تو مرا ساقی نہیں ہے http://t.co/kx06vie via @AddThisLearn a new word: "Least" in Urdu is بہت کم (bohot kam) http://t.co/efshbjwQناسا کے مصنوعی سیارے چاند کے مدار میں امریکی خلائی ادارہ ناسا پہلی مرتبہ چاند کی کششِ ثقل کا مطالعہ کرنے کے لیے... http://t.co/atNJeRQPخانپور کی ادبی تقریبات کو نمایاں کوریج دیتے رہے۔بھاولپور اور ملتان میں ان سے چند ملاقاتیں بھی ہوئیں۔UrduBlogz.com -: دعوت http://bit.ly/h5vqQVنثار میں تیری گلیوں پہ اے وطن کہ جہاں ۔ ۔ ۔ ۔ چلی ہے رسم کہ کوئی نہ سر اُٹھا کے چلے ۔ فیضرابعہ بصری رحمتہ اللہ علیہا ایک مرتبہ کہیں کھڑی تھیں ان کے قریب سے ایک نوجوان گزرا اس نے اپنے سرپر پٹی باندھی ہوئی... http://t.co/mdVNTGeQ"دکھاوا کرنا: to show off: verb. Example sentence:اس نے یہ صرف اپنے دوستوں کے سامنے دکھاوے کیلئے کیا.Translation:... http://t.co/U0OaDWW2موسیقی کی کمپنیوں کی گوگل پر تنقید دنیا بھر کے مختلف ریکارڈ لیبلز کی نمائندگی کرنے والی ایک تنظیم آئی ایف پی... http://t.co/pHdPRkSO@alsha3rawy امين ياربوزراء کی کارکنوں کے طبلے پر تھاپ http://t.co/PHhfPmaIاردو کا ایک مشہور محاورہ ہے جتنے منھ اتنی باتیں ۔۔۔ از.......شمس جیلانی: جتنے منھ اتنی باتوں کے باوجودیہ تقاضہ ب... http://t.co/uv77qZEdMutual Funds: توانائی کے حصص میں سرمایہ کاری والے دو عالمی میوچل... http://t.co/tPZHahQامی اک شجرسایہ دار http://fb.me/15YE9l77cانڈا نہیں پہلے مرغی پیدا ہوئی: سائنسدان ۔ آخر کار جواب مِل ہی گیا http://goo.gl/fb/B89Hxہجر پابندِ ماہ و سال نہیں ہجر کے اَوج کو زوال نہیںسوات میں سیکیورٹی فورسز کا سرچ آپریشن ، اہم کمانڈر سمیت دو شدت پسند گرفتار خودکش جیکٹ ، اسلحہ اور بھاری مقدار میں بارودی مواد برآمدLearn a new word: "Level" in Urdu is ہموار (hamwaar) http://t.co/7emklMVZAnil Narendra انل نریندر: میرے بھارت مہان کی ایک تصویر یہ بھی ہے http://t.co/Kq9PSIFXمیں نے کہا جی یہ مکھی گند پھیلاتی ہے اس لئے مار رہا تھا ، بابا جی کہنے لگے یہ انسان کی سب سے بڑی محسن ہے اور تم... http://t.co/IP9i9oo4عدلیہ کا انتہائی احترام کرتا ہوں، وزیراعظم کا جواب میں موقفدھرتی کا بیٹا ہوں، وفاق کوٹوٹنے نہیں دوں گا،صدرزرداری|اردو سکائی نیوز ، شام کا اخبار 27 دسمبر 2011 | http://t.co/NSEP3zsaہماری ضرورت اجتماعی توبہ - http://t.co/y8Ue3y7قومی اسمبلی میں جنوبی پنجاب اور ہزارہ صوبے بنانےسے متعلق قرارداد پر بحث کے دوران مختلف اراکین کے درمیاں تلخ کلامی ہوئی اور عوامی نیشن...@Kashif_Hafeez معذرت بھائی، یہ فہرست بہت پہلے مرتب کی تھی۔ چلیں اب آپ کا اضافہ کر دیا ہے :)سال نو كى رات ذكر و دعا اور تلاوت قرآن كا حكم http://t.co/XjauT66p Twitter... http://t.co/iLnJQH0Aکیسا جلا گئے ہو/ بجھتا ہی جا رہا ہوں@UrduWriter ۱۔ مت بنو ان مشرک لوگوں میں سے جنہوں نے اپنے دین کو پراگندہ کردیااور دین کو ٹکڑے ٹکڑے کرکے مختلف فرقوں میں بٹ گئے@DrBabarAwan میمو: سنسنی خیز انکشافات read the article memogate very informative http://t.co/xRLhUrG7جرمنی . سبکدوش سفیر پاکستان کی جرمن پاکستان ایسوسی ایشن کارلز رُوہے کے ارکان سے ملاقات: شاہد کمال نےجرمنی اور پ... http://t.co/6Hz9qOCoقربانی ء اسمٰعیل امت مسلمہ کو حج ِ بیت اللہ، قربانی اور عید الضحٰی مبارک ہو اپنے بندے کا خدا جب امتحاں لینے لگا... http://t.co/yutLWtYLانصاف وہ جو مرضی کا ہو۔۔۔۔ از ۔۔۔۔۔محمدثقلین رضابھکر: خدا نے آج تک اس قوم کی حالت نہیں بدلینہ ہو جس کوخیال آپ اپ... http://t.co/LjYULJgxنیویارک کا امن برباد نہیں کرنے دیں گے، بلوم برگ: نیو یارک کے میئر اور گورنر نے مسجد اور مندروں پر پٹرول بم حملوں... http://t.co/Lp0c0BSHملک کے اندر اور باہر کیا کھچڑی پک رہی ہے؟ http://t.co/MpGxu8o9پاکستان کے قبائلی علاقے شمالی وزیرستان میں حکام کے مطابق ایک پہاڑی نالے سے فرنٹیر کانسٹبلری کے پندرہ اہلکاروں کی لاشیں ملی ہیں جنھیں ...سامراجی مداری مسٹر زرداری اور چرخہ ء شیطانی گیلانی کی ملک فروش ٹیم کا ھر غدار وطن اھلکار سامراجی و صلیبی ایجنڈے... http://t.co/wgfSjfcgالاسلامی حقوق http://t.co/gftqpLuO Twitter: http://t.co/2TzTBZGt http://t.co/qjWl0yVa۱۹۸۰ء میں اقبال ساغر صدیقی نے بطور خاص میری حوصلہ افزائی کی۔میری بہت ساری نئی تحریریں امروز میں بڑی محبت کے ساتھ چھاپتے رہے۔جمیعت علما اسلام ف کے سربراہ مولانا فضل الرحمن نے کہا ہے کہ کراچی کے واقعات سے ملک دولخت ہوسکتاہے،دھمکی آمیز ٹیلی فون کال سنگین غلطی تھی، جرمن صدر کی معذرت | حالات حاضرہ | Deutsche Welle | 05.01. http://t.co/49nY1gj4ملک میں جمہوریت کے نام پر بادشاہت قائم ہے، مسلم لیگ ن کی قیادت شریف خاندان جبکہ پیپلز پارٹی کی بلاول بھٹو کو ملے... http://t.co/jtNsr3YIدہشتگردی میں معاونت کا الزام، پاکستانی شہری کو امریکہ میں چار سال قید کی سزا http://t.co/6zPWJWRiجان دی، دی ہوئی اسی کی تھی حق تو یوں ہے کہ حق ادا نہ ہوا ! (غالب)قیمت اپنی کچھ بھی نہیں تھی، شان ہے اُس پیارے کی/ یاروں نے بے مول کیا تھا، اُس نے کیا اَنمولامریکہ میں مسلمان: حجاب پہننے والی خواتین کے بارے میں جریدہ http://t.co/uK1OsCL via @URDUVOAمحمود عباس کے لیے نہ جائے ماندن نہ پائے رفتن کی صورت حال: اردن میں مشرق وسطٰی کے امن مذاکرات کو دوبارہ شروع کرنے... http://t.co/7ex0M6Ujاسلام کے دامن میں بس اس کے سوا کیا ہے اک ضرب ید اللہی اک سجدہ شبیری علامہ اقبالؒگاڈ پارٹیکل‘ کے ممکنہ مشاہدے کا دعوٰی http://t.co/MZRoBRR9محبت کرے کہ تم (چیزوں کی جنہیں تم نے سوچا ممکن نہیں کر سکتے ہیں. ~ فل کولنس http://bit.ly/bXmV@etribune روکے جانے والے امریکی شہری ایک ثقافتی طائفہ کا حصہ تھےاور انہیں اب چھوڑ دیا گیا ہے۔موزے يا جرابوں پر مسح كرنے كا طريقہ http://t.co/sfsGXy7Z Twitter http://t.co/2TzTBZGt http://t.co/HtxEBQEvہزارہ اورسرائیکی صوبے بننے تک چین سے نہیں بیٹھیں گے:الطاف حسین --http://www.dailypak.com/index.php?pag=detail&id=33985انسان دولت کمانے کے لیے اپنی صحت کھو دیتا ہے پھر صحت واپس پانے کے لیے دولت کھوتا ہے۔ مستقبل کو سوچ کر اپنا حال... http://t.co/SBEoq2D4Religion Articles : http://t.co/usEKhC29 - قتل حسین اصل میں مرگ یزید ہے http://t.co/b2GT4pNXUrduBlogz.com -: مجھے میری ذات سے نفرت ہے http://bit.ly/gnE8L7سڈنی ٹیسٹ میں مائیکل کلارک کی ٹرپل سنچری: آسٹریلوی کرکٹ ٹیم کے کپتان مائیکل کلارک نے سڈنی ٹیسٹ کے تیسرے دن ٹرپل ... http://t.co/WWxgHijzجزیرہ نما کوریا ایک اہم موڑ پر ہے، سیول حکام: جنوبی کوریا کے صدر لی میونگ باک نے کہا ہے کہ شمالی کوریا میں اقتدا... http://t.co/F27Xitfk@Shafqat_Mahmood میمواسکینڈل کےکرداروںکی اصلیت اورتاریخی حقائق(1) http://t.co/P5qHfJOSدھواں: smoke: noun. Example sentence:جہاں دھواں ہے، وہاں آگ ہے.Translation:Where there's smoke, there's fire. http://t.co/JBRYzuakخواتین و حضرات ! گاڑی کا وہ میکینک کام کرتے کرتے اٹھا اس نے پنکچر چیک کرنے والے ٹب سے ہاتھ گیلے کے اور ویسے ہی... http://t.co/8xbFI6hEصدر زرداری نے پیپلز پارٹی کے سینئر رہنما اعتزاز احسن کو بلاول بھٹو زرداری کا استاد مقرر کر دیا: صدر زرداری نے پی... http://t.co/Xi2AxlXwشروع کرنا: to start: verb. Example sentence:چلو اس جشن کو شروع کریں.Translation:Let's get this party started. http://t.co/NmRu3r3Jسرشار زندگی زندگی رہنے کے قابل ہے. آپ اپنے پورے دل کے ساتھ دینا چاہئے. ~ این Dillard http:/دیرینہ دشمنی پر فائرنگ سے ایک شخص قتل، دو شدید زخمی..http://www.dailypak.com/index.php?pag=detail&id=34010صدیوں کی روایات کے امین لاہور شہر نے باغات اور شاہراہوں کو قومیانے کے عمل کا سامنا باقی شہروں کے مقابلے میں نسبتاً زیادہ کیا۔#Ashoraa #jashen #matam يوم عاشورا كا جشن منانے يا اس ميں ماتم كرنے كا حكم http://t.co/f8RMxn0q... http://t.co/5WAC1L4sUrduBlogz.com -: کسٹمر http://bit.ly/f9DqfWو میل تک آئے گی،⁰ليكن دو لوگوں کو وه خوشبو نصیب نہ ہوگی،⁰⁰ایک ماںStocks: اپریل میں 338 نئی کمپنیز کا اندراج کیا گیا http://t.co/2gyngI2دماغ کی بیٹری ان افراد کے لیے ، جنہیں بات ذرا دیر سے سمجھ آتی ہے، یا کچھ سیکھنے میں دشواری کا سامنا کرنا پڑتا... http://t.co/bffG865b’اے ایمان والو! جب نماز کی اذان ہو جمعہ کے دن، تو اللہ کے ذکر کی طرف دوڑو! اور خرید و فروخت چھوڑ... http://t.co/xa6m4OAsPart 3rd ‎حديث نبوي اور سائنس کے اعترافات: ” طاعون عذاب ہے ، جو بنی اسرائیل کے ایک گروہ پر اور تم سے پہلو... http://t.co/Dqw4qhqyبات یہاں سے شروع ہوئی تھی کہ جھانکا لگانے والا بڑا خوار اور خجل خراب ہوتا ہے - وہ جھانکا چاہے کسی کے گھر ، دروازے... http://t.co/RtBuXoLxگول میز: یہ کیا ہے ؟یہ گول میز ہے ۔اس کی کیا ضرورت تھی بھلا؟اس پر گول میز کانفرنس ہوگی ، گفتگو ہوگی۔لیکن گفتگو ... http://bit.ly/hN2mPu'غالب' دیکھنے سے زیادہ بہتر سالِ نو کا آغاز کیا ہوگا؟ ویسے کوئی عامر لیاقت کو بھی بتا دو :) ثواب عمار کی نذر Ammar IbneZia#news #pakistan #chat ﺍﻟﺴﻼﻡ ﻋﻠﯿﮑﻢ ! ﺩﻭﺳﺘﻮ ﺁﭖ ﮐﺎ ﺳﺎﻝ ﮐﺎ ﭘﮩﻼ ﺩﻥ ﮐﯿﺴﺎ ﮔﺰﺭﺍ ؟ plz reply me ﻋﺎﺻﻤﮧ ﮐﺎﺗﺤﻘﯿﻘﺎﺗﯽ ﮐﻤﯿﺸﻦ ﮐﮯ... http://t.co/jKJMkk2Y#SecClintonہم طالبان کو ایک انچ زمین نہیں دیں گےاوران کی خواہش کہ افغانستان میں ترقی کا پہیہ الٹا گھوم جائے پوری نہیں ہوگی:سیکریٹری کلنٹنطالبان کو پاکستانی سکیورٹی فورسز کی معاونت: خفیہ رپورٹ http://t.co/alkjP2bM #Urduامریکا براعظم ایشیا میں اپنی فوج کی موجودگی کو یقینی بنائے گا، بارک اوباماNew Post : Arfa Kareem Photos Album.: Arfa Kareem Photos Album.ارفع کے ہاتھ اور پاؤں کی انگلیوں میں حرکت، والد ... http://t.co/FmtcFFWmتیری وفا سے کیا ہو تلافی، کہ دہر میں تیرے سوا بھی ہم پہ بہت سے ستم ہوئے (غالب)قبرِ اقبال سے آرہی تھی صدا،یہ چمن مجھ کو آدھا گوارا نہیں۔ http://t.co/jbADJUILدگ دگى بجانے سے قلندر نہیں بنتے تسبى گومانے سے پیغمبر نہیں بنتے ایسے هى صوفیاء كى کتابیں پڑھنے سے اور انکے اقوال... http://fb.me/F5pC39SFSarmayakar: جولائی تا اپریل: مہنگائی کی شرح میں 14.08فیصد اضاف... http://t.co/OMWoysYمیمو اسکینڈل پر بلیک بیری بنانے والی کمپنی کا ردِ عمل: پاکستان کے میمو اسکینڈل میں بلیک بیری کے ریکارڈ کی خبروں ... http://t.co/alLAwfvJگیس سے چلنے والا پاکستانی پنکھا http://t.co/M2dJTcU via @AddThisہریاول گھر: greenhouse: noun. Example sentence:سائنسدان گرین ہاؤس اثر کے بارے میں فکرمند ہیں.Translation:Scienti... http://t.co/KZ5O4VLhہم مسلمان کیوں ہیں: عارف محمود کسانہ کی بچوں کے لئے لکھی گئی خوبصورت تحریر۔۔۔۔پیا رے بچو آپ تو جانتے ہی ہوں گے ک... http://bit.ly/ieXYsVچین ایران کے ممکنہ اقدام کا مخالففاروق درویش کی طرف سے میرے تمام ھموطنوں، دیش بھگت سیاست دانوں اور بستئ افلاس کے مفلوک الحال مکینوں کو نیا سال... http://t.co/Rq9vVvNoLearn a new word: "Help" in Urdu is مدد (madad) http://t.co/2vE3hI5z’’اے ایمان والو! تم اللہ کی خاطر حق پر قائم ہو جاؤ اور سچائی اور انصاف کے ساتھ گواہی دینے والے بن جاؤ۔منصور اعجاز میمو سپیشل ۔۔۔۔۔۔۔۔۔۔۔۔۔ غداریوں کی داستاں۔۔۔۔۔۔ خبرنامہ ء سیاہ ست منصور اعجاز کا میمو کس کس کو لے... http://t.co/DWwkSGr8جلنا: to burn: verb. Example sentence:وہ کہتے ہیں کہ وقت ایک آگ ہے جس میں ہم جلتے ہیں.Translation:They say time ... http://t.co/wHr5Cn13وزیراعظم گیلانی نے کہا ہے کہ سرائیکی صوبے پر دو تہائی اکثریت حاصل ہوچکی ہے: وزیراعظم  نے کہاکہ ایم کیوایم اتفاق... http://t.co/N4GOgKr3میمو کیس، عدالتی کمیشن نے صدر زرداری کو نوٹس جاری کر دیا --http://www.dailypak.com/index.php?pag=detail&id=33973چین میں گزشتہ سال دس لاکھ ویب سائیٹس بند http://t.co/Fz9cHNvUrduBlogz.com -: چونے کا اثر http://bit.ly/ffT8MVکوئی بھی جذباتی ہو جائے ، لیکن یہ سچ ہے محبت کرنے والوں لیتا ہے پاگل ہو کر سکتے ہیں. قومی اسمبلی : نئے صوبوں کے معاملے پر ہنگامہ،این پی کا واک آوٴٹ|اردو سکائی نیوز، صبح کا شام کا اخبار. http://t.co/EmBBuY2Jقائد اعظم کی زندگی کا روحانی پہلو۔ پروفیسر محمد سرور شفقت « اردو ہے جس کا نام http://t.co/FulMhP6Oتھرکول کی گیس سے ابتدائی طور پر 100 میگاواٹ بجلی بنائینگے، ڈاکٹرثمرمبارکلہو کی تیغ لیے اسپ حق پہ ھو کے سوار۔ اصول کر گئے انسانیت کا باب حسین۔ وہ عین آخری اور کاری وار تھا شہ کا۔ جھکے تھے سجدے کو جب منزلت مآب حسینUrduBlogz.com -: 25 مسائل اور انکا اسلامی حل http://bit.ly/gDGypuآسیہ بی بی کو کوئی خطرہ نہیں ہے، شوہر: گزشتہ برس پاکستان میں توہین رسالت کے جرم میں سزائے موت پانے والی مسیحی خا... http://t.co/m2PxGmQc@ShezrehMirza @AAKASHPUNHANI میمواسکینڈل کےکرداروںکی اصلیت اورتاریخی حقائق(3) http://t.co/Nid0mJTrقصہ کچھ ہماری فطرت ثانیہ کا ۔۔۔۔۔۔۔۔۔۔: ابھی ہم کلینک نماڈربے سے ڈاکٹر صاحب کے سلیقہ اور قابلیت کا اندازہ لگانے .. http://tinyurl.com/de3ol3پردے میں رہنے دو پردہ نہ اٹھانہ http://t.co/X08eZXJy http://t.co/RLkJs2omآئینی ذمے داری ہے کہ ووٹر لسٹیں ہر سال اپ ڈیٹ ہونی چاہییں، سپریم کورٹامریکی سفارتخانہ اسلام آباد کی جانب سےپاکستانی تبادلہ پروگرام کے طالبعلموں کی اعانت۔ سو سے زیادہ پاکستانی امریکی یونیورسٹیوں میں جا رہے ہیںان کے کہنے کے مطابق شاگردوں نے ویسا ہی کیا سب لوگ زمین پر بیٹھ گئے ۔ http://t.co/elp0J9W5کیا تم سے محبت کی آپ کی اعلی ذات کے طرف سے نشانی ہو جو تم کیا کرتے رہے ہیں. ~ Sanaya رومنبیشک جنت کے دروازے تلواروں کے سائے تلے ہیں۔ http://goo.gl/fb/Hm2n1کراچی ٹارگٹ کلنگ و بینک ڈکیتیاں ، لاقانونیت کا ایک اور سال مکمل http://t.co/N2rtsG9zایک نئے آدم کی پھر تشکیل ہے میٹھے پانی!/ جذب ہو میری مٹی میں یا مجھ کو خود میں گھولمیری غزل ھر مظلوم ھموطن کی نذر اندھی آنکھوں والا راجہ گدھ مورے گھر آوے گا زندہ لاشے بھوکے بچے دیکھ نہیں کچھ پاوے... http://t.co/YXkmCapmمتنازعہ: controversial: adjective. Example sentence:یہ ٹی وی شو تشدد دکھانے کے باعث متنازع ہے.Translation:This t... http://t.co/DMvgGP3aمایوسی سے کیسے نکلا جاۓ؟ http://fb.me/Z1MGnLXJبغیرپائلٹ طیاروں کا پہلاسکواڈ پاک بحریہ میں شامل: http://t.co/IKxUsWM via @aajdailyفاسٹ فوڈ کے اشتہارات بچوں کے لیے نقصان دہ فاسٹ فوڈ کا استعمال دنیا بھر میں بڑھتا جا رہا ہے فاسٹ فوڈ کمرشلز... http://t.co/ysMD1B3rاوباما کا مقابلہ کون کرے گا، دوڑ شروع: 3 جنوری کو امریکی ریاست آئیووا کے ووٹر اس بات کا فیصلہ کریں گے کہ ری پبلک... http://t.co/i3B3grix@zubijpj جی وہ اخبار مل گیا تھا۔ مزے کی بات ہے ہمارے گھر بھی ایکسپریس ہی آتی ہے لیکن کسی کی اس پر نظر نہیں پڑھی اور پھر ایک ہفتہ بعد پتہ چلاLearn a new word: "Grounded" in Urdu is پساہوا (pisaa hua) http://t.co/NvWtSDkhتکبر کبھی علم کو پھلنے پھولنے کا موقع نہیں دیتا - جو علم عاجز نہیں منکسر نہیں ، وہ محض ایک دھوکہ ہے- ایک گھمنڈ اور... http://t.co/qc9ansoYStories: دنیا کی پانچ بڑی کمپنیاں ؛ ہر ایک کی آمدن پاکستان ... http://t.co/nkAFJc3بے لگام عوامی نمائندے http://t.co/3wryas3A( ۔۔۔ دنیا و آخرت میں نفع کے لئے 25 سنھر ی اصول ۔۔ )‏‎: حضرت خالد بن ولید رضی اللھ تعالی عنھ فرماتے ھیں کھ ھم رس... http://t.co/QGtYm1xnہم نے سوچا کہ جسمانی تکلیف ان ذہنی تکالیف سے شدید تر نہیں ہے ، جو انسانی زندگی میں منفیانہ سوچ اور منفیانہ پیش... http://t.co/UzhJp7Qeہم جو اپنے آبا و اجداد سے ، بزرگوں سے ، اپنے بڑوں سے سنتے آئے ہیں، کتابوں میں بھی کبھی کبھی پڑھنے کو مل جاتا ہے -... http://t.co/j08XhSC2بیادِ سڈنی: سر مُنڈاتے ہی http://t.co/DPvWawNگوشت حلال،انشورنس حلال ، ڈاٹ کام حلال مگر سوچ حرام ۔از-صفدر ھمٰدانی: حلال گوشت دس میل دور سے خریدیں گے لیکن حلال... http://t.co/gG4Kgjiuشاندار مستقبل لیبیا کے عوام کاحق ہے: صدر اوباما, http://t.co/NAtSPGhلندن فسادات بھڑکانے میں سوشل میڈیا کا ہاتھ ہے، برطانوی اخبار:محبت ، پیار ، سچا پیار ، پوچھ یا بدلے میں کچھ بھی مطالبہ کے بغیر یہ ہے کہ جو سب سے زیاحسین حقانی نے مبینہ میمو کی تحقیقات کے لیے کمیشن کے سامنے پیروی کے لیے سید زاہد حسین بخاری ایڈوکیٹ کی خدمات حاصل کر لی ہیں۔ڈبے میں بند سُوپ کے نقصانات، نئی تحقیق افزائش نسل کا نظام متاثر ہو سکتا ہے۔ امریکی ماہرین کی ایک نئی ریسرچ سے... http://t.co/sJCXMqI6سپریم کورٹ نے ذوالفقار بھٹو کی سزا سے متعلق صدارتی ریفرنس کی پیروی کرنے والے وکیل بابر اعوان کو ایک اور اظہار وجوہ کا نوٹس جاری کردیا۔زندگی میں ہمیشہ سچ کی جیت ہوتی ہے اور جھوٹ ہزار پردوں میں بھی ہو تو آخرکار ایک دن پکڑا جاتاہے۔Learn a new word: "Almighty" in Urdu is مطلق (mutliq) http://t.co/RVSMKjEaپاک افغان طالبان کا تمام توجہ اتحادی افواج پر مرکوز رکھنے کا اعلان|اردو سکائی نیوز، صبح کا اخبار 2 ج http://t.co/2pg3OntGسال2010کی ہلاکتوں میں8ماہ بعدایک اورکا اضافہ http://wp.me/pK9kd-cHکیا پاکستان کا مستقبل تابناک ہے؟ http://nblo.gs/k3pnNریاستی اسمبلی کا گرمائی اجلاس شروع http://t.co/TyleeaSiمحترم اور بے حد عزیز فیس بک دوست آداب! دل کی آرزو ھے کہ یہ پیام آپ کو ھر لحاظ سے بہترین حال میں ملے عید کے اس پر... http://t.co/dbbvx7n9میمواسکینڈل کےکرداروںکی اصلیت اورتاریخی حقائق(1) http://t.co/P5qHfJOS میمواسکینڈل کےکرداروںکی اصلیت اورتاریخی حقائق(2) http://t.co/voozMAtpکیا حقیقت کیا افسانہ عقل والوں کو دعوت فکر: بے چاری مظلوم عورت !Poor Women http://t.co/xRJ7vVCترکی کی تاریخ میں پہلی بار آرمی چیف آف جنرل اسٹاف کی سول عدالت میں پیشیایک جانا ~ گھر ہے جگہ ہونا. کسی کو ہونا ~ محبت کو ایک خاندان ہے. دونوں ~ ہونا ایک نعمتاس کی زندگی کو ہم نے بڑی باتیں نہیں کر سکتے میں. ہم نے بڑی محبت سے چھوٹی چھوٹی باتوںاگر جنت میں اپنی مرضی کی زندگی گزارنا چاھتے ہو تو دنیا میں اللہ کی مرضی کی زندگی گزارو.خدا وندا! یہ تیرے سادہ دل بندے کدھر جائیں کہ درویشی بھی عیاری ہے ،سلطانی بھی عیاری#Pakistan @usmariaotero امریکی انڈر سیکرٹری ماریہ اوطیرو حکومتی اہلکاروں، سول سوسائٹی کے نمائندوں اور نوجوانوں کی قیادت سے ملاقات کرینگی۔سکوتِ شب سے کسی شب کلام کر تو سہی جواب دِل تجھے دے گا ، سلام کر تو سہیمیں ترے خط ’’اگر‘‘ جلاؤں گا راکھ کو گنگا میں بہاؤں گاسپریم کورٹ نے الیکشن کمیشن سے ہر 15 روز بعد پیشرفت رپورٹ طلب کرلیکشمیر:معرکہ آرائی میں 3جنگجو جاں بحق http://bit.ly/aqtzqYLearn a new word: "Umbrella" in Urdu is چھتری (chhatri) http://t.co/uTsnzQXq#SecStateسیکریٹری کلنٹن این بی سی پر:شدت پسندوں سے لاحق خطرات سےامریکە کو افغانستان کی طرف سے اور پاکستان کو اپنی جانب سے نمٹنا ەوگا ۔ #Iraqبیادِ سڈنی: تصویرِ ہمدرداں- ہمدرد کی بس میں سفر ہو رہا ہے http://bit.ly/gE2bxsLearn a new word: "Anguish" in Urdu is انتہائی تکلیف (intehaai takleef) http://t.co/JrkQ8slpعید مبارکتیسری تصویر: یوں تو تحریکِ پاکستان میں بے شمار عظیم ہستیوں نے بہت لگن اور محنت سے کام کیا اور بے شمار قربانیا... http://t.co/Wh3vmJKZدوران وضوء نبى كريم صلى اللہ عليہ وسلم كے واسطہ سے دعا كرنا http://t.co/kGtVFQPC Twitter... http://t.co/C71z4fbyتیو نس کے صدر کی طر ف سے لیبیا کے سابق وزیراعظم کی حوالگی کی یقین دہانی --http://www.dailypak.com/index.php?pag=detail&id=33954یہ سال بھی گزرا ہے ترے پیار کی صورت ۔۔۔۔ آتے ہوئے کچھ اور تھا جاتے ہوئے کچھ اورمخدوم جاوید ہاشمی کراچی پہنچ گئے